[
    {
        "Date": "2024-10-16T13:25:54.000Z",
        "Title": "Is Meta Platforms, Inc. (META) the Best High Growth NASDAQ Stock That is Profitable in 2024?",
        "Author": "  Talha Qureshi ",
        "Text": "We recently compiled a list of 10 High Growth NASDAQ Stocks That Are Profitable in 2024. In this article, we will look at where Meta Platforms, Inc. (NASDAQ:META) ranks among the high-growth NASDAQ stocks that are profitable.\nMalcolm Ethridge, Capital Area Planning Group managing partner, joined CNBC to talk about where the market could go and his sentiment regarding the AI and overall tech sector. While many analysts believe that it will be the small caps that will lead the growth with interest rates easing and the economy slowing down. We recently covered the 8 Most Undervalued Penny Stocks To Buy According To Analysts, where we talked about how Tom Lee, co-founder of Fundstrat Global Advisors likes the small cap in the current market environment. Here’s a piece from the article:\n“To talk about what the stock market looks like today and in the near future. Tom Lee, co-founder of Fundstrat Global Advisors joined CNBC in a recent interview. He has been one of the strong proponents and supporters of small-cap stocks. Lee says that we are in a volatile environment currently, due to a few reasons, one being the elections in less than 30 days, the second being the Middle Eastern crisis which is scaring investors, and lastly the port strike that has the potential to cripple the economy. However, he still expressed his optimism that the year-end has a lot of tailwinds and investors shouldn’t be afraid to buy the dip. Moreover, Lee also highlighted that these current events are all short-term headwinds in a buying cycle and are expected to die down quickly.\nEthridge thinks otherwise, he believes that mega-cap stocks will continue to lead market growth, although not at the same pace as in recent years but still at a steady pace. He attributes this to the ongoing influence of artificial intelligence (AI) on various sectors, including real estate and manufacturing, which are becoming increasingly vital due to rising demands on infrastructure.\nMoreover, while explaining why the mega caps will lead the growth, Ethridge pointed out that for the big tech stocks, Fed rate cuts were not necessary as they had significant cash on their balance sheets to reinvest into newer AI ventures. We have already seen Magnificent Seven invest heavily in AI despite the high rate of borrowing thereby leading the bull market in difficult times.\nThe rate cuts have now made it easy for other companies that didn’t have enough cash to borrow and invest in technology. However, he also pointed out that the pace of rate cuts might slow down moving forward, thereby making it hard for small caps to keep up the technology investment race. Ethridge suggests that investors may need to adjust their expectations regarding future Federal Reserve rate cuts.\nMoreover, we are also entering earnings season, will the earnings derail the momentum or continue to boost the market? Drew Pettit, Citi Research Director of US Equity Strategy joined CNBC in another interview. He thinks that we are in for a decent quarter, although we are in an expensive market.\nWhile talking about how various sectors will perform, Pettit mentioned that software has the highest bar within tech, meaning its growth expectations are high, yet many software companies are not monetizing effectively. This creates volatility in stock performance. As earnings reports come in, Pettit suggests investors should focus on consumer behavior and credit conditions, particularly in the banking sector, which is expected to perform well this quarter. He also encouraged investors to look beyond the recent quarter earnings into 2025 and 2026, while choosing companies to invest in.\nOur Methodology\nTo curate the list of 10 high-growth NASDAQ stocks that are profitable in 2024 we used the Finviz stock screener, Seeking Alpha, and Yahoo Finance as our sources. Using the stock screener, we got an initial list of major NASDAQ stocks sorted by their market capitalization. Next, we sourced the 5-year net income growth and revenue growth rates for these stocks from Seeking Alpha and the GAAP trailing twelve-month net income from Yahoo Finance. We only selected stocks that had 5-year net income and revenue growth of more than 15%. Lastly, we ranked the stocks by the number of hedge fund holders in Q2 2024 from Insider Monkey’s database. The list is ranked in ascending order of the number of hedge fund holders.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n5-Year Net Income Growth: 24.69%\n5-Year Revenue Growth: 19.06%\nTTM Net Income: $51.43 Billion\nNumber of Hedge Fund Holders: 219\nMeta Platforms, Inc. (NASDAQ:META) is another high-growth NASDAQ stock that is profitable in 2024. It is the creator and manager of famous social media platforms, Facebook, Instagram, and WhatsApp, and runs everything related to the social media that we have today.\nThe strategic edge of the company comes from its huge user base, which makes it impossible for any competitor to challenge its growth. While any tech company can create a social media platform, what they can’t do is drive active users like Meta Platforms, Inc. (NASDAQ:META) does. During the fiscal second quarter of 2024, the company reported more than 3.3 billion active daily users on its social media apps including Facebook, WhatsApp, and others.\nAnother quality that the company has developed over time is its high rate of Return on Invested Capital (ROIC). We recently saw investor confidence shattering due to a lack of return on AI investment by tech giants. But not with Meta Platforms, Inc. (NASDAQ:META), the company currently has a ROIC of 31%, which is more than 3 times the average of the S&P 500.\nIf we look at the past 5 years performance we see that the company has grown its bottom line by 25% and top line by 19%. During the second quarter of 2024, it brought in $10.9 billion in free cash flow indicating strong and profitable fundamentals.\nRowan Street Capital stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its Q2 2024 investor letter:\n“We are pleased to report that Meta Platforms, Inc. (NASDAQ:META), our largest position in the fund, has delivered a remarkable performance, +450% since our November 2022 note. Our investment in Meta dates back to 2018, with an average cost basis of approximately $172 per share. Today, the stock trades around $535, reflecting a 3x return over the six-year holding period, equating to a 20% annualized return.\nOverall META ranks 2nd on our list of the high-growth NASDAQ stocks that are profitable. While we acknowledge the potential of META as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for a promising AI stock that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure. None. This article was originally published on Insider Monkey.\n"
    },
    {
        "Date": "2024-10-02T20:58:07.000Z",
        "Title": "Meta confirms it may train its AI on any image you ask Ray-Ban Meta AI to analyze",
        "Author": "  Maxwell Zeff ",
        "Text": "We recently asked Meta if it trains AI on photos and videos that users take on the Ray-Ban Meta smart glasses. The company originally didn't have much to say.\nSince then, Meta has offered TechCrunch a bit more color.\nIn short, any image you share with Meta AI can be used to train its AI.\n\"[I]n locations where multimodal AI is available (currently US and Canada), images and videos shared with Meta AI may be used to improve it per our Privacy Policy,\" said Meta policy communications manager Emil Vazquez in an email to TechCrunch.\nIn a previous emailed statement, a spokesperson clarified that photos and videos captured on Ray-Ban Meta are not used by Meta for training as long as the user doesn't submit them to AI. However, once you ask Meta AI to analyze them, those photos fall under a completely different set of policies.\nIn other words, the company is using its first consumer AI device to create a massive stockpile of data that could be used to create ever-more powerful generations of AI models. The only way to \"opt out\" is to simply not use Meta's multimodal AI features in the first place.\nThe implications are concerning because Ray-Ban Meta users may not understand they're giving Meta tons of images – perhaps showing the inside of their homes, loved ones, or personal files – to train its new AI models. Meta's spokespeople tell me this is clear in the Ray-Ban Meta's user interface, but the company's executives either initially didn't know or didn't want to share these details with TechCrunch. We already knew Meta trains its Llama AI models on everything Americans post publicly on Instagram and Facebook. But now, Meta has expanded this definition of \"publicly available data\" to anything people look at through its smart glasses and ask its AI chatbot to analyze.\nThis is particularly relevant now. On Wednesday, Meta started rolling out new AI features that make it easier for Ray-Ban Meta users to invoke Meta AI in more natural way, meaning users will be more likely to send it new data that can also be used for training. In addition, the company announced a new live video analysis feature for Ray-Ban Meta during its 2024 Connect conference last week, which essentially sends a continuous stream of images into Meta's multimodal AI models. In a promotional video, Meta said you could use the feature to look around your closet, analyze the whole thing with AI, and pick out an outfit.\nWhat the company doesn't promote is that you are also sending these images to Meta for model training.\nMeta spokespeople pointed TechCrunch towards its privacy policy, which plainly states: \"your interactions with AI features can be used to train AI models.\" This seems to include images shared with Meta AI through the Ray-Bans smart glasses, but Meta still wouldn't clarify.\nSpokespeople also pointed TechCrunch towards Meta AI's terms of service, which states that by sharing images with Meta AI, \"you agree that Meta will analyze those images, including facial features, using AI.\"\nMeta just paid the state of Texas $1.4 billion to settle a court case related to the company's use of facial recognition software. That case was over a Facebook feature rolled out in 2011 called \"Tag Suggestions.\" By 2021, Facebook made the feature explicitly opt-in, and deleted billions of people's biometric information it had collected. Notably, several of Meta AI's image features are not being released in Texas.\nElsewhere in Meta's privacy polices, the company states that it also stores all the transcriptions of your voice conversations with Ray-Ban Meta, by default, to train future AI models. As for the actual voice recordings, there is a way to opt-out. When you first login to the Ray-Ban Meta app, users can choose whether voice recordings can be used to train Meta's AI models.\nIt's clear that Meta, Snap, and other tech companies are pushing for smart glasses as a new computing form factor. All of these devices feature cameras that people wear on their face, and they're mostly powered by AI. This rehashes a ton of privacy concerns we first heard about in the Google Glass era. 404 Media reported that some college students have already hacked the Ray-Ban Meta glasses to reveal the name, address, and phone number of anyone they look at.\nThis article originally appeared on TechCrunch at https://techcrunch.com/2024/10/02/meta-confirms-it-may-train-its-ai-on-any-image-you-ask-ray-ban-meta-ai-to-analyze/\n"
    },
    {
        "Date": "2024-10-14T21:45:19.000Z",
        "Title": "Meta Platforms (META) Gains But Lags Market: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "The latest trading session saw Meta Platforms (META) ending at $590.42, denoting a +0.08% adjustment from its last day's close. The stock lagged the S&P 500's daily gain of 0.77%. Meanwhile, the Dow gained 0.47%, and the Nasdaq, a tech-heavy index, added 0.87%.\nThe the stock of social media company has risen by 12.45% in the past month, leading the Computer and Technology sector's gain of 6.36% and the S&P 500's gain of 4.87%.\nInvestors will be eagerly watching for the performance of Meta Platforms in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on October 30, 2024. The company is forecasted to report an EPS of $5.15, showcasing a 17.31% upward movement from the corresponding quarter of the prior year. Alongside, our most recent consensus estimate is anticipating revenue of $40.1 billion, indicating a 17.42% upward movement from the same quarter last year.\nMETA's full-year Zacks Consensus Estimates are calling for earnings of $21.38 per share and revenue of $161.69 billion. These results would represent year-over-year changes of +43.78% and +19.86%, respectively.\nIt's also important for investors to be aware of any recent modifications to analyst estimates for Meta Platforms. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the past month, there's been a 0.08% rise in the Zacks Consensus EPS estimate. At present, Meta Platforms boasts a Zacks Rank of #2 (Buy).\nFrom a valuation perspective, Meta Platforms is currently exchanging hands at a Forward P/E ratio of 27.59. This represents a discount compared to its industry's average Forward P/E of 31.76.\nInvestors should also note that META has a PEG ratio of 1.44 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Software was holding an average PEG ratio of 2.03 at yesterday's closing price.\nThe Internet - Software industry is part of the Computer and Technology sector. At present, this industry carries a Zacks Industry Rank of 78, placing it within the top 31% of over 250 industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-17T21:17:27.000Z",
        "Title": "Meta’s ‘permanent’ efficiency layoffs affected about 100 employees, including engineering and business roles",
        "Author": "  Kali Hays ",
        "Text": "Scores of Meta employees have been laid off this week, as the company embraces a new corporate culture of “efficiency” around resources and headcount.\nAround 100 people were impacted by the latest round of reorganizations and a related reallocation of some resources inside Meta, three people with knowledge of the company told Fortune. Such changes and related incremental cuts to teams have been frequent at Meta this year, as CEO Mark Zuckerberg sticks to his vow that 2023’s “year of efficiency” would become a “permanent” part of how his company operates going forward. A handful of workers at Instagram and Messenger were cut earlier this year amid other team reorganizations and the elimination of certain job titles.\nThis week's cuts mark at least the third time this year that incremental layoffs occurred at Meta. This time, it mostly impacted people working in Instagram, Facebook, and Reality Labs, according to the people familiar. Many of those affected were software engineers whose specific roles were eliminated, but some jobs in monetization were also cut. The Verge first reported that layoffs occurred at Meta, although none of the specifics have been reported.\nMost of the people impacted received several weeks of advance notice that their roles were being either eliminated or moved to a new team or location, and were allowed to apply internally for other jobs made available to them. Some were successful. Some were not. Others accepted four months of severance in advance instead of going through that process, according to the people familiar.\nThe layoffs are separate from a disciplinary action Meta carried out last week that saw about 20 people in its Los Angeles office let go for improper use of GrubHub credits. The credits were given specifically for workers to buy meals while working at the office, but some were found to have used the credits for personal items or home delivery over the course of several months, as first reported by the FT.\nMeta, which had 70,799 full-time employees at the end of its most recently reported quarter, cut tens of thousands of employees over the course of 2022 and 2023 in the wake of the pandemic. While the company has not had such mass layoffs in 2024, team-specific reorganizations this year have felt “constant,” one person told Fortune, noting that Reality Labs seems to go through a re-org “every few months.”\nAnother person said that while such changes have long been a part of Meta’s operation, a new push toward work on AI projects means more and more resources are being directed to AI and infrastructure teams. The company is also going through a process of “remapping” roles, deciding where the bulk of specific teams will be physically located given a three-day in-office work mandate that has caused some jobs to be moved or eliminated, the person said.\n“A few teams at Meta are making changes to ensure resources are aligned with their long-term strategic goals and location strategy,” a Meta spokesperson told Fortune. “This includes moving some teams to different locations, and moving some employees to different roles. In situations like this when a role is eliminated, we work hard to find other opportunities for impacted employees.”\nHowever, not all of the people laid off were given such notice, two sources told Fortune. Several people were “surprised” by emails that hit their inboxes this week explaining that their last day of work would be this Friday because their role had been eliminated. “Everyone was not treated the same in this,” one of the people said.\nSeveral laid-off employees were in their jobs for one year or less, according to two of the sources. Jane Manchu Wong, who gained online notoriety for reverse-engineering incoming features for social media platforms before they were announced, joined Meta last year to work on its newest platform, Threads. However, she moved this year to a team within Instagram that was impacted by this round of layoffs. Wong posted that she was impacted by the cuts on Threads. However, no one working on the Threads team was laid off.\nDespite the incremental nature of this recent round of layoffs, workers within Meta are expecting more such cuts, either later this year or early next year. Although the company is hiring more, headcount is being kept “very tight,” the person said, and performance reviews are tougher than ever.\nAre you a Meta employee or someone with insight or a tip to share? Contact Kali Hays securely through Signal at +1-949-280-0267 or at kali.hays@fortune.com.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-10-09T13:45:13.000Z",
        "Title": "Here's Why Meta Platforms (META) is a Strong Growth Stock",
        "Author": "  Zacks Equity Research ",
        "Text": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\nAchieving those goals is made easier with the Zacks Style Scores, a unique set of guidelines that rates stocks based on popular investing methodologies, namely value, growth, and momentum. The Style Scores can help you narrow down which stocks are better for your portfolio and which ones can beat the market over the long-term.\nGrowth investors build their portfolios around companies that are financially strong and have a bright future, and the Growth Style Score helps take projected and historical earnings, sales, and cash flow into account to uncover stocks that will see long-term, sustainable growth.\nMeta Platforms is the world’s largest social media platform. The company’s portfolio offering evolved from a single Facebook app to multiple apps like photo and video sharing app Instagram and WhatsApp messaging app owing to acquisitions. Along with in-house developed Messenger, these apps now form Meta’s family of products used by almost 3.24 billion people on a daily basis as of Mar 31, 2024.\nMETA sits at a Zacks Rank #2 (Buy), holds a Growth Style Score of B, and has a VGM Score of B. Earnings and sales are forecasted to increase 43.6% and 19.8% year-over-year, respectively.\nOne analyst revised their earnings estimate higher in the last 60 days for fiscal 2024, while the Zacks Consensus Estimate has increased $0.09 to $21.36 per share. META also boasts an average earnings surprise of 12.6%.\nLooking at cash flow, Meta Platforms is expected to report cash flow growth of 42.7% this year; META has generated cash flow growth of 13.7% over the past three to five years.\nMETA should be on investors' short lists because of its impressive growth fundamentals, a good Zacks Rank, and strong Growth and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]