[
    {
        "Date": "2024-01-25T10:30:00.000Z",
        "Title": "Meta Platforms Stock Is 328% Off Its 2022 Low. Should Investors Sell?",
        "Author": "  Justin Pope, The Motley Fool ",
        "Text": "Sometimes, investing questions have no perfect answer. Shares of Meta Platforms (NASDAQ: META), the social media giant that owns Facebook, Instagram, and WhatsApp, have risen a staggering 328% since late 2022. Do investors who rode most of this exhilarating ride sell and take their profits?\nAt first glance, \"duh\" might be the correct answer. Gaining over 300% would take years in the broader stock market. There's nothing wrong with doing just that. However, there is a strong argument that Meta's stock still has some mojo left. Perhaps it can continue building on its epic run.\nLet's look at the evidence and see if investors have enough in hand to make the right call. There's also an alternative worth considering.\nWhat Meta Platforms has gone through over the past three years is a testament to the power and impact of market sentiment. From 2021 to late 2022, Wall Street began turning sour on the social media giant.\nWhy? CEO Mark Zuckerberg was spending tens of billions of dollars on his new Reality Labs segment. Meanwhile, iOS privacy updates hurt how effectively Meta's ads could work on Apple devices. The stock cratered from nearly $400 per share to under $90.\nAt the time, the news headlines and social media posts were saying things like, \"Mark Zuckerberg doesn't know what he's doing.\" The criticisms were being directed at the same guy who bought Instagram for $1 billion and turned it into something arguably worth more than 100 times that today.\nBut a funny thing happened. Meta began adapting to the iOS changes. Zuckerberg ordered up some cost-cutting to restore Meta's free cash flow and put growth back on track while balancing continued investments in Reality Labs and artificial intelligence (AI).\nJust about every long-term investor is going to face some adversity. Almost no company can grow for decades without some volatility, and maybe even a huge drop. Sometimes, these companies never get it together, but sometimes they do. Those who stick with it are rewarded handsomely.\nThe real takeaway for investors here? Look for broken stocks, not broken companies. Meta's core app business grew its user base through all the turmoil. That intact core cog in the Meta machine made its rebound as simple as Zuckerberg making the company more efficient last year.\nNow that Wall Street has realized that Meta's business isn't broken after all, analysts have returned to expecting roughly 20% annual earnings growth from the stock. Today, Meta trades at a forward P/E of 22, which means its resulting PEG ratio of 1.1 signals the stock is a good value for the growth you might get.\nBased on its fundamentals, the stock is still a good deal despite its share price soaring from $89 to nearly $400 in 15 months.\nIt's natural for people to think that since the stock blasted off, it must be expensive. It's the opposite of thinking a stock is cheap because the price keeps decreasing. Ultimately, it's a company's fundamentals, its underlying business performance, that tell investors whether a stock is attractive.\nIf you bought Meta Platforms in late 2022, you are sitting on substantial investment returns. Do you sell and cash out? Remember, stocks are volatile, so even though Meta's future still looks bright, that doesn't mean the market won't throw in a curveball and mess up your unrealized gains (they're paper profits until you sell).\nSelling some, but not all, of your Meta shares could be the best of both worlds. Suppose your investment grew from $1,000 to over $4,000 over the past 18 months. If you sell half, that's enough to double your money. Even if Meta collapsed and the other half went to zero, you still made out very well.\nLocking in some gains and leaving the rest ensures that you've had a successful investment while leaving room for upside if Meta continues to grow and compound more investment returns.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Meta Platforms wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 16, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Meta Platforms. The Motley Fool has a disclosure policy.\nMeta Platforms Stock Is 328% Off Its 2022 Low. Should Investors Sell? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-20T21:50:00.000Z",
        "Title": "Meta Platforms Stock Rallied Nearly 200% Last Year -- Is It Too Late to Buy for 2024?",
        "Author": "  Nicholas Rossolillo, The Motley Fool ",
        "Text": "After an epic rally and nearly 200% gains in 2023, it may seem hard to believe that Meta Platforms (NASDAQ: META) had been all but left for dead by Wall Street in 2022. As 2024 gets underway, share prices of the parent company of Facebook, Instagram, WhatsApp, and the Quest virtual reality (VR) headsets are nearly back to all-time highs set during the pandemic.\nContrary to popular belief, Meta is far more than a social media business, nor is this company solely betting on the metaverse as its future (despite what the corporate name change a couple of years ago might have implied). Meta has a massive global data center network at its core, enabling millions of businesses -- especially small businesses -- to reach audiences. Don't write off the possibility Meta could have yet another great run in 2024.\nMeta is coming off of CEO Mark Zuckerberg's \"year of efficiency\" in which the company vowed to keep expenses in check after a pandemic-era spending spree. More on that in a moment, because one key to Meta stock's continued success in 2024 will be a resurgence in digital ad spending.\nWhen the company reports fourth-quarter 2023 earnings on Feb. 1, expect strong revenue growth to capture the spotlight. Management did forecast revenue to be $36.5 billion to $40 billion, implying as much as a 24% increase over Q4 2022. Meta is still lapping depressed results in 2022 from a falloff in peak-pandemic user activity and resulting digital spending on its apps, as well as the effects of Apple's privacy changes reducing Meta's ability to monetize ads on its fellow tech giant's devices.\nAdditionally, other companies involved in the digital advertising ecosystem -- like Adobe and Salesforce, both of which help with marketing analytics and ad distribution -- said that Black Friday, Cyber Monday, and holiday shopping in general hit fresh records in the final weeks of 2023. The two software giants reported mid- to high-single-digit percentage increases in online shopper spending versus 2022.\nMeta powers brand marketing for businesses all over the world -- owing to the incredible reach it offers with over 3.1 billion daily active users (as of the third quarter of 2023). Early indicators of strong consumer spending could mean great things for the social media company, which uses its data centers and new artificial intelligence (AI) algorithms to help marketers find an audience and realize sales.\nZuckerberg and company have indicated they have been pleased with renewed success in 2023, and that new modes of operating will continue into 2024 and beyond. That means not just revenue growth, but more profitable revenue growth.\nCutting back on expenses, paired with Meta's share repurchase program, have already done wonders. Earnings per share (EPS) in Q3 2023 were $4.39 -- a massive 168% increase from the same quarter in 2022, and a 36% increase over Q3 2021 (the pandemic EPS peak).\nA similar cadence of EPS increases is expected in Q4, and could perhaps continue into the new year. Thus, though Meta has an expensive-looking stock on a backward-looking basis (31 times trailing-12-month EPS, and 25 times trailing-12-month free cash flow), shares could actually be a value on a forward-looking basis (20 times Wall Street analysts' early estimate for 2024 EPS, and 21 times the estimate for 2024 free cash flow).\nIt doesn't look like it's too late to invest in Meta stock for the long term. The business is back on track with a focus on profitable growth, and its data centers and AI are unlocking healthy returns for marketing customers. Meta could be another standout winner in 2024.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Meta Platforms wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 8, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Nicholas Rossolillo and his clients have positions in Apple, Meta Platforms, and Salesforce. The Motley Fool has positions in and recommends Adobe, Apple, Meta Platforms, and Salesforce. The Motley Fool recommends the following options: long January 2024 $420 calls on Adobe and short January 2024 $430 calls on Adobe. The Motley Fool has a disclosure policy.\nMeta Platforms Stock Rallied Nearly 200% Last Year -- Is It Too Late to Buy for 2024? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-29T09:17:39.000Z",
        "Title": "Should You Hold Meta Platforms (META) for the Long Term?",
        "Author": "  Soumya Eswaran ",
        "Text": "Rowan Street Capital, an investment management company, released its 2023 investor letter. A copy of the same can be downloaded here. The year 2023 proved to be a successful one for the fund as it recorded a net gain of +102.6%. In 2023, Meta Platforms (+194%), Spotify (+138%), Trade Desk (+60%), and Shopify (+124%) were the main contributors to the outperformance. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nRowan Street Capital featured stocks such as Meta Platforms, Inc. (NASDAQ:META) in its 2023 annual investor letter. Headquartered in Menlo Park, California, Meta Platforms, Inc. (NASDAQ:META) is a technology company that develops products to connect people. On January 26, 2024, Meta Platforms, Inc. (NASDAQ:META) stock closed at $394.14 per share. One-month return of Meta Platforms, Inc. (NASDAQ:META) was 11.35%, and its shares gained 168.01% of their value over the last 52 weeks. Meta Platforms, Inc. (NASDAQ:META) has a market capitalization of $1.013 trillion.\nRowan Street Capital stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its 2023 annual investor letter:\n\"Meta Platforms, Inc. (NASDAQ:META) has become our largest position in the fund, up +268% in just 14 months, aging very well from our November 2022 note. We gave a re-cap of this extraordinary move in our last letter in November and we encourage you to review. Our investment in Meta makes a great case to study. We first invested in the stock in 2018 and we just recently doubled our money on this investment in 2023. It took exactly 5 years and provided a very decent return of 15% per annum, however it hasn’t exactly been a smooth ride. Please take a look at the chart below:\nCopyright: rvlsoft / 123RF Stock Photo\nMeta Platforms, Inc. (NASDAQ:META) is in third position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 234 hedge fund portfolios held Meta Platforms, Inc. (NASDAQ:META) at the end of third quarter which was 225 in the previous quarter.\nWe discussed Meta Platforms, Inc. (NASDAQ:META) in another article and shared best tech stocks for the next 5 years. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\nSuggested Articles:\n30 Highest Paying Part-Time Jobs for 18 Year Olds\n25 States with Highest Average Salary in America\nTop 19 Industries That Are Hiring Right Now\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-02-02T00:47:32.000Z",
        "Title": "Mark Zuckerberg explained how Meta will crush Google and Microsoft at AI—and Meta warned it could cost more than $30 billion a year",
        "Author": "  Alexandra Sternlicht ",
        "Text": "Mark Zuckerberg laid out Meta's gameplan for \"playing to win\" against Alphabet and Microsoft in the high-stakes AI arms race. Meta's secret weapon: its walled garden of data.\n\"There are hundreds of billions of publicly shared images and tens of billions of public videos, which we estimate is greater than the common crawl data set,” Zuckerberg said on Meta’s earnings call on Thursday. It was a not-so-subtle jab at competitors Google, Microsoft and OpenAI, which are training their AI models on the public web data crawled by their search engines every day.\nBeyond the generative AI technology that Meta already offers in its battle against the other Big Tech powers (including Apple, which teased on its earnings call Thursday that it would launch a generative AI product later this year), Zuckerberg is aiming for “general intelligence,” the still unproven concept of a general purpose AI that can handle most tasks better than humans.\n“We’ll be building the most popular and advanced AI products and services. If we succeed, everyone who uses our services will have a world-class AI assistant to help get things done,” Zuckerberg said, even as his management team hinted at the hefty price tag of carrying out the project. Meta’s capital expenditures could increase by as much as $9 billion this year, totalling between $30 billion to $37 billion, compared to $28.1 billion in 2023.\nAnd the company suggested this could be the new normal, noting that “we expect our ambitious long-term AI research and product development efforts will require growing infrastructure investments beyond this year.”\nIt’s probably no coincidence that Meta announced its first ever cash dividend to investors on Thursday. The new, 50-cent quarterly dividend, along with strong results in Meta’s core advertising business, ignited Meta’s stock, which shot up 14.5% in after hours trading.\nZuckerberg initially unveiled his vision for artificial general intelligence last month in an Instagram Reels video. On Thursday, he expanded on the plan, describing it as not just a far-off science project, but an effort that will incorporate AGI into Meta products like Facebook, Instagram, and Whatsapp.\n“It's clear that we're going to need our models to be able to reason, plan code, remember, and many other cognitive abilities in order to provide the best versions of the services that we envision,” he said. “We’re playing to win here, and I expect us to continue investing aggressively in this area.”\nTo realize his vision of Meta as the AI leader, Zuckerberg has yet to expand on how exactly Meta user activity will be used as training data for Meta’s AI, and how the company will navigate the potential issues around user privacy.\nAnd it remains to be seen whether Zuckerberg’s confidence in the value of Meta’s training data compared to the vast corpus of web data used by Google is as big of an advantage as he believes. Google has the data treasure trove of YouTube, Google Office and its search engine. Still, Google AI is close-sourced so can only move as fast as engineering talent, whereas Zuckerberg pointed to his company’s open source Llama model as another key advantage.\nEarnings aside, this has been a big week for Meta’s head honcho. Yesterday Zuckerberg was skewered during a U.S. Senate hearing where he, most notably, stood up and apologized to families whose children died from harms inflicted by social media. (Though he did not agree to compensate the families for the harms they suffered at Senator Hawley’s request.)\nWhile the apology may have been wrenching for Zuckerberg, his net worth rose by $1.6 billion (per Forbes) on Thursday with Meta’s stock performance.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-01-25T12:00:25.000Z",
        "Title": "Meta Platforms (NASDAQ:META) Seems To Use Debt Rather Sparingly",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Howard Marks put it nicely when he said that, rather than worrying about share price volatility, 'The possibility of permanent loss is the risk I worry about... and every practical investor I know worries about.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. We note that Meta Platforms, Inc. (NASDAQ:META) does have debt on its balance sheet. But the more important question is: how much risk is that debt creating?\nGenerally speaking, debt only becomes a real problem when a company can't easily pay it off, either by raising capital or with its own cash flow. If things get really bad, the lenders can take control of the business. However, a more common (but still painful) scenario is that it has to raise new equity capital at a low price, thus permanently diluting shareholders. Of course, debt can be an important tool in businesses, particularly capital heavy businesses. The first thing to do when considering how much debt a business uses is to look at its cash and debt together.\n See our latest analysis for Meta Platforms \nYou can click the graphic below for the historical numbers, but it shows that as of September 2023 Meta Platforms had US$18.4b of debt, an increase on US$9.92b, over one year. However, its balance sheet shows it holds US$61.1b in cash, so it actually has US$42.7b net cash.\nAccording to the last reported balance sheet, Meta Platforms had liabilities of US$30.5b due within 12 months, and liabilities of US$42.9b due beyond 12 months. Offsetting this, it had US$61.1b in cash and US$12.9b in receivables that were due within 12 months. So its total liabilities are just about perfectly matched by its shorter-term, liquid assets.\nHaving regard to Meta Platforms' size, it seems that its liquid assets are well balanced with its total liabilities. So it's very unlikely that the US$989.9b company is short on cash, but still worth keeping an eye on the balance sheet. Simply put, the fact that Meta Platforms has more cash than debt is arguably a good indication that it can manage its debt safely.\nAlso positive, Meta Platforms grew its EBIT by 24% in the last year, and that should make it easier to pay down debt, going forward. The balance sheet is clearly the area to focus on when you are analysing debt. But it is future earnings, more than anything, that will determine Meta Platforms's ability to maintain a healthy balance sheet going forward. So if you're focused on the future you can check out this free report showing analyst profit forecasts.\nFinally, a business needs free cash flow to pay off debt; accounting profits just don't cut it. While Meta Platforms has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance. Over the most recent three years, Meta Platforms recorded free cash flow worth 79% of its EBIT, which is around normal, given free cash flow excludes interest and tax. This free cash flow puts the company in a good position to pay down debt, when appropriate.\nWhile it is always sensible to investigate a company's debt, in this case Meta Platforms has US$42.7b in net cash and a decent-looking balance sheet. And it impressed us with free cash flow of US$38b, being 79% of its EBIT. So we don't think Meta Platforms's use of debt is risky. There's no doubt that we learn most about debt from the balance sheet. But ultimately, every company can contain risks that exist outside of the balance sheet.   We've identified 1 warning sign  with Meta Platforms , and understanding them should be part of your investment process.\nWhen all is said and done, sometimes its easier to focus on companies that don't even need debt. Readers can access a list of growth stocks with zero net debt 100% free, right now.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    }
]