[
    {
        "Date": "2024-02-02T01:05:55.000Z",
        "Title": "Facebook parent Meta declares first dividend, shares soar",
        "Author": "  Katie Paul and Yuvraj Malik ",
        "Text": "By Katie Paul and Yuvraj Malik\n(Reuters) -Meta Platforms issued its first dividend days ahead of flagship social network Facebook's 20th anniversary, while reporting revenue and profit that beat expectations on robust ad sales in the holiday shopping period.\nShares soared more than 14% after the bell, pushing the company's stock market valuation up by more than $140 billion and extending a long recovery that saw Meta hit record highs in recent weeks for the first time in more than two years.\nThe after-hours gains alone amounted to more than quintuple the entire value of social media rival Snap Inc.\nMeta, one of the tech sector's original unicorns, said its dividend would be 50 cents per share. It also announced it had authorized an additional $50 billion in share repurchases.\nThe social media giant is the first of its generation of internet juggernauts to issue a dividend, a milestone for a tech sector that has been dominated by the same handful of companies for well over a decade.\nFounded in a college dorm room in 2004, it has grown into the world's biggest social media company, connecting more than 3 billion people and revolutionizing how they discover trends, communicate with their neighbors and engage with politics.\nThe company, which owns Instagram and WhatsApp, has also been accused of ignoring a multitude of harms on its path to growth, including violations of user privacy and incitements to violence.\nJust a day before announcing results, CEO Mark Zuckerberg was called to testify before the U.S. Senate about child safety online and compelled to apologize to parents of children who had experienced sexual abuses.\n\"You're never as good as they say when you're up, or as bad as they say when you're down. Just keep building and doing good work over long periods of time,\" he said on Thursday in a post on another Meta-owned app, Threads.\nIMPRESSIVE QUARTER\nShares of Meta have steadily been climbing back this past year from a meltdown in 2022 that wiped out more than three-quarters of their one-time value, buoyed by investor excitement about artificial intelligence.\nIts recovery has also been aided by a rebound in user growth and digital ad sales, as well as an austerity drive that saw it shed more than 21,000 employees since late 2022.\nRevenue for the fourth quarter rose 25% to $40.1 billion, above the $39.2 billion analysts were expecting, according to LSEG data.\nNet income rose more than 200% to $14 billion, or $5.33 per share, exceeding expectations of $4.97 per share, according to LSEG data.\n\"This was one of the most impressive quarters – intrinsically and vs. expectations,\" said Evercore ISI analyst Mark Mahaney.\nMeta forecast first quarter revenue of $34.5 billion to $37 billion, above Wall Street expectations of $33.8 billion. It said it expects full-year 2024 total expenses to be unchanged at $94 billion to $99 billion.\nThose results came after fellow digital ads heavyweight Alphabet posted holiday season advertising sales that came in below expectations.\nMORE METAVERSE, AI INVESTMENTS\nImprovements to the social media business have made investors more tolerant of Meta's undiminished spending, as it pours billions of dollars into \"metaverse\" technologies and building out its artificial intelligence infrastructure.\nOn Thursday executives doubled down on aggressive investments in both areas.\nThe company's metaversee-oriented Reality Labs unit handily beat revenue expectations for the fourth quarter, posting record sales of $1.1 billion from \"strong sales\" of its Quest device over the holiday season, Zuckerberg told analysts after the report. Investors had been expecting $804 million, according to LSEG data.\nMeta said it still expected operating losses for Reality Labs to \"increase meaningfully\" as it invests more in augmented and virtual reality in 2024.\nWhile interactive and immersive experiences via those technologies remain the ultimate goal, Zuckerberg said the latest version of its Ray-Ban smart glasses, with a built-in AI assistant, has been an early surprise hit with consumers too.\n\"We thought we would have to build full displays and holograms\" before the smart glasses would become mainstream, he said. \"And now it's quite possible that ... AI assistants built in will be the killer app.\"\nStill, though improving, Reality Labs sales remain a tiny 2.7% slice of the company's total revenue.\n\"Meta ended 2023 on an extremely strong note, with revenue soaring above analyst expectations,\" said Debra Aho Williamson, an independent tech analyst and former principal analyst at eMarketer.\n\"The company can talk all it wants to about AI and the metaverse, but it's still a social media company that gets nearly all its revenue from advertising, and advertisers still clearly love Meta.\"\n(Reporting by Katie Paul in New York and Yuvraj Malik in Bengaluru; Additional reporting by Sheila Dang in Austin and Noel Randewich in San Francisco; Editing by Kenneth Li and Stephen Coates)\n"
    },
    {
        "Date": "2024-02-07T15:45:00.000Z",
        "Title": "Artificial Intelligence (AI) May Be Center Stage for Meta. But Here Are 2 Other Reasons the Stock Should Be on Your Radar.",
        "Author": "  Adam Spatacco, The Motley Fool ",
        "Text": "As earnings season kicks into gear, all eyes are on big tech. Why? Well, the \"Magnificent Seven\" stocks all played an important role in the Nasdaq Composite's 43% surge last year, and momentum has gotten stronger in 2024, which has helped the S&P 500 soar to new highs.\nFollowing its fourth-quarter earnings report on Feb. 1, Meta Platforms (NASDAQ: META) rocketed by more than 20% and re-entered the exclusive club of trillion-dollar companies.\nWhile progress in artificial intelligence (AI) applications is front and center for investors, Meta's management was sure to tame expectations amid the enthusiasm. Nevertheless, investors are cheering on the stock.\nLet's dig into two important developments outside of AI that may be influencing the recent price action.\nIn 2022, Meta had its eyes on a new growth driver called the metaverse. The company invested heavily in applications such as augmented and virtual reality, and bolstered its headcount significantly. Unfortunately, investors quickly soared on this strategy due to the toll these investments were taking on Meta's overall revenue and profits. The company's core advertising business stalled while expenses mounted, resulting in deteriorating cash flow. Unsurprisingly, Meta stock cratered by more than 60% in 2022.\nToward the end of 2022, a prominent venture capitalist (VC) named Brad Gerstner penned an open letter to Meta's executive leadership and board of directors. Gerstner urged the company \"get fit\" and return to its roots. Last year, Meta employed a series of layoffs to right-size its cost structure and turned its focus back to the advertising business.\nFor the full year 2023, Meta grew its revenue by 16% year over year and expanded its operating margins by 10 percentage points. The combination of accelerated revenue growth and margin expansion helped fuel growth in free cash flow by nearly 140% year over year.\nWith $65.4 billion in cash and marketable securities on its balance sheet, Meta appears to be deploying this capital to reward shareholders in two ways.\nFirst, the company repurchased $20 billion of stock in 2023. Moreover, as of Dec. 31, Meta had roughly $31 billion available and authorized by the board for share repurchases. In addition, the company announced an increase of $50 billion to its share repurchase authorization during the earnings call.\nGiven where Meta stock began trading in 2023, coupled with the company's attractive valuation, it's not entirely surprising to see a buyback. However, the announcement of the $50 billion increase was encouraging to see as Meta appears to be well-positioned for the next phase of long-term growth fueled by artificial intelligence (AI).\nAlthough the share repurchase news was nice to see, it appears that Meta has found additional ways to deploy its excess profits. Perhaps more surprising was the announcement of the company's first dividend. Per the earnings release, Meta will pay a quarterly dividend of $0.50 per share.\nThe company's CFO, Susan Li, commented on the development, saying that \"introducing a dividend really just serves as a nice complement to the existing share repurchase program.\"\nI see this as an important step for Meta as it matures. Generally speaking, growth companies typically do not pay dividends, as any excess cash that is generated tends to be reinvested in additional research and development (R&D) or marketing efforts. Meta is only the fourth Magnificent Seven stock to pay a dividend -- joining Microsoft, Apple, and Nvidia.\nWhen it comes to tech stocks, a lot of investors seem to be enamored of the prospects of artificial intelligence (AI), and rightfully so. The proliferation of generative AI can't be understated. However, prudent investors should realize that use cases for the technology are still very much in discovery territory, and the long-term gains for AI could be years away.\nIn the meantime, Meta has found other creative sources to rally investor enthusiasm. With accelerating revenue, margins, and cash flow, Meta is showing some true signs of a healthy, maturing business. Moreover, its forward price-to-earnings (P/E) multiple of roughly 23 is nearly identical to that of the S&P 500. This could signal that investors do not think Meta's growth prospects are more attractive than the broader market's.\nI see Meta as an attractive opportunity at its current valuation, and think using dollar-cost averaging to scoop up some shares could be a wise decision in the long-run. The combination of share repurchases and a dividend certainly make the company stand out among its cohort, and the stock looks tempting for AI investors in particular.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy.\nArtificial Intelligence (AI) May Be Center Stage for Meta. But Here Are 2 Other Reasons the Stock Should Be on Your Radar. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-08T07:55:43.000Z",
        "Title": "META, AMZN, MSFT: Which Stock Is Best after Their Magnificent Earnings?",
        "Author": "  TipRanks ",
        "Text": "The so-called Magnificent Seven have pulled the curtain on their earnings results. Though most Magnificent Seven members clocked in some magnificent quarters, there was one EV maker that delivered results that can only be described as less-than-magnificent. In any case, this piece will focus on a trio of Magnificent Seven members (META, AMZN, and MSFT) that stepped up to the plate and swung one out of the ballpark, sparking an impressive rally alongside a wave of analyst price target upgrades.\nTherefore, let’s use TipRanks’ Comparison Tool to check in with the three aforementioned stocks that delivered and could continue to do so in the year ahead, thanks in part to a bit of help from their growing stake in artificial intelligence (AI).\nMeta Platforms delivered the most impressive quarterly results this earnings season, sparking one of the biggest single-day rallies in the company’s history. Undoubtedly, Meta stock’s more than 20% surge represented the largest-ever single-day market cap gain of $204.5 billion. Put that one in the record books.\nWith a fresh dividend, AI tailwinds at its back, and the wildcard of its Reality Labs business, many analysts on Wall Street see the red-hot stock climbing even higher as it enters its dividend-paying era. All things considered, I find it hard to be any less bullish following the latest spike.\nIn fact, Morgan Stanley seems to think Meta is a stock to keep buying after its blowout earnings results. The company’s new AI tools are just one of the drivers that has the bank staying bullish. In a prior piece, I highlighted the potential of ad automation tool Advantage+ and its ability to give the ad business a real shot in the arm.\nJust because Meta is maturing, with a dividend to pay (0.44% yield at writing), does not mean it’s steering off the growth track. If anything, Meta may be the most exciting Magnificent Seven member, given how effectively Mark Zuckerberg and his team have turned a corner following its “Year of Efficiency.”\nAs the company moves into a year (or should I say decade) of AI, the stock certainly seems too cheap at 23.7 times forward price-to-earnings, far below most Magnificent Seven members. The lowest-hanging fruit may have been picked amid last year’s efficiency push, but don’t expect management to settle into cruise mode as it looks to pull ahead in the so-called AI race while keeping up with peers in the virtual- and augmented-reality scene.\nMeta stock is a Strong Buy, according to analysts, with 38 Buys, two Holds, and one Sell assigned in the past three months. The average META stock price target of $522.00 implies 11.2% upside potential.\nAmazon stock has also been riding higher following its own slate of quarterly earnings results. The numbers were exceptional, helping power shares more than 7% higher in a single trading session. With new all-time highs in sight (around 8% away), plenty of AI rally fuel, and a strong holiday season in the books, analysts seem right on the money to stay bullish on the stock post-earnings.\nLike Meta, Amazon wants to equip advertisers with the right tools. With the firm launching new privacy tools in the European market while starting ads (and a paid option to eliminate them) on its streaming service Prime Video, it seems positioned to make a growing dent in the ad market.\nIndeed, Amazon’s many Prime users will not be happy to have to view ads as they enjoy their paid Prime content. And though some may question the value proposition of being a Prime member (have the perks added up, or only the price hikes?), the consumer will speak with their money. For now, Prime looks sticky enough to not shed too many users due to the inclusion of ads on Prime Video.\nCombine AI tools with ads, and it’s no mystery as to why RBC Capital views Amazon as one of its top tech picks (one of the others is Meta) to play the digital ad market in the new year. I think they’re right to praise the company as it looks to go above and beyond just being an e-commerce and cloud retailer.\nAmazon stock is a Strong Buy, according to analysts, with unanimous 40 Buys assigned in the past three months. The average AMZN stock price target of $207.72 implies 21.8% upside potential.\nMicrosoft also stood tall following its earnings report, with investors impressed by the company’s AI muscles. In many ways, Microsoft is still the AI stock to own for those who prefer to bet on software over hardware. While Microsoft is poised to gain some skin in the AI chip game, the company still remains a software titan that’s likely to continue having its way with rivals.\nWith a Super Bowl ad for its AI software CoPilot ready to go, it will be interesting to see where adoption of the Microsoft ecosystem goes from here as more are drawn in by its impressive AI capabilities. It’s hard not to be bullish, even with shares at fresh highs and a trailing price-to-earnings multiple now well above 35 times.\nApart from AI, Microsoft seems to be opening up its Xbox gaming ecosystem by sharing plans to bring its Xbox-exclusive games over to its rival console, PlayStation. Indeed, such a move could curb demand for its console while also dealing a heavy blow to the so-called “console wars.”\nThat said, by expanding the total addressable market for its games, I view the move as a net positive, even if it rubs some Xbox gamers the wrong way. If the friendly gesture is reciprocated by Sony (the firm behind PlayStation), the move could be a net positive for both console combatants as more emphasis is placed on growth in software.\nMicrosoft stock is a Strong Buy, according to analysts, with 32 Buys, one Hold, and one Sell assigned in the past three months. The average MSFT stock price target of $469.45 implies 13.4% upside potential.\nThe Magnificent Seven stocks could continue higher if they continue smashing quarterly earnings this year. Undoubtedly, AI could be the magic that helps them keep pulling rabbits out of hats come future earnings seasons. Of the trio, analysts see the most upside (21.8%) in AMZN stock.\nDisclosure\n"
    },
    {
        "Date": "2024-02-06T11:00:00.000Z",
        "Title": "Meta Platforms Profited Nearly $63 Billion From Its Apps in 2023, But You'll Never Believe How Much Money It Lost Trying to Develop the Future of the Company",
        "Author": "  Jon Quast, The Motley Fool ",
        "Text": "On Feb. 1, Meta Platforms (NASDAQ: META) reported its biggest and most profitable quarter in history. Its \"family of apps\" includes Facebook, Instagram, and WhatsApp. And this trio absolutely delivered for shareholders in the fourth quarter of 2023.\nIn Q4, Meta's revenue grew 25% year over year. This was its best growth rate in over a year, boosting its full-year revenue to a whopping $135 billion.\nMeta Platforms' Facebook enjoyed user growth from around the world in Q4, finishing with 2.1 billion daily active users. Management was upbeat about the results for Instagram and WhatsApp as well. These apps primarily make money through advertising. And in Q4, ad impressions (the number of times an ad was displayed) were up a strong 21% year over year.\nMeta Platforms is clearly a business that revolves around advertising on its various social platforms. And this division of the business is extremely profitable, generating operating income of nearly $63 billion in 2023.\nHowever, Meta Platforms is betting the future of the company on something else entirely. And in 2023, this other division had an operating loss of more than $16 billion, worsening from its prior-year operating loss of almost $14 billion.\nWhen it comes to Meta's long-term vision, co-founder and CEO Mark Zuckerberg doesn't intend to sit back and just let the advertising profits pour in. In the Q4 earnings call, Zuckerberg addressed the long-term vision by saying, \"We have two major parts of our long-term vision, and in addition to AI the other part is the metaverse.\"\nThe metaverse is a fuzzy concept. But think of it as a digital world people experience through immersive hardware devices, such as virtual reality (VR) headsets. Inside the digital world, users can interact socially, have experiences, conduct commerce, and more.\nZuckerberg is all-in on the future of the metaverse, as evidenced by his decision to rebrand the entire company to Meta Platforms in 2021. It's also evidenced by how much money the company is investing in its Reality Labs business segment -- the part that involves its Metaverse vision.\nIn 2023, Meta's Reality Labs generated $1.9 billion in revenue (mostly hardware sales for its Quest headset device). But this segment racked up a $16.1 billion loss for the year.\nHere's another stat that may shock investors: From 2019 through 2023 (five full years of results), Meta Platforms generated just $8 billion in revenue from Reality Labs. However, its operating loss from Reality Labs over this period is over $51 billion.\nTo put that number into perspective, consider that the S&P 500 is an index comprised of the largest, most profitable U.S. companies. Occidental Petroleum is currently the 165th-largest company in the index. Meta Platforms could have paid cash for this oil company with its metaverse losses alone.\nWith a market capitalization of nearly $1.2 trillion as of this writing, $51 billion over five years isn't that big of a number for Meta Platforms, as strange as that might sound. Granted, ongoing losses for that division and lackluster growth (it generated more metaverse revenue in 2021 than in 2023) aren't ideal. But relative to the size of the overall business, Meta can afford this gamble.\nThe problem with being a trillion-dollar company is that it will be hard for Meta Platforms to find market-beating growth. Simply put, it needs ginormous ideas, and the metaverse is a big enough possibility that it may be worth pursuing. Many third-party research reports project that the metaverse will be worth hundreds of billions of dollars by 2030.\nMoreover, the technology for making the metaverse possible is improving all the time. Besides Meta's Quest headsets, Apple just launched its Vision Pro, which is being celebrated by the media -- award-winning filmmaker James Cameron praised the Vision Pro to the point of calling it a \"religious\" experience.\nEven Disney is getting in on the action by unveiling its HoloTile device -- a floor mat that allows VR users to walk around the digital space while staying in one place in the physical space.\nThe point is that metaverse technology is clearly improving. Meta Platforms' investments haven't paid off yet. But perhaps traction will come as the user experience improves.\nEven if it doesn't pay off, I'm not sure investors should be too hard on Meta Platforms here. Given the strength of its core business, it can afford to make a big long-term bet on the future. But one thing's for sure: If it's going to enjoy long-term market-beating growth from here, it needs a big bet to pay off.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jon Quast has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Meta Platforms, and Walt Disney. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nMeta Platforms Profited Nearly $63 Billion From Its Apps in 2023, But You'll Never Believe How Much Money It Lost Trying to Develop the Future of the Company was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-27T14:50:12.000Z",
        "Title": "Why Meta Platforms (META) is a Top Momentum Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "It doesn't matter your age or experience: taking full advantage of the stock market and investing with confidence are common goals for all investors.\nMany investors also have a go-to methodology that helps guide their buy and sell decisions. One way to find winning stocks based on your preferred way of investing is to use the Zacks Style Scores, which are indicators that rate stocks based on three widely-followed investing types: value, growth, and momentum.\nIs This 1 Momentum Stock a Screaming Buy Right Now?\nMomentum investors, who live by the saying \"the trend is your friend,\" are most interested in taking advantage of upward or downward trends in a stock's price or earnings outlook. Utilizing one-week price change and the monthly percentage change in earnings estimates, among other factors, the Momentum Style Score can help determine favorable times to buy high-momentum stocks.\nMeta Platforms (META)\nMeta Platforms is the world’s largest social media platform. The company’s portfolio offering evolved from a single Facebook app to multiple apps like photo and video sharing app Instagram and WhatsApp messaging app owing to acquisitions. Along with in-house developed Messenger, these apps now form Meta’s family of products used by almost 3.96 billion people on a monthly basis as of Sep 30, 2023.\nMETA sits at a Zacks Rank #1 (Strong Buy), holds a Momentum Style Score of A, and has a VGM Score of B. The stock is up 1.8% and up 20.1% over the past one-week and four-week period, respectively, and Meta Platforms has gained 184.2% in the last one-year period as well. Additionally, an average of 23,190,004 shares were traded over the last 20 trading sessions.\nMomentum investors don't just pay attention to price changes; positive earnings play a crucial role, too. 15 analysts revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $2.39 to $19.94 per share. META boasts an average earnings surprise of 19.7%.\nWith strong earnings growth, a good Zacks Rank, and top-tier Momentum and VGM Style Scores, investors should think about adding META to their portfolios.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]