[
    {
        "Date": "2024-03-05T13:00:01.000Z",
        "Title": "Meta's Growth Story Continues",
        "Author": "  Yiannis Zourmpanos ",
        "Text": "Shares of Meta Platforms Inc. (NASDAQ:META) skyrocketed last year, driven by the artificial intelligence rally.\nIn 2023, Mark Zuckerberg pledged for a\"year of efficiency,\" meaning the social media company would invest most of its dedicatory work into improving its products with an AI touch, cutting down costs with new initiatives to enhance user engagement.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nThis would then solidify its operational foundations to see Meta register a solid financial performance in the fourth quarter and for all of 2023.\nDuring the earnings call, Zuckerberg noted Meta's applications enjoy global use by at least one out of every 3.1 billion people.\nFinally, on the current route and strategic stakes, the company stands some chance to beat the Wall Street community's average target price of around $491.55 in the coming months; it has a promising outlook for growth in market value.\nMeta carries out activities within two business segments. The first one is the Family of Apps, which encompasses all its social media platforms, including Facebook, Instagram, WhatsApp and others.\nIts offerings in augmented and virtual reality are part of the other segment, Reality Labs.\nEven though the Family of Apps contributes the highest revenues and profits, Reality Labs has been declining sharply over the past few quarters. Surprisingly, the fourth quarter finished in favor of the segment and brought in $1.07 billion in revenue, reporting an increase of 47.1% year over year on the back of higher sales of Quest 3, with expenses rising 14% to $5.7 billion due to research and developments and headcount costs, resulting in a $4.6 billion operating loss.\nThe good news is the Family of Apps has again compensated for Reality Labs; underperformance, building $39 billion in revenue and an operating profit of $21 billion. While the Family of Apps saves the day for Meta, accounting for about 99% of its total revenue, Reality Labs remains to be explored. The metaverse market is in its fledgling stages.\nSource: Statista\nBy 2030, the global metaverse is expected to surpass $1.3 trillion, growing at a compounded annual rate amounting to 44.50% between 2022 and 2030.\nMeta believes that AI-powered technologies will enable the next generation of AR, MR and VR to be much more powerful, opening up the scope for exciting innovations in Reality Labs.\nAs Meta develops its products, operating expenses will rise between $94 billion and $99 billion in 2024. The company did not provide specific figures, but it noted that Reality Labs' loss from operations would go through the roof for the year based on the forecast of operating expenses.\nIn 2014, Meta purchased WhatsApp, the world's most popular messaging app, for $19 billion. Meta has since introduced the WhatsApp Business API that allows merchants to pay for certain application services. As of July 2023, WhatsApp Business reached over 200 million monthly active users worldwide. Revenue from the Family of Apps surged to $334 million in the quarter, marking an 82% increase, propelled by the robust growth in business messaging via the WhatsApp Business platform.\nThe company had announced in its previous quarterly results the launch of Meta Verified for businesses on Facebook and Instagram in a few countries, aiming to bring it to WhatsApp shortly after. Meta is also making good progress with the WhatsApp Channels product, which has now more than 500 million monthly active users since its debut in September 2023.Additionally, Meta does have several other ways to profit from WhatsApp if it ultimately decides to monetize it, such as advertising or business-focused subscription plans and from functional mergers with other platforms.\nWhatsApp currently stands at 2.78 billion active monthly users from 180 countries, and it is expected that the number will hit 3.14 billion by 2025. Meta has not taken an official stance on this either, and its vast monetization possibility is still in progress.\nSource: Oberlo\nAt the Connect conference last year, Meta presented its generative AI products: Meta AI, an advanced conversational assistant based on Llama 2, its large language model that will be integrated with Instagram, WhatsApp and Messenger.\nThe technology has already been integrated into the company's mixed reality headset, Quest 3, and its Ray-Ban Meta smart glasses, which launched in October. Both had a solid start.\nWhile Quest 2 weighed on Reality Labs' segment performance in 2023, the AI-powered Meta Quest 3 has the potential to give a big boost. In respect of the fourth-quarter results, both products delivered well.\nAI is capable of actually enhancing Meta's advertising platforms. Dependent on different types of advertising, the company's revenue from Family of Apps advertising reached $38.7 billion in the fourth quarter, which was 24% higher. With the digital ad market recovering in 2024, Meta's advertising revenue might soar further.\nMoreover, Meta expects to be very aggressive this year in its AI, non-AI hardware and Reality Labs investments, likely making capital expenditures between $30 billion and $37 billion.\nDespite the increasing expenses, management forecasts first-quarter 2024 revenue in the$34.5 billion to $37 billion range, implying a 20% to 29% increase over the prior-year quarter. The consensus for first-quarter revenue stands at $35.97 billion, which aligns with the company's forecast.\nMeta's balance sheet shows that it ended the fourth quarter with $65.4 billion in cash and marketable securities, comprising $18.4 billion in long-term debt.\nNot surprisingly, in the last quarter, it also generated strong free cash flow of $11.50 billion. A healthy free cash flow balance allows the company to pay off its debt, fund future growth projects, pay dividends and undertake similar activities. Thus, the free cash flow balance also ascertains a better understanding of the company's financial health.\nThis free cash flow enabled Meta to start paying dividends to its shareholders. The company announced a dividend payment of 50 cents per share for the quarter, payable quarterly. In fact, surplus cash will also enable Meta to finance AI projects quite soon as it has predicted 2024 to be a year of heavy investment in the segment.\nWall Street expects Meta's revenue and earnings for 2024 to spike by 17.3% and 34.5%, respectively. Trading at 32 times its price-earnings compared to its historical average of 33 suggests the tech giant might be fairly priced. However, with the boost in earnings from AI and in light of 2024 U.S. elections with elevated advertising revenue, the company deserves a higher multiple, closer to 35, implying a target price of $520 in the short term.However, the reasonable valuation is contingent upon the premise that Wall Street still continues to overlook Meta's generative AI capabilities, apart from its monetization potential for WhatsApp and Threads and yet other unexplored growth prospects at Reality Labs.\nThe incredible full-year results and a strong forecast for 2024 have boosted Meta's market cap over $1.2 trillion. Lastly, as Meta Platforms sails toward the future, the integration of AI could pave the way for a smoother ride, making the stock a compelling growth at a reasonable price play, with additional upside potential from current levels.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-02T16:30:00.000Z",
        "Title": "Will Meta Platforms Be Worth More Than Apple by 2030?",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Meta Platforms' (NASDAQ: META) stock has rallied by about 180% over the past 12 months and now trades just a few dollars shy of its all-time high. Investors rushed back to the social media giant as its advertising business recovered, and as management expanded its share buyback authorization by $50 billion and initiated a dividend.\nThat rally lifted Meta's market cap past the trillion-dollar mark for the first time in two years this January, and it's now worth $1.2 trillion. However, Meta is still less valuable than Apple (NASDAQ: AAPL), which has throttled the company's ad sales over the past three years by improving the user-privacy aspects of the iOS mobile operating system.\nBut now that Meta's business is firing on all cylinders again, could it overtake Apple -- which currently has a market cap of $2.8 trillion -- by 2030?\nMeta's growth stalled out in 2022 as it struggled with fierce competition from ByteDance's TikTok, macro headwinds for the advertising market, and the impact of Apple's user-privacy upgrades. Its Reality Labs unit, which houses its metaverse efforts and its virtual and augmented reality devices, also continued to lose billions of dollars every quarter. During that challenging year, Meta's revenue and earnings per share (EPS) declined by 1% and 38%, respectively.\nBut in 2023, Meta's revenue and EPS rose 16% and 73%, respectively, as its advertising business recovered. It countered Apple's iOS changes by gathering more first-party data with its own AI algorithms, challenged TikTok by expanding its Reels short video platform on Facebook and Instagram, and offset its declining ad prices by selling more ad impressions. It also attracted a lot of new ad purchases from Chinese e-commerce and gaming companies, which were trying to reach more overseas customers; China-based advertisers drove 5 percentage points of its total revenue growth during the year.\nFrom 2023 to 2026, analysts expect Meta's revenue and earnings to grow at a compound annual rate of 14% and 22%, respectively. Its stock still looks reasonably valued relative to those estimates at 24 times forward earnings.\nIf Meta matches those estimates and continues to grow its bottom line at a compound annual rate of 15% from 2026 to 2030, its EPS could rise to $46.70. If its forward multiple remains roughly the same, in early 2030, its stock could be trading at about $1,120, giving it a market cap of nearly $2.8 trillion. That would match Apple's current valuation.\nApple also suffered a slowdown over the past three years. In its fiscal 2022 (which ended Sept. 24, 2022), its revenue and EPS only rose 8% and 9%, respectively, as it lapped a period of robust sales of its first 5G handset, the iPhone 12. In fiscal 2023, Apple's revenue fell 3% and its earnings stayed nearly flat as the 5G upgrade cycle ended and its sales of Macs withered in a post-pandemic market. China's economic slowdown and tough currency headwinds exacerbated that pressure.\nFrom fiscal 2023 to fiscal 2026, analysts expect Apple's revenue and earnings to grow at a compound annual rate of 4% and 8%, respectively. Those growth rates look stable, but they're not that impressive for a stock that trades at 28 times forward earnings.\nApple still trades at a premium to its growth because it's widely considered a safe-haven stock. The company can still diversify its portfolio away from the iPhone over the next few years with fresh products and subscription services, and it could expand through acquisitions and investments by tapping its $173 billion in cash and marketable securities. However, its price-to-earnings ratio could gradually contract if it doesn't reaccelerate its growth.\nIf Apple meets analysts' expectations and grows its EPS at a modest compound annual rate of 8% from fiscal 2026 to fiscal 2030, its EPS could reach $10.50. If its valuation remained at 28 times forward earnings at that point, its stock would be trading at $294, giving it a market cap of $4.5 trillion. But if Apple's forward multiple dropped to 20 -- in line with other mature tech companies -- its stock price of $210 per share would give it a market cap of $3.2 trillion.\nBased on those calculations and forecasts, Meta probably won't be worth more than Apple by 2030, but it could have a lot more upside potential than the iPhone maker. For Meta to reach Apple's current market cap by 2030, its stock would have to more than double from its current levels.\nMeanwhile, Apple could struggle to match those gains if it continues to generate single-digit percentage earnings growth while trading at premium valuations. That outlook might change if the Vision Pro takes off or if Apple launches other revolutionary products or services -- but it will take a lot of work to diversify the business away from its dependence on the iPhone.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Apple and Meta Platforms. The Motley Fool has a disclosure policy.\nWill Meta Platforms Be Worth More Than Apple by 2030? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-23T11:05:00.000Z",
        "Title": "Meta Platforms Is Up 40% This Year. Here's Why It's Still a Fantastic Buy",
        "Author": "  Keithen Drury, The Motley Fool ",
        "Text": "The average return of the S&P 500 over the long term is about 10% per year. So, many times, when a stock returns 40% or more within a year, investors will immediately throw up their red flags. Some will sell, and others refuse to buy, but looking solely at the stock's return is a terrible way to judge whether it's a buy.\nIf you do that, you'll miss out on many of the market's biggest winners: Nvidia and Super Micro Computer have had an amazing run since the start of 2023; yet, if you sold when you were up 40%, you missed out on massive, portfolio-changing returns.\nMeta Platforms (NASDAQ: META) is in this boat as well. The stock is up 40% in 2024 and over 300% since the start of 2023. But despite that success, I think it still has room for more.\nMeta Platforms is likely better known by its old name: Facebook. Its primary business is advertising, which is done through its Family of Apps: Facebook, Instagram, WhatsApp, Messenger, and Threads. In 2022, the stock was beaten down because it was burning cash by heavily investing in its Reality Labs division, which focuses on next-generation technologies, such as augmented reality (AR), virtual reality, and the metaverse.\nBack then, these were mostly luxury gaming technologies that didn't really serve a purpose. But with artificial intelligence (AI) proliferation, CEO Mark Zuckerberg's vision is becoming a bit clearer.\nMeta is working on a game-changing AI called Ego, which will eventually integrate into AR glasses. This could be used for tasks like teaching people how to cook or communicating with those who don't speak the same language as us.\nIf this endeavor succeeds, Meta's stock could become an absolute rocket ship and easily add billions in sales.\nHowever, as this moonshot division develops products, the advertising business is holding steady. In the fourth quarter, Meta posted record ad sales, with $38.7 billion in revenue (up 24% year over year). With Meta converting 54% of that revenue into operating profits, it is an incredible cash-generation machine. The Reality Labs division burned $4.6 billion of those profits in pursuit of its goals, but that still leaves an incredible $16.4 billion (a 41% operating margin) left over for investors.\nThese profits are added to Meta's ever-growing cash stockpile, which sits at around $65.4 billion as of the end of Q4. With only $18.4 billion in long-term debt on the balance sheet, it has plenty of cash on the sidelines to do whatever it wants.\nSo, Meta decided to pay a dividend. If you held shares on Feb. 22, you're entitled to a $0.50 per share dividend that will be paid on March 26. That works out to a 0.4% dividend yield, which isn't a lot. But all great dividend companies have to start somewhere, and some dividends are better than none.\nAll these facts look at Meta's previous results, which are fantastic. But why is the stock a buy right now?\nIf we look at Meta's forward price-to-earnings (P/E) ratio, it trades around 25 times forward earnings. While that's not terribly cheap, it isn't a bad price for a company on the cutting edge of AI technologies and growing revenue at a 25% pace.\nAdditionally, when compared to other big-tech stocks, like Apple and Microsoft, that aren't growing fast and trade at a higher premium, Meta's stock looks fairly priced.\nMeta is a huge player in AI and is succeeding with its social media products. Meta's growth is just getting started, and investors would be unwise to sell now. In fact, I think they can confidently buy the stock now with the expectation of it being much higher three to five years down the road.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 21, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Meta Platforms. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nMeta Platforms Is Up 40% This Year. Here's Why It's Still a Fantastic Buy was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-13T13:15:00.000Z",
        "Title": "Better Growth Stock: Meta Platforms vs. Pinterest",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) and Pinterest (NYSE: PINS) can be considered the David and Goliath, respectively, of the social media market. Meta served 3.98 billion people across Facebook, Messenger, Instagram, and WhatsApp monthly at the end of 2023. Pinterest served 498 million monthly active users (MAUs) at the end of the year.\nMeta's social networks enable people to stay in touch with their friends, family, and co-workers, or to follow brands and public figures. Meta also sells virtual and augmented reality devices, and it launched an \"X-like\" platform called Threads last year. Pinterest's virtual pinboards are mainly used to share interests, hobbies, and ideas with other users, and its visual format makes it a natural fit for e-commerce sales.\nOver the past 12 months, Meta's stock soared nearly 180% as Pinterest's stock rose 40%. Let's see why Meta outperformed Pinterest, and if it's still the better buy.\nMeta's revenue and earnings per share (EPS) declined 2% and 38%, respectively, in 2022. That slowdown was caused by Apple's privacy changes on iOS, which disrupted its ability to harvest data from third-party apps; stiff competition from ByteDance's TikTok; and the macro headwinds for the advertising sector.\nAs Meta's ad sales slowed down, it continued to burn billions of dollars each quarter on its unprofitable Reality Labs segment, which develops its augmented reality and virtual reality products.\nThat combination of slowing growth and rising expenses rattled the bulls. But in 2023, its revenue and EPS rose 16% and 73%, respectively, as it overcame those challenges. Meta dealt with Apple's changes by mining more first-party data with its AI algorithms, countered TikTok with the expansion of Reels, and attracted a lot of ad dollars from Chinese gaming and e-commerce companies as they targeted overseas customers.\nIt also offset its declining ad prices with more ad impressions. As its advertising business recovered, it continued to expand its Reality Labs division -- but it still had enough cash to initiate its first dividend at the end of 2023 and boost its buyback plan by $50 billion.\nAnalysts expect Meta's revenue and EPS to rise 17% and 34%, respectively, in 2025. Its stock is hovering near its all-time high, but it still looks reasonably valued at 25 times forward earnings, and it pays a token forward dividend yield of 0.4%.\nPinterest's revenue only increased 9% in 2022 as it turned unprofitable on a generally accepted accounting principles (GAAP) basis. That represented a significant slowdown from its 52% growth in 2021 and 48% growth in 2020.\nDuring the pandemic, many people flocked to Pinterest to find ideas for recipes, home improvement projects, family activities, and online shopping ideas. But many of those users left after the pandemic passed, and the macro headwinds for the advertising market exacerbated that slowdown. That deceleration drove the bears to declare that Pinterest was a fad stock.\nIn 2023, Pinterest's revenue rose just 9% again and it remained unprofitable. However, it returned to GAAP profitability in the second half of 2023, while its MAUs increased 11% to 498 million for the full year and accelerated from its 4% MAU growth in 2022. That stabilization was driven by an influx of Gen Z users, which reduced its dependence on older users; its overseas expansion; fresh video content; and AI-driven recommendations. More merchants also launched \"shoppable pins\" that turned Pinterest's pinboards into a decentralized e-commerce marketplace.\nAnalysts expect Pinterest's revenue and adjusted EPS to rise 18% and 24%, respectively, in 2024 as its business stabilizes and the macro environment improves. At 28 times forward earnings, it's a bit pricier than Meta and doesn't pay a dividend, but it might remain a good long-term play on the \"social shopping\" market.\nPinterest's business is recovering, but Meta is clearly the better pick right now because it's more broadly diversified, more profitable, and trades at more attractive valuations than Pinterest. Meta is also growing at a similar rate as Pinterest even though it serves eight times as many monthly active users worldwide, so the social media underdog might need to grow a lot faster than the market leader to attract the attention of growth-oriented investors.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Apple, Meta Platforms, and Pinterest. The Motley Fool has a disclosure policy.\nBetter Growth Stock: Meta Platforms vs. Pinterest was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-14T13:00:00.000Z",
        "Title": "W4 Games and Meta Team Up to Expand Open-Source Godot Ecosystem on Meta Quest",
        "Author": "Business Wire ",
        "Text": "Thanks to Meta and W4’s partnership supporting the Godot engine, developers will be able to build and ship VR And MR apps for the Meta Quest platform with all the power of Godot by July 2024.\nDUBLIN & SAN FRANCISCO, March 14, 2024--(BUSINESS WIRE)--W4 Games, on a mission to help the video game industry reclaim control by strengthening the open-source Godot ecosystem, today announced that it is collaborating with Meta to significantly improve the game developer experience with Godot on the Meta Quest Platform. By empowering developers who choose the Godot engine to create and publish extended reality (XR) games, the companies will expand the Godot games portfolio on Meta Quest and the open-source game development ecosystem.\n\"We’re really excited to announce this new partnership with Meta since we believe it will provide great new opportunities for Godot game developers and allow them to reach out to new audiences through the Meta Quest Platform. The future of the gaming experience will be highly impacted by new XR technologies and we are confident that this strategic collaboration will augment Godot’s growth path,\" said Nicola Farronato, Co-CEO of W4 Games.\nMeta Quest is one of the most compelling platforms to provide virtual and mixed-reality experiences and entertainment, and it is fueled by games, applications, and interactive content. The Godot Engine is a free and open-source technology for 2D and 3D game creation that became popular among indies for its ease of use, very fast learning curve, and permissive license (MIT). In 2023, more than a thousand commercial Godot games were published and a growing number of promising titles signal the accelerating adoption by the game development community. With a strong, year-over-year growth rate, Godot has climbed the rankings of the game industry to challenge well-established proprietary solutions and expand to fast-growing gaming segments like virtual and mixed reality.\nMeta and W4’s strategic collaboration enables new and exciting opportunities for the fast-growing Godot users community, the open-source gaming community, and Quest users alike. In particular, the partnership will cover:\nImproving functionality, performance and usability of OpenXR features within Godot for the benefit of all VR developers\nProviding an integration of the Meta Quest SDKs via plugin and exposing more Meta Quest features to end-users\nDeveloping an optimized release template specifically for Quest users that leverages Meta Quest technology\nCreating high-quality samples and documentation to help Godot users develop for Meta Quest\nThe strategic partnership also contemplates the development of educational materials and joint marketing activities in the coming years. Meta and W4 Games are dedicated to contributing as much of this work as possible to the Godot project as part of our shared commitment to the open-source community.\nLearn more about Godot — and celebrate at GDC\nDevelopers can learn more about building games with the Godot Engine at GDC 2024. Visit the Godot Pavilion, booth S763, North & South Halls — and celebrate the passionate community at the heart of the open-source movement transforming game development.\nAbout W4 Games\nFounded in 2021, W4 Games is an Irish startup formed by Godot veterans Juan Linietsky, Rémi Verschelde and Fabio Alessandrelli, and veteran entrepreneur Nicola Farronato. The company plans to revolutionize the game industry by bringing the Commercial Open Source Software (COSS) business model to an ecosystem that has traditionally relied on proprietary solutions from an ever-shrinking number of independent vendors. By providing a commercial services offering anchored in the entirely open and community-developed Godot platform, W4 Games believes that companies will be able to reclaim control of the technology powering their games, with a level of freedom and flexibility they never had before.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240314670069/en/\nContacts\nSara BlackBospar213.618.1501sara@bospar.com\n"
    }
]