[
    {
        "Date": "2024-04-30T22:58:12.000Z",
        "Title": "Judge dismisses Meta shareholder lawsuit claiming that directors' obligations extend beyond company",
        "Author": "  RANDALL CHASE ",
        "Text": "DOVER, Del. (AP) — A Delaware judge on Tuesday dismissed a shareholder lawsuit asserting novel claims about the roles of corporate leaders and arguing that the loyalties of Meta directors and company founder Mark Zuckerberg should not lie exclusively with the social media giant.\nJames McRitchie, who runs a website focused on corporate governance and shareholder activism, argued that Meta’s directors have breached their duties to the company by putting profits over broader societal and economic interests, including Meta shareholders’ diversified investments in other companies.\nIn a 101-page opinion citing court rulings dating back more than 200 years, decades of law review articles and legal treatises, and even a Sherlock Holmes short story, Vice Chancellor J. Travis Laster rejected McRitchie’s claims.\nLaster noted that, under the “standard Delaware formulation” of corporate law, directors of a corporation owe duties to the stockholders as investors in that corporation.\n“The plaintiff has not made a persuasive case for change,” Laster wrote. “At most, he has shown that some academics — primarily from the law and economics school — have assumed that a diversified-investor model is the norm. He has also shown that some investor advocacy organizations would prefer that model.”\nWhile Delaware law requires corporate directors to act in the best interests of their stockholders, including maximizing the value of their shares, attorneys for McRitchie argued that Delaware courts should recognize a “portfolio theory” of corporate governance that takes into account external factors.\nThey argued, for example, that Meta, which owns Facebook, Instagram, Messenger and WhatsApp, has prioritized profits while downplaying the detrimental effects of its products on society and the global economy. That, in turn, they said, can negatively affect the investment portfolios of Meta shareholders who also have invested in other companies.\nAmong the “negative externalities” the lawsuit blamed on Meta’s social media platforms are mental health problems among young Instagram users, online human trafficking, “vaccine hesitancy,” incitements to violence, and “election misinformation.”\n"
    },
    {
        "Date": "2024-04-25T15:42:26.000Z",
        "Title": "Why Meta Platforms Stock Crashed and Burned Thursday Morning",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "Shares of Meta Platforms (NASDAQ: META) traded sharply lower Thursday morning, falling as much as 16%. As of 10:52 a.m. ET, the stock was still down 12.3%.\nThe catalyst that sent the social media titan lower was the company's quarterly financial report, but not for the reasons you might think.\nIn the first quarter, Meta reported revenue that grew 27% year over year to $36.4 billion. Expenses grew more slowly, increasing just 6%, which helped drive operating margins to 38%, up from 25% in the prior-year quarter. This fueled robust profits, as earnings per share (EPS) surged 114% to $4.71.\nTo put the results into context, analysts' consensus estimates called for revenue of $36.14 billion and EPS of $4.32, so Meta sailed past expectations with ease.\nMeta also noted that the number of users of its family of social media sites grew 7% year over year to 3.24 billion, while advertising impressions across its family of apps jumped 20%.\nThat mostly sounds like a cause for celebration, so what caused the stock to plummet? Meta's plans for artificial intelligence (AI) and the associated spending. Meta raised its full-year forecast for capital expenditures to a range of $35 billion to $40 billion, up from its prior outlook of $30 billion to $37 billion. Meta said, \"We continue to accelerate our infrastructure investments to support our AI roadmap.\" It also said capital spending to support AI will be even higher in 2025.\nSince generative AI burst on the scene last year, the demand to incorporate these advanced algorithms has been off the charts. Meta is one of just a few big tech companies with the resources to create the large language models needed to bring generative AI to life.\nThe company's Large Language Model Meta AI (LLaMA) AI is widely regarded as being among the top AI systems in the world, though CEO Mark Zuckerberg acknowledged, \"We're investing and scaling a new product but aren't yet monetizing it.\"\nWhile many analysts (slightly) reduced their price targets on Meta stock, sentiment was surprisingly upbeat. Jefferies analyst Brent Thill seemed to capture the prevailing mood on Wall Street, saying that investors should \"buy the [Zuckerberg] shopping cart dip.\"\nWith Meta stock selling for just 22 times forward earnings, he's not wrong.\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $488,186!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 22, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Danny Vena has positions in Meta Platforms. The Motley Fool has positions in and recommends Jefferies Financial Group and Meta Platforms. The Motley Fool has a disclosure policy.\nWhy Meta Platforms Stock Crashed and Burned Thursday Morning was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-18T16:00:53.000Z",
        "Title": "Meta rolls out an updated AI assistant, built with the long-awaited Llama 3",
        "Author": " Lawrence Bonk    · Contributing Reporter",
        "Text": "Meta just announced a major update for its AI assistant platform, Meta AI, which has been built using the long-awaited open source Llama 3 large language model (LLM). The company says it's “now the most intelligent AI assistant you can use for free.” As for use case scenarios, the company touts the ability to help users study for tests, plan dinners and schedule nights out. You know the drill. It’s an AI chatbot.\nMeta AI, however, has expanded into just about every nook and cranny throughout the company’s entire portfolio, after a test run with Instagram DMs last week. It’s still available with Instagram, but now users can access it on Messenger, Facebook feeds and Whatsapp. The chatbot also has a dedicated web portal at, wait for it, meta.ai. You don’t need a company login to use it this way, though it won’t generate images. Those recently-released Ray-Ban smart glasses also integrate with the bot, with Quest headset integration coming soon.\nOn the topic of image generation, Meta says it's now much faster and will produce images as you type. It also handles custom animated GIFs, which is pretty cool. Hopefully, it can successfully generate images of different races of people. We found that it struggled with this basic concept a couple of weeks back, as it seemed biased toward creating images of people of the same race, even when prompted otherwise.\nMeta’s also expanding global availability along with this update, as Meta AI is coming to more than a dozen countries outside of the US. These include Australia, Canada, Ghana, Jamaica, Pakistan, Uganda and others. However, there’s one major caveat. It’s only in English, which doesn’t seem that useful to a global audience, but whatever.\nAs for safety and reliability, the company says Llama 3 has been trained on an expanded data set when compared to Llama 2. It also used synthetic data to create lengthy documents to train on and claims it excluded all data sources that are known to contain a “high volume of personal information about private individuals.” Meta says it conducted a series of evaluations to see how the chatbot would handle risk areas like conversations about weapons, cyber attacks and child exploitation, and adjusted as required. In our brief testing with the product, we've already run into hallucinations, as seen below.\nAI has become one of Meta CEO Mark Zuckerberg's pet projects, along with raising really expensive cattle for beef in a secluded Hawaiian compound, but the company’s still playing catch up to OpenAI and, to a lesser extent, Google. Meta’s Llama 2 never really wowed users, due to a limited feature set, so maybe this new version of the AI assistant will catch lightning in a bottle. At the very least, it should be able to draw lightning in a bottle, or more accurately, slightly tweak someone else’s drawing of lightning in a bottle.\n"
    },
    {
        "Date": "2024-04-25T11:36:00.000Z",
        "Title": "Here's What Was Wrong With Meta's Q1 Earnings Report",
        "Author": "  Daniel Sparks, The Motley Fool ",
        "Text": "Shares of Facebook parent Meta Platforms (NASDAQ: META) were hammered during after-hours trading on Wednesday, sliding more than 16% at one point. The big pullback in the stock price came after the company released its first-quarter earnings report.\nInterestingly, the social media specialist's report actually included some pretty upbeat data about Q1 itself. Revenue and earnings per share (EPS), for instance, were both ahead of analysts' average forecasts for the two metrics. So why did the stock fall?\nProbably because of Meta's guidance. Not only did it say it's now expecting to spend more on capital expenditures during 2024 than it previously anticipated, but its second-quarter revenue guidance implies a significant deceleration in its year-over-year growth rate.\nMeta's first-quarter financial performance was quite impressive. Total revenue rose 27% year over year to $36.5 billion, beating analysts' consensus forecast for about $36.2 billion.\nThis top-line performance put the figure at the high end of management's guidance for the period for revenue between $34.5 and $37 billion. Further, this marked an acceleration from the 25% year-over-year revenue growth Meta reported in the fourth quarter of 2023.\nSuch strong sales growth, combined with benefits from the company's increasing focus on efficiency, unsurprisingly led to significant operating margin expansion and, ultimately, a more than doubling in earnings per share. Meta's operating margin expanded from 25% in the year-ago quarter to 38%, while earnings per share rose 114% to $4.71.\nThis performance was fueled by healthy user metrics, including a 7% year-over-year increase in daily users across its platforms, a 20% jump in ad impressions, and a 6% boost in average price per ad.\nThese strong results put cash, cash equivalents, and marketable securities at the end of the period at about $58 billion, even as Meta spent approximately $14.6 billion buying back its stock and paid out $1.3 billion in dividends to shareholders.\nConsidering Meta's incredible first-quarter results, the company's guidance for a slowdown is a bit surprising. Management's outlook for second-quarter revenue of between $36.5 billion and $39 billion implies 18% year-over-year growth -- a dramatic deceleration from the 27% growth the company reported in Q1.\nSuch a significant expected pullback in its top-line year-over-year growth rate may cause some investors to worry. They might be asking: Could growth slow even more in the coming quarters?\nThis is particularly concerning in a high-interest-rate environment like the ones consumers are in today. Investors are looking for clues as to whether or not this will negatively impact consumers to the point that advertisers start being more judicious about their marketing budgets.\nAnother reason Meta investors may be disappointed is the company increased its outlook for capital expenditures for the full year. Management said it now expects to spend between $35 billion and $40 billion, up from a previous forecast for $30 billion to $37 billion. This increase is due to a continued acceleration of Meta's infrastructure investments to support its artificial intelligence (AI) product development, said Meta Chief Financial Officer Susan Li in the company's first-quarter earnings report.\nSlowing growth combined with higher-than-expected capital expenditures are definitely good reasons for investors to be incrementally cautious.\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $505,010!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 22, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Daniel Sparks has no position in any of the stocks mentioned. His clients may own shares of the companies mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nHere's What Was Wrong With Meta's Q1 Earnings Report was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-25T22:20:00.000Z",
        "Title": "1 Wall Street Analyst Thinks Meta Platforms Stock Is Going to $565. Is It a Buy?",
        "Author": "  John Ballard, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) delivered first-quarter financial results above expectations, but the stock tumbled after management said it was going to ramp up spending to support growth initiatives. This clouds the near-term outlook for the company's profits, which is why the stock is falling.\nBernstein lowered its price target from $590 to $565 but maintained an outperform (buy) rating on the shares. Here's why the dip could be a great buying opportunity.\nMeta reported solid numbers across the board. Revenue grew 27% year over year, and higher margins boosted earnings per share by 114%. However, the company's investments in artificial intelligence (AI) initiatives will come at a cost that could put the brakes on earnings growth in the near term.\nMeta said it expects full-year operating expenses to be $2 billion higher than its previous forecast. It also plans to spend more on infrastructure to support AI development, which could range from $35 billion to $40 billion.\nWall Street typically likes to see higher visibility to growth in the near term, but Meta is investing for a long-term payoff. These investments are ultimately designed to benefit user engagement and business activity across its social media platforms.\nMeta is still the same business it was yesterday. It has a history of accelerating capital expenditures when it sees an opportunity to grow the value of the business. The stock should recover and move toward the analyst's price target as market participants return their attention to the company's long-term growth prospects.\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $488,186!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 22, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\n1 Wall Street Analyst Thinks Meta Platforms Stock Is Going to $565. Is It a Buy? was originally published by The Motley Fool\n"
    }
]