[
    {
        "Date": "2024-05-08T11:30:00.000Z",
        "Title": "Here's the Real Winner From Meta Platforms' Latest Announcement",
        "Author": "  Keithen Drury, The Motley Fool ",
        "Text": "Artificial intelligence (AI) is an incredible technology that is changing how business is conducted and how people search the internet. However, this isn't happening without substantial input costs. Many big tech firms are investing millions (if not billions) of dollars into their computing infrastructure to support the rise of AI.\nHowever, not all investors like this. If these companies spend on infrastructure, they're posting smaller profits. That's not music to the market's ears, so when companies mention that, they can get hit. That's exactly what happened to Meta Platforms (NASDAQ: META) after it reported first-quarter results. But the information companies like Meta give investors during their conference calls can be like gold, as the crumbs of all the conference calls reveal one clear winner.\nIn Meta's Q1 conference call, Susan Li, Meta's CFO, discussed the company's investment in AI infrastructure:\nAs we develop more advanced and compute-intensive recommendation models and scale capacity for our generative AI training and inference needs, we expect that having sufficient infrastructure capacity will be critical to realizing many of these opportunities. As a result, we expect that we will invest significantly more in infrastructure over the coming years.\nPrior to that, she mentioned that Meta sees great opportunities in the various AI technologies it's developing. This is a long-term investment, and with most investors in the market focused only on the short term, this announcement isn't what they wanted.\nAs a result, Meta increased its 2024 capital expenditure costs to $35 billion to $40 billion from its previous $30 billion to $37 billion. It also stated that even though it hasn't issued guidance for next year, it expects it to increase thanks to AI research.\nClearly, the infrastructure needed for AI buildout isn't done yet. Another company shares the same sentiment.\nTesla officials mentioned in the company's conference call with analysts that it has 35,000 H100 graphics processing units (GPUs; made by Nvidia (NASDAQ: NVDA)) up and running, but that number should increase to 85,000 by the end of the year.\nMeta is also using Nvidia's products, so it's becoming clear who the real winner in all of this is: Nvidia.\nNvidia is the market leader in GPUs and has a significant market share advantage over its competitors. Its growth has been nothing short of incredible over the past year. Announcements like Meta's stating they will only accelerate their infrastructure buildout are a bullish sign for the company.\nFurthermore, the GPUs customers are installing now may be obsolete in five years, so there should be significant revenue in the future as older GPUs are cycled out. This gives credence to analyst firms like Precedence Research, which believes the global GPU market opportunity could be $773 billion by 2032. With Nvidia already holding a significant market share, it's set to capture a large chunk of this opportunity.\nThis already helped transform Nvidia into one of the world's most powerful companies, and it's not set to relinquish that title soon. As more companies build out their AI products, Nvidia will be set to benefit.\nBut does that make the stock a buy?\nBecause Nvidia is still growing rapidly, using trailing metrics is unwise. So, we'll look at its forward price-to-earnings (P/E) ratio.\nAt 34 times forward earnings, Nvidia is still a very expensive stock with many expectations baked into it. But if its growth rate continues for several years, this still could be a bargain price for the stock, as long as you're willing to endure the volatility it brings.\nIf you can, it's clear that the long-term opportunity for Nvidia's primary product is still there, and the infrastructure needed to support the proliferation of AI is yet to be fully constructed.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $564,547!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 6, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Meta Platforms and Tesla. The Motley Fool has positions in and recommends Meta Platforms, Nvidia, and Tesla. The Motley Fool has a disclosure policy.\nHere's the Real Winner From Meta Platforms' Latest Announcement was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-28T20:29:02.000Z",
        "Title": "Generative AI is in the crosshairs at Meta and Alphabet annual meetings as shareholders vote for detailed reports",
        "Author": "  Sharon Goldman ",
        "Text": "Generative AI is on the ballot at Big Tech companies like Meta and Alphabet, as shareholders vote on proposals calling for detailed reports by the companies about how the technology is being used to create and spread misinformation. The shareholder proposals, which will be voted on at each company’s upcoming annual general meeting, reflect growing concerns about the power and prevalence of generative AI.\nThe votes come as Google has faced massive blowback over the past week for its new search AI features, which has produced false and often bizarre responses, including telling users to put glue on pizza. Audio and video deepfakes created by AI technology are also proliferating online, raising concerns in an election year.\nShareholders in Meta, the parent company of Facebook and Instagram, will vote at the company’s annual meeting on Wednesday, while investors in Google-parent company Alphabet will weigh in at the company’s annual meeting on June 7. The resolutions come just a few months after a similar proposal at Microsoft’s AGM on December 7, 2023, which was presented by Nirvana co-founder and bassist Krist Novoselic and garnered 21% of the shareholder vote.\nThe three proposals were led by ESG activist investor group Arjuna Capital and focus on concerns that generative AI threatens to amplify misinformation and disinformation around the world, particularly during a critical election year in countries like the US and India. A separate shareholder proposal brought to Apple focused on the risks of AI to workers, which was filed by the AFL-CIO Equity Index Funds, the largest labor union federation in the US. While the proposal was ultimately voted down by Apple shareholders at its annual meeting in February, proponents of AI transparency won a victory beforehand when the SEC ruled that companies like Apple could not bar shareholders from voting on such matters.\nIn the proxy statement for Meta's annual meeting, the shareholder proposal states that \"with Meta’s recent development of gAI products, including conversational assistants and advertising tools, the company is increasingly at risk from misinformation and disinformation generated through its own products.\"\nThe proposal calls for the Meta board to “issue a report, at reasonable cost, omitting proprietary or legally privileged information, to be published within one year of the Annual Meeting and updated annually thereafter, assessing the risks to the Company’s operations and finances, and to public welfare, presented by the Company’s role in facilitating misinformation and disinformation disseminated or generated via generative Artificial Intelligence; what steps the Company plans to take to remediate those harms; and how it will measure the effectiveness of such efforts.”\nIn its response urging shareholders to reject the proposal, Meta pointed to its “five pillars of Responsible AI” which are overseen by its board of directors, as well as its investments in safety and security efforts to combat misinformation and disinformation.\n“Given our ongoing efforts to address this topic, the board of directors believes that the requested report is unnecessary and would not provide additional benefit to our shareholders,” the Proxy Report said.\nIn a response to a similar proposal, Alphabet said that its Board of Directors recommended a vote against the stockholder proposal because “Our enterprise risk frameworks, product policies, and tools provide a foundation for identifying and mitigating AI-generated mis/disinformation and other potential risks,” adding that “we continually strive to improve the quality of our generative AI models and applications through both pre-launch testing and ongoing fine-tuning, and we are transparent about our ongoing work via public reporting.”\nThe proposals for AI reports at Meta and Alphabet are unlikely to be approved, as both companies have dual class stock that concentrates the voting power in the hands of the founders. Still, the proposals carry symbolic power and have the potential to send a message to management if they earn widespread support from shareholders.\nAt December’s Microsoft AGM, Novoselic served as the spokesperson for the shareholder initiative, describing himself as a long-time shareholder. He accused the company of racing forward, “releasing this nascent technology without the appropriate guardrails.” Generative AI, he continued, “is a game-changer, there’s no question, but the rush to market seemingly prioritizes short term profits over long-term success.”\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-05-29T17:30:23.000Z",
        "Title": "Meta Removes AI-Generated Influence Campaigns in China, Israel",
        "Author": "  Aisha Counts ",
        "Text": "(Bloomberg) -- Meta Platforms Inc. removed hundreds of Facebook accounts associated with covert influence campaigns from China, Israel, Iran, Russia and other countries, some of which used artificial intelligence tools to generate disinformation, according to the company’s quarterly threat report.\nMost Read from Bloomberg\nKey Engines of US Consumer Spending Are Losing Steam All at Once\nGameStop Shares Surge as Gill’s Reddit Return Shows Huge Bet\nMnuchin Chases Wall Street Glory With His War Chest of Foreign Money\nHomebuyers Are Starting to Revolt Over Steep Prices Across US\nAMLO Protege Sheinbaum Becomes First Female President in Mexico\nMeta, the parent of Facebook, Instagram and WhatsApp, has seen threat actors rely on AI to produce fake images, videos and text in an effort to influence users on its sites. But the use of generative AI didn’t affect the company’s ability to disrupt those networks, Meta said Wednesday in the report.\nAmong the disinformation campaigns, the company found a deceptive network from China sharing AI-generated poster images of a fictitious pro-Sikh movement, and an Israel-based network posting AI-generated comments praising Israel’s military under the pages of media organizations and public figures. The company said it removed many of those networks before they were able to build audiences among authentic communities.\n“Right now we’re not seeing gen AI being used in terribly sophisticated ways,” Meta’s policy director of threat disruption, David Agranovich, said Tuesday during a press briefing. Tactics such as creating AI-generated profile photos or using artificial intelligence to produce large volumes of spammy content, haven’t been effective so far, he said.\n“But we know that these networks are inherently adversarial,” Agranovich said. “They’re going to keep evolving their tactics as their technology changes.”\nSocial media companies such as Facebook, ByteDance Ltd.’s TikTok and Elon Musk’s X have struggled with the influx of fake and misleading AI-generated content on their sites. This year alone, doctored audio of US President Joe Biden and fake images of the Israel-Hamas conflict circulated on social media, gathering millions of views.\nNick Clegg, Meta’s president of global affairs, has been vocal about the need to detect and label AI-generated content, especially as the company prepares for the 2024 election cycle. Global elections will take place in more than 30 countries this year, including many places where the company’s apps are widely used, such as the US, India and Brazil.\nClegg has said that creating an industry standard around watermarking is the “most urgent task facing us today.” Meta has been working on the ability to detect and label images that were created by tools from AI companies such as Alphabet Inc.’s Google and OpenAI. The company has already starting adding visible markers to some images as well as invisible markers and identifying information in image files.\nMeta recently updated its policies to label misleading content on its site that is AI-generated, rather than remove it. The company also requires advertisers to disclose when they use AI to create Facebook or Instagram ads related to social issues, elections or politics, but the company doesn’t fact-check political ads by politicians.\n(Updates with image detection in the eighth paragraph.)\nMost Read from Bloomberg Businessweek\nYes, Walmart Store Managers Really Can Make $500,000 a Year\nDisney Is Banking On Sequels to Help Get Pixar Back on Track\nThe Budget Geeks Who Helped Solve an American Economic Puzzle\nIsrael Seeks Underground Secrets by Tracking Cosmic Particles\nHow Rage, Boredom and WallStreetBets Created a New Generation of Young American Traders\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-05-10T02:55:22.000Z",
        "Title": "Meta Platforms Stock (NASDAQ:META): Will Its Colossal Gains Continue or Reverse?",
        "Author": "  TipRanks ",
        "Text": "Social media giant Meta Platforms (NASDAQ:META) has grown remarkably, soaring approximately 490% in under two years. However, Meta recently saw its most significant market cap decline since 2022, shedding around $200 billion following its Q1 results. The stock received downward revisions in target prices across Wall Street. The crucial question now is whether to buy or sell. Personally, I view this as an opportunity to invest in the stock based on its AI-based growth trajectory. I believe it can keep rising.\nMeta’s Q1 adjusted earnings of $4.71 per share handily beat the consensus estimate of $4.32 per share. Also, earnings more than doubled year-over-year compared to earnings of $2.20 per share in the prior-year period. Revenues jumped 27% year-over-year to $36.5 billion, meeting consensus estimates by $36.2 billion.\nThe revenue jump was fueled by a 27% rise in Advertising revenue (accounts for 98% of total revenues) to $35.64 billion. However, the Reality Labs division (the division that invests in the Metaverse) continued to report losses, amounting to $3.85 billion for the quarter.\nDespite the EPS beat, the stock experienced its largest single-day decline (15%) in over two years. This decline can be attributed to lower-than-expected revenue guidance and higher-than-expected capital expenditures (CAPEX) forecasts.\nThe Facebook, Instagram, and WhatsApp parent expects Q2 total revenue to range between $36.5-39 billion, while the consensus was pegged at $38.3 million. CAPEX is expected to increase to $35-40 billion versus the prior guided range of $30-37 billion. Further, expenses are expected to increase and are forecasted to continue to increase through next year. For FY2024, total expenses are predicted to range around $96-99 billion versus the prior guided range of $94-99 billion.\nDuring the earnings call, CEO Mark Zuckerberg elaborated on Meta’s heightened investment plans in AI infrastructure. The company aims to inject billions into the AI space and develop its proprietary AI chips, thereby reducing dependence on chipmakers like Nvidia (NASDAQ:NVDA).\nIn terms of newer products, the company also announced that MetaAI, featuring Llama 3 (competing with Microsoft’s ChatGPT and Google’s Gemini), is poised to become the most efficient AI assistant. This innovation could represent a substantial business opportunity in the coming years, further contributing to revenue growth.\nMeta’s AI investment plans align somewhat with its major competitors, who are also making substantial investments in the AI domain. While Alphabet (NASDAQ:GOOGL) reported CAPEX of $12 billion in the recently ended first quarter, Microsoft (NASDAQ:MSFT) spent $14 billion. Both Google and MSFT plan to escalate their CAPEX spending in AI in the upcoming quarters.\nHowever, Google and Meta’s shares soared after their recent earnings. On the contrary, Meta’s shares plunged as their capital investments are still not visible in their revenue and earnings growth. For instance, Google and Microsoft’s capital investments in AI are yielding impressive growth in their cloud businesses. However, Meta’s Reality Labs business segment still remains unprofitable, with reported losses exceeding $45 billion since the end of FY2020.\nIn essence, while AI spending is translating into direct gains for Google and Microsoft, it’s taking Meta longer to show such returns, turning it into a capital-intensive, cash-sucking endeavor. Therefore, the following question arises: should investors wait and observe or buy the stock at current levels following the recent decline?\nIn the long run, Meta’s move to produce its own chips will likely benefit the company significantly by reducing costs associated with expensive GPUs procured from NVDA currently. Additionally, owning its AI infrastructure promises faster and more efficient processing of vast amounts of data for the social media giant.\nIn terms of its valuation, Meta is attractively valued. Currently, it’s trading at an attractive P/E ratio of 23.5x compared to much higher multiples of its peer group. For the sake of comparison, Microsoft is trading at a P/E of 35x, while Amazon (NASDAQ:AMZN) is trading at over 50x.\nDespite elevated capital expenditures, Meta’s free cash flows remain healthy at $49.5 billion for the past 12 months, or 4.1% of the current market capitalization. It is worth noting that the company started a dividend for the first time in the preceding quarter and continued to buy back shares, implying that management is confident in the company’s fundamentals.\nThe Wall Street community is clearly optimistic about the stock. Overall, META commands a Strong Buy consensus rating based on 39 Buys, three Holds, and one Sell. Meta Platforms stock’s average price target of $530.93 implies 11.73% upside potential from current levels.\nSocial media giant Meta has built a vast user base over time, establishing itself as the clear industry leader. Its steady position among the world’s “Magnificent 7” mega-cap stocks is well-deserved, supported by the continued growth in advertising revenue per user. Notably, Meta’s revenues and margins have been growing impressively, and the integration of AI infrastructure across its portfolio is poised to drive revenues even higher in the coming years.\nFor those who missed out on Meta’s remarkable stock rally (second only to NVDA) over the last two years, the current dip presents a buying opportunity, in my view. I personally plan to buy the stock and hold it for the long term.\nDisclosure\n"
    },
    {
        "Date": "2024-05-14T10:57:10.000Z",
        "Title": "UAE’s new Falcon AI model outperforms Meta’s Llama 3",
        "Author": "  Alice Nunwick ",
        "Text": "The UAE’s Technology Innovation Institute (TII) has unveiled the next generation of its Falcon AI models which it claims outperforms Meta’s most recent Llama 3 model.\nFalcon 2 11B and 2 11B VLM were released as open source, making their code accessible to developers globally with unrestricted access.\nFalcon 2 11B VLM has visual-to-language capabilities, meaning it can analyse images and generate captions to describe the contents of an image.\nThe TII stated that it hoped introducing visual-to-language capabilities would create new use cases for AI in industries like healthcare, finance, education and the legal sector.\nIt stated that both models can run on one graphics processing unit (GPU), touting Falcon’s scalability and deployment ease to businesses wanting to integrate AI into their work.\nBoth models are multilingual and can work in English, French, German, Spanish and Portuguese.\nExecutive director and acting chief researcher of AI at the TII, Dr. Hakim Hacid, stated that smaller AI models may soon overtake their larger counterparts.\n“AI is continually evolving, and developers are recognizing the myriad benefits of smaller, more efficient models,” Hacid stated.\n“In addition to reducing computing power requirements and meeting sustainability criteria, these models offer enhanced flexibility, seamlessly integrating into edge AI infrastructure, the next emerging megatrend,” he said.\n“Furthermore, the vision-to-language capabilities of Falcon 2 open new horizons for accessibility in AI, empowering users with transformative image to text interactions,” concluded Hacid.\nLooking ahead, the TII stated that it would be updating both Falcon models to have a Mixture of Experts (MoE) capability.\nMoE will aim to create a more accurate and reliable Falcon that is able to answer industry-specific and niche prompts.\nNot only would this help accuracy, but the TII stated that it hoped to cement Falcon’s place as a helper to businesses’ strategic decisions.\nResearch and analysis company GlobalData forecasts that the total AI market will be worth over $1,037bn by 2030.\n\"UAE’s new Falcon AI model outperforms Meta’s Llama 3\" was originally created and published by Verdict, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    }
]