[
    {
        "Date": "2024-06-25T10:27:00.000Z",
        "Title": "Who Owns the Most Meta Stock Besides Mark Zuckerberg?",
        "Author": "  Scott Levine, The Motley Fool ",
        "Text": "The face of Facebook, Mark Zuckerberg, founded the social networking company 20 years ago. Now organized under the parent company Meta Platforms (NASDAQ: META), Facebook remains one of the most influential social media sites on the internet under the leadership of Zuckerberg, the company's largest shareholder.\nBut that's not to say that there aren't other individuals and institutions with sizable positions in Meta. Let's dig under the surface a little and see who the other major investors in Meta stock are.\nIn terms of insiders, the next-largest Meta shareholder after Mark Zuckerberg is Sheryl Sandberg. In addition to serving as the company's chief operating officer for 14 years, Sandberg was a member of the company's board of directors, a position which she left in May 2024. According to a May 31, 2024 regulatory filing, Sandberg owns 639,610 shares of Meta stock, representing about 0.03% of the 2,191,446,233 outstanding shares of the company's Class A stock.\nWith regards to institutional owners, Vanguard holds the top spot among the social media company's investors, owning 186,347,527 shares of Meta stock. Representing about 8.4% of Meta Class A stock, Vanguard's ownership stake is impressive. But it's worth noting that BlackRock also has a hefty position, owning 7.1% of Meta stock in its iShares series of exchange-traded funds.\nAfter seeing the sizable positions that some hold in Meta, retail investors may be wondering if they should pick up shares for themselves. In light of the commanding position that Meta has in social networking, it's a more-than-reasonable consideration. What's especially worth recognizing is the company's commitment to incorporating artificial intelligence (AI) into the various platforms that the company owns, making it a worthy option for investors looking for AI exposure that transcends semiconductor companies.\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $775,568!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 24, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Scott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nWho Owns the Most Meta Stock Besides Mark Zuckerberg? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-28T05:16:08.000Z",
        "Title": "Meta says it may block news from Facebook in Australia",
        "Author": "Reuters ",
        "Text": "SYDNEY (Reuters) - Facebook owner Meta is considering blocking news content from the platform in Australia if the government makes it pay licensing fees, a company representative told a parliamentary hearing on Friday.\nMeta's regional policy director Mia Garlick told lawmakers \"all options are on the table\" when asked if the company would block Australians from sharing news content to avoid paying fees.\n\"There's a large number of channels that people can get news content from,\" Garlick told the inquiry.\nShe said Meta was waiting for Canberra to decide if it would apply an untested 2021 law which gives the government the right to set the fees U.S. tech giants pay media outlets for links.\nThe comments are the strongest indication so far that Meta would take the same hardline approach in Australia it took in Canada in 2023 when that country introduced similar laws.\nMeta struck deals with Australian media firms including News Corp and the Australian Broadcasting Corp when the law was brought in Australia, but has since said it will not renew those arrangements beyond 2024.\nIt now falls on Australia's assistant treasurer to decide whether to step in and force Facebook to pay for news content. The assistant treasurer has said he is still collecting advice but that Meta seems to respect the law only when it suits.\nAustralia's two largest free-to-air television broadcasters, Nine Entertainment and Seven West Media, meanwhile said this week they were cutting jobs, citing loss of revenue once their deals with Meta expire.\nAsked on Friday if blocking news from Facebook in Australia would amount to sidestepping the law, Meta's Garlick said taking that action would be complying with it.\n\"Every other law - tax laws, safety laws, privacy laws - we work to comply with,\" she said. \"It's just compliance would look slightly different in relation to this law if it's fully enacted.\"\nGarlick defended Meta's processes for Australians to complain if they believed the company was spreading harmful misinformation or scams, although she said its content moderation centres were all in other countries.\nAsked about Australian mining billionaire Andrew Forrest, who is suing Meta for showing cryptocurrency scam advertisements featuring his face, Garlick said the company had processes in place to detect and stop scams, but \"there are a lot of challenges\".\nHow could Meta call itself an advertising business when \"some ads sell lies\", asked Greens Senator Sarah Hanson-Young.\n\"We have policies and systems and tools to do everything we can to prevent those ads,\" Garlick replied.\n(Reporting by Byron Kaye; Editing by Stephen Coates and Miral Fahmy)\n"
    },
    {
        "Date": "2024-06-25T13:45:07.000Z",
        "Title": "Here's Why Meta Platforms (META) is a Strong Growth Stock",
        "Author": "  Zacks Equity Research ",
        "Text": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\nWhy This 1 Growth Stock Should Be On Your Watchlist\nGrowth investors build their portfolios around companies that are financially strong and have a bright future, and the Growth Style Score helps take projected and historical earnings, sales, and cash flow into account to uncover stocks that will see long-term, sustainable growth.\nMeta Platforms (META)\nMeta Platforms is the world’s largest social media platform. The company’s portfolio offering evolved from a single Facebook app to multiple apps like photo and video sharing app Instagram and WhatsApp messaging app owing to acquisitions. Along with in-house developed Messenger, these apps now form Meta’s family of products used by almost 3.24 billion people on a daily basis as of Mar 31, 2024.\nMETA sits at a Zacks Rank #3 (Hold), holds a Growth Style Score of A, and has a VGM Score of B. Earnings and sales are forecasted to increase 35.6% and 17.8% year-over-year, respectively.\nTwo analysts revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $0.03 to $20.16 per share. META boasts an average earnings surprise of 13.3%.\nMeta Platforms is also cash rich. The company has generated cash flow growth of 13.7%, and is expected to report cash flow expansion of 42.7% in 2024.\nMETA should be on investors' short lists because of its impressive growth fundamentals, a good Zacks Rank, and strong Growth and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-06T20:36:17.000Z",
        "Title": "Meta's WhatsApp launches new AI tools for businesses",
        "Author": "  Dani Morera and Andre Romani ",
        "Text": "By Dani Morera and Andre Romani\nSAO PAULO (Reuters) -Meta launched its first AI-driven ad targeting program for businesses on WhatsApp, as it tries to wring revenue out of the popular chat service, the company announced on Thursday at a conference in Brazil.\nCEO Mark Zuckerberg announced the new tools in a video which was exhibited during the event.\nThe announcement marks a shift for WhatsApp, an encrypted messaging service that heavily touts its privacy credentials and has long eschewed the types of targeted advertising tools that underpin Meta's other apps, like Facebook and Instagram.\nThe social media giant has been introducing commerce and payment features on the app for several years, including \"business messaging\" tools companies can use to conduct customer service chats and send marketing materials to people who have shared their phone numbers with the companies.\nPreviously, those tools were blunt instruments, used to send blasts to all users who had opted in to receiving the company's outreach. The new AI tools will use behavior on Facebook and Instagram to target the messages to those customers most likely to be receptive to them, provided the customers use the same opted-in phone number across accounts.\nWhatsApp's head of strategic markets Guilherme Horn told Reuters that these AI tools would give business the possibility to optimize ad delivery to users most likely to engage. \"This is very important for business because they are paying for those messages.\"\nMeta has been ramping up efforts to earn money off WhatsApp, its biggest app in terms of daily users. Despite the service's popularity and its eye-popping $22 billion acquisition price tag in 2014, to date it has contributed only a sliver to Meta's total revenue.\nAt the conference, Meta also introduced a new AI chatbot to answer business inquiries directly in chat, an early test of Zuckerberg's goal to convince businesses to outsource their communications to automated tools.\nThe chatbot will assist users with common requests such as finding catalogs or consulting business hours, similar to existing AI-powered customer service platforms.\nIt also announced it's adding Brazil's instantaneous digital payment method PIX, once seen as a potential competitor, to its WhatsApp payment tool in the country.\nPIX, designed by central bank, has represented about 39% of the transactions made in Brazil last year, and offers similar services than WhatsApp payments tool, such as money transferences between individuals and purchases from companies.\nWhatsApp similarly started offering payment services from rival providers in India last year.\n(Reporting by Andre Romani and Dani Morera in Sao Paulo; Writing by Katie Paul in New York; Editing by Aurora Ellis)\n"
    },
    {
        "Date": "2024-07-01T20:05:00.000Z",
        "Title": "Meta to Announce Second Quarter 2024 Results",
        "Author": "PR Newswire ",
        "Text": "MENLO PARK, Calif., July 1, 2024 /PRNewswire/ -- Meta Platforms, Inc. (NASDAQ: META) announced today that the company's second quarter 2024 financial results will be released after market close on Wednesday, July 31, 2024.\nMeta will host a conference call to discuss its results at 2:00 p.m. PT / 5:00 p.m. ET the same day. The live webcast of the call can be accessed at the Meta Investor Relations website at investor.fb.com, along with the company's earnings press release, financial tables, and slide presentation. \nFollowing the call, a replay will be available at the same website. Transcripts of conference calls with publishing equity research analysts held on July 31, 2024 will also be posted to the investor.fb.com website.\nDisclosure Information Meta uses the investor.fb.com and about.fb.com/news/ websites as well as Mark Zuckerberg's Facebook Page (facebook.com/zuck), Instagram account (instagram.com/zuck) and Threads profile (threads.net/zuck) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD. \nAbout Meta Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.\nContacts Investors: Kenneth Dorellinvestor@meta.com / investor.fb.com\nPress: Ryan Moore press@meta.com / about.fb.com/news/\nView original content to download multimedia:https://www.prnewswire.com/news-releases/meta-to-announce-second-quarter-2024-results-302187204.html\nSOURCE Meta\n"
    }
]