[
    {
        "Date": "2024-07-23T20:49:28.000Z",
        "Title": "Meta unveils biggest Llama 3 AI model, touting language and math gains",
        "Author": "  Katie Paul ",
        "Text": "By Katie Paul\nNEW YORK (Reuters) -Meta Platforms released the biggest version of its mostly free Llama 3 artificial intelligence models on Tuesday, boasting multilingual skills and general performance metrics that nip at the heels of paid models from rivals like OpenAI.\nThe new Llama 3 model can converse in eight languages, write higher-quality computer code and solve more complex math problems than previous versions, the Facebook parent company said in blog posts and a research paper announcing the release.\nWith 405 billion parameters, or variables that the algorithm takes into account to generate responses to user queries, it dwarfs the previous version released last year though is still smaller than leading models offered by competitors.\nOpenAI's GPT-4 model, by contrast, is reported to have one trillion parameters and Amazon is preparing a model with 2 trillion parameters.\nPromoting Llama 3 across multiple channels, Chief Executive Mark Zuckerberg said he expected future Llama models would overtake proprietary competitors by next year. The Meta AI chatbot powered by those models was on track to become the most popular AI assistant by the end of this year, with hundreds of millions of people using it already, he said.\nThe release comes as tech companies are racing to show that their growing portfolios of resource-hungry large language models can deliver significant enough gains in known problem areas like advanced reasoning to justify the gargantuan sums that have been invested in them.\nMeta's own top AI scientist has said he believes such models will hit up against limits on reasoning and that other types of AI systems will be needed to produce breakthroughs.\nIn addition to its flagship 405 billion parameter model, Meta is also releasing updated versions of its lighter-weight 8 billion and 70 billion parameter Llama 3 models initially introduced in the spring, the company said.\nAll three new models are multilingual and can handle larger user requests via an expanded \"context window,\" which Meta's head of generative AI, Ahmad Al-Dahle, said would improve the experience of generating computer code in particular.\n\"That was the number one feedback we got from the community,\" Al-Dahle told Reuters in an interview, noting that bigger context windows give the models something akin to a longer memory that aids in processing multi-step requests.\nSeparately, Al-Dahle said his team had been able to improve the Llama 3 model's performance on tasks such as solving math problems by using AI to generate some of the data on which they were trained.\nMeta releases its Llama models largely free-of-charge for use by developers, a strategy Zuckerberg says will pay off in the form of innovative products, less dependence on would-be competitors and greater engagement on the company's core social networks. Some investors have raised their eyebrows at the costs entailed, however.\nThe company also stands to benefit if developers opt to use its free models over paid ones, which would undercut the business models of its rivals. With its announcement, Meta touted gains on key math and knowledge tests that may make that prospect more appealing.\nAlthough measuring progress on AI development is notoriously difficult, test results provided by Meta appeared to suggest that its largest Llama 3 model was nearly matching and in some cases besting Anthropic's Claude 3.5 Sonnet and OpenAI's GPT-4o, which are widely regarded as the two most powerful frontier models on the market.\nOn the MATH benchmark of competition level math word problems, for example, Meta's model posted a score of 73.8, compared to GPT-4o's 76.6 and Claude 3.5 Sonnet's 71.1.\nThe model scored 88.6 on MMLU, a benchmark that covers dozens of subjects across math, science and the humanities, while GPT-4o scored 88.7 and Claude 3.5 Sonnet scored 88.3.\nIn their paper, Meta researchers also teased upcoming \"multimodal\" versions of the models due out later this year that layer image, video and speech capabilities on top of the core Llama 3 text model.\nEarly experiments indicate those models can perform \"competitively\" with other multimodal models such as Google's Gemini 1.5 and Anthropic's Claude 3.5 Sonnet, they said.\n(Reporting by Katie Paul; Editing by Louise Heavens and Daniel Wallis)\n"
    },
    {
        "Date": "2024-07-18T16:33:10.000Z",
        "Title": "Meta Eyes Stake in Maker of Ray-Ban in Smart Glasses Push",
        "Author": "  Dinesh Nair and Daniele Lepido ",
        "Text": "(Bloomberg) -- Meta Platforms Inc. is in talks to take a minority stake in the maker of Ray-Ban sunglasses as the Facebook owner intensifies its push into smart glasses.\nMost Read from Bloomberg\nWhat Initial Polling Data Show About the Trump-Harris Matchup\nA Six-Second Decision Shows How Harris Snapped Up Delegates\nHarris Has Enough Delegates to Clinch Nomination for President\nWiz Rejects Google’s $23 Billion Offer, Seeks IPO Instead\nTrump Floated Jamie Dimon for Treasury Secretary, Then Denies It\nMeta, which has collaborated with EssilorLuxottica SA on Ray Ban-Meta smart eyewear, is considering a stake of more than 3% and as much as 5% in the luxury eyewear group, which would be valued at about €4.5 billion ($4.9 billion) at current prices, according to people familiar with the discussions, who asked not to be identified because the information is not public. There is no guarantee that an investment will take place, they said.\nA spokesperson for Meta didn’t immediately respond to a request for comment. A spokesperson for EssilorLuxottica declined to comment. The Financial Times reported the talks earlier.\nMeta has already received clearance from US antitrust authorities to buy a minority stake of as much as 5%, according to two people familiar with the deal. The US Federal Trade Commission declined to comment.\nBy taking a stake in EssilorLuxottica, the social media giant would deepen its partnership with the world’s biggest eyewear company. It would also presumably gain more influence over a business that’s key to its virtual and augmented reality efforts and strengthen its position against rivals. Snap Inc. has been experimenting with mixed-reality spectacles for years while Apple Inc. released the Vision Pro headset earlier this year.\nAs yet, consumers haven’t adopted these technologies en masse.\nEssilorLuxottica shares were up 2.3% at €194.20 at 11:11 a.m. New York time. Meta gained 1.1% to $467.27.\nThis wouldn’t be the first company that Meta has taken a stake in. Four years ago, the social-media giant announced that it would buy about 10% of Reliance Industries Ltd.’s Jio Platforms, becoming its largest minority shareholder with a $5.7 billion investment. That partnership came as Chief Executive Officer Mark Zuckerberg was working to step up his expansion in India, where online payment and e-commerce demand was exploding as more people used smartphones.\nMeta has heavily invested in the metaverse — a future version of the internet made up of immersive worlds accessible via headsets — which Zuckerberg has hailed as the next major computing revolution after mobile phones. The company changed its name from Facebook to Meta years ago to underscore the dedication to the concept.\nWhat Bloomberg Intelligence Says:\nMeta is likely doubling down on its AR and smart-glasses bet with its new new stake in EssilorLuxottica, given it doesn’t own the hardware platform as is the case with Oculus VR. We believe AR units, about 10-15x smaller than VR in terms of units shipped, could grow at a much faster rate than VR given the potential to have smart glasses as an inference device for gen-AI and virtual-assistant functionality.\n— Mandeep Singh and Nishant Chintala, Bloomberg Intelligence Senior Tech Analysts\nMeta unveiled its first Ray-Ban smart glasses in partnership with EssilorLuxottica in 2021. Those glasses were set on the Wayfarer frame to let users take photos and videos, listen to music and answer calls. Newer glasses incorporate MetaAI, an AI assistant based on its Llama artificial intelligence model.\nEssilorLuxottica on Wednesday announced an agreement to buy streetwear label Supreme from VF Corp. for $1.5 billion in cash, adding another lifestyle brand to a stable that also includes Oakley sunglasses.\n--With assistance from Shona Ghosh, Daniel Zuidijk and Antonio Vanuzzo.\n(Updates with US approval in fourth paragraph.)\nMost Read from Bloomberg Businessweek\nThe $12,000 Harvard Class Celebrities Are Fighting to Get Into\nAirbnb Hosts Want Guests to Come to Them Directly\nThe Real Reason Erewhon Is a Cult Brand\nWhy Is the US Deficit So Big? Depends on Who You Ask\nElon Musk Goes All In for Trump\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-08-01T17:19:30.000Z",
        "Title": "Meta’s next AI model to require nearly 10 times the power to train",
        "Author": "  Andrew Tarantola ",
        "Text": "Facebook parent company Meta will continue to invest heavily in its artificial intelligence research efforts, despite expecting the nascent technology to require years of work before becoming profitable, company executives explained on the company’s Q2 earnings call Wednesday.\nMeta is “planning for the compute clusters and data we’ll need for the next several years,” CEO Mark Zuckerberg said on the call. Meta will need an “amount of compute… almost 10 times more than what we used to train Llama 3,” he said, adding that Llama 4 will “be the most advanced [model] in the industry next year.” For reference, the Llama 3 model was trained on a cluster of 16,384 Nvidia H100 80GB GPUs.\nThe company is no stranger to writing checks for aspirational research and development projects. Meta’s Q2 financials show the company expects to spend $37 billion to $40 billion on capital expenditures in 2024, and executives expect a “significant” increase in that spending next year. “It’s hard to predict how this will trend multiple generations out into the future,” Zuckerberg remarked. “But at this point, I’d rather risk building capacity before it is needed rather than too late, given the long lead times for spinning up new inference projects.”\nAnd it’s not like Meta doesn’t have the money to burn. With an estimated 3.27 billion people using at least one Meta app daily, the company made just over $39 billion in revenue in Q2, a 22% increase from the previous year. Out of that, the company earned around $13.5 billion in profit, a 73% year-over-year increase.\nBut just because Meta is making a profit doesn’t mean its AI efforts are profitable. CFO Susan Li conceded that its generative AI will not generate revenue this year, and reiterated that revenue from those investments will “come in over a longer period of time.” Still, the company is “continuing to build our AI infrastructure with fungibility in mind, so that we can flex capacity where we think it will be put to best use.”\nLi also noted that the existing training clusters can be easily reworked to perform inference tasks, which are expected to constitute a majority of compute demand as the technology matures and more people begin using these models on a daily basis.\n“As we scale generative AI training capacity to advance our foundation models, we’ll continue to build our infrastructure in a way that provides us with flexibility in how we use it over time. This will allow us to direct training capacity to gen AI inference or to our core ranking and recommendation work, when we expect that doing so would be more valuable,” she said during the earnings call.\n"
    },
    {
        "Date": "2024-07-23T17:36:36.000Z",
        "Title": "Meta Unveils New AI Model That Rivals Google and OpenAI Models",
        "Author": "  Naomi Buchanan ",
        "Text": "\nMeta announced its most capable open-source artificial intelligence (AI) model called Llama 3.1 on Tuesday.\nThe company said the new open model rivals or outperforms those from Microsoft-backed OpenAI, Alphabet, and Amazon-backed Anthropic, as competition between AI model makers heats up.\nMeta CEO Mark Zuckerberg has been a vocal supporter of open-source AI models, which could help the company better compete with closed model makers.\nThe new model is available to WhatsApp and Meta AI users, as well as Meta's partner ecosystems like Amazon Web Services (AWS), Nvidia, Microsoft Azure, and Google Cloud.\n\nMeta (META) unveiled Llama 3.1, its most capable open-source artificial intelligence (AI) model yet, on Tuesday.\nThe Facebook parent said the new open model rivals or outperforms those from Microsoft-backed (MSFT) OpenAI, Alphabet (GOOGL), and Amazon-backed (AMZN) Anthropic, as competition between AI model makers heats up.\nMeta CEO Mark Zuckerberg has been vocal supporter of open AI, promoting the use of open-source tools that can help the company gain influence in the AI race with OpenAI, Google, and Anthropic, which make closed AI models.\nThe new open AI model is available to users in the U.S. on WhatsApp and meta.ai. Llama 3.1 is also available through Meta's partner ecosystems, including Amazon Web Services (AWS), Nvidia (NVDA), Microsoft Azure, Google Cloud, and others.\nMeta shares were up 1.1% at $492.80 around 1:30 p.m. ET Tuesday, contributing to the stock's nearly 40% year-to-date gain.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-07-26T14:22:43.000Z",
        "Title": "Want to get a job at Meta? It doesn’t matter what you study—as long as you can ‘do one thing really well,’ Mark Zuckerberg says",
        "Author": "  Orianna Rosa Royle ",
        "Text": "Meta CEO Mark Zuckerberg joins a growing number of executives suggesting that a specific field of study is less critical for employment in today’s competitive job market.\nWhat matters most, he says, is being able to \"do one thing really well.\"\nWhen asked by Bloomberg's Emily Chang, “What should kids be studying these days?” Zuckerberg emphasized the importance of critical thinking and learning values.\nRather than pinpointing a particular subject for aspiring Gen Z professionals, the billionaire Harvard dropout stressed that mastering a skill outweighs having a business or economics degree, as such tenacity can be applied across various business areas.\nZuckerberg explained his \"hiring philosophy\" by pointing to his daughter, who is 40 pages deep into writing a novel about mermaid crystals.\n“If people have shown that they can go deep and do one thing really well, then they've probably gained experience in the art of learning something and taking it to an excellent level, which is generally pretty applicable to other things,” he concluded.\nIt’s not the first time the Meta mastermind has insisted that raw talent and personality trump credentials.\nZuckerberg was well ahead of today’s skills-first hiring revolution—even back in 2015, the tech genius was insisting that he “will only hire someone to work directly for me if I would work for that person” and that his team looks for people whose values align with the company's.\nNow, as businesses increasingly drop degree requirements from their hiring process, Zuckerberg’s hiring philosophy is more common.\nGoogle, Microsoft, IBM, and Apple have all eliminated their long-held degree requirements to remove barriers to entry and recruit more diverse talent. Meanwhile, recruiters globally are five times more likely to search for new hires by skills over higher education.\nJPMorgan’s CEO Jamie Dimon recently revealed that the Wall Street giant has hired “four or five thousand ex-felons” because talent doesn’t just come out of colleges.\n“I don’t think necessarily because you go to an Ivy League school or have great grades it means you’re going to be a great worker, great person or something like that,” he said. “If you look at skills of people it is amazing how skilled people are in something, but it didn’t show up on their resume.\nLikewise, Apple’s CEO Tim Cook has echoed that there is a “mismatch between the skills that are coming out of colleges and what the skills are that we believe we need in the future.”\nIt’s why he said that aspiring coders, in particular, don’t need a degree to be successful at the American Workforce Policy Advisory Board meeting.\nCisco’s top executive in the U.K., David Meads, dropped out of school at 16 years old. Like Zuckerberg, he told Fortune that “attitude and aptitude are more important than whatever letters you have after your name, or whatever qualifications you’ve got on a sheet.”\nThis story was originally featured on Fortune.com\n"
    }
]