[
    {
        "Date": "2024-08-12T16:03:00.000Z",
        "Title": "Is META the Best Stock to Buy Among Magnificent 7 Right Now?",
        "Author": "  Aniruddha Ganguly ",
        "Text": "Meta Platforms META is one of the most prolific users of AI, leveraging it to improve the potency of its platform offerings, including WhatsApp, Instagram, Messenger and Facebook. These services currently reach more than 3.2 billion people daily.Its staggering reach and increasing ad impressions (up 10% year over year in second-quarter 2024) make META one of the most important players in the digital ad sales market apart from Google and YouTube parent Alphabet GOOGL, its peer in the “Magnificent 7.” The group also includes Microsoft, NVIDIA NVDA, Amazon, Apple and Tesla TSLA.META’s growing proficiency with AI usage helped it to report terrific second-quarter results, with both earnings and revenues beating the Zacks Consensus Estimate comfortably. User growth remained solid in the United States, with WhatsApp reaching more than 100 million monthly users and Thread approaching 200 million milestone. It witnessed good year-over-year growth across Facebook, Instagram and Threads.META’s advertising revenues (99% of Family of Apps revenues) increased 21.7% year over year to $38.33 billion and accounted for 97.9% of second-quarter revenues. At constant currency, revenues increased 23% year over year.\nMeta Platforms has outperformed its Magnificent 7 peers in the past month. In fact, it is the only stock that has recorded positive return during the period, while the rest of the six declined, with Tesla dropping more than 20% and NVIDIA losing over 18%. META’s closest peer, GOOGL, lost 12.3%.\nImage Source: Zacks Investment Research\nYear-to-date, META shares have gained 46.3%, outperforming the Zacks Computer & Technology sector’s return of 14.1%. Except for NVIDIA, it has outperformed the rest of Magnificent 7 over the same time frame.\nImage Source: Zacks Investment Research\nMeta Platforms has been leveraging AI and machine learning to boost the potency of its social-media offerings, including WhatsApp, Instagram, Facebook and Threads. It has been improving the quality of recommendations to drive engagement. Meta Platforms is leveraging AI to boost Facebook’s appeal among young adults (18–29-year-olds), a demography that used to prefer Alphabet’s YouTube and Snapchat. Moreover, it rolled out a full-screen video player and unified video recommendation service across Facebook, extending its unified AI systems, thereby increasing engagement on Facebook Reels.META is incorporating AI tools into WhatsApp to make businesses more customer-oriented. The rapid adoption of Generative AI (GenAI) is transforming conversational messaging platforms like WhatsApp to perform conversational commerce, including transactions like ride-hailing and grocery purchases. It has started rolling out Meta AI and is on track to achieve its goal of becoming the most used AI assistant by the end of the year. Meta AI is currently available in more than 20 countries and eight languages. In the United States, Meta Platforms is rolling out new features like Imagine edit, which allows people to edit images they generate with Meta AI.The launch of the AI studio is an interesting addition to META’s expanding AI features. AI studio helps creators create AIs to interact within apps across the company’s service offerings.META’s Llama family of foundation models has been a game changer. The latest Llama 3.1 includes the first frontier-level open-source model, as well as new and industry-leading small and medium-sized models. It is already working on Llama 4, which is expected to boost META’s capability in the long run.\nThe Zacks Consensus Estimate for 2024 earnings is pegged at $21.23 per share, up 3.3% over the past 30 days, indicating a 42.77% year-over-year increase.The consensus mark for third-quarter 2024 earnings is pegged at $5.12 per share, up 5.3% over the past 30 days, indicating a 16.63% year-over-year increase.\nMeta Platforms, Inc. price-consensus-chart | Meta Platforms, Inc. Quote\nMeta Platforms expects total revenues between $38.5 billion and $41 billion for the third quarter of 2024, assuming an unfavorable forex impact of 2% to year-over-year revenue growth.The Zacks Consensus Estimate for third-quarter 2024 revenues is currently pegged at $40.08 billion, suggesting 17.39% year-over-year growth.\nHowever, META stock is not so cheap, as the Value Style Score of D suggests a stretched valuation at this moment.In terms of the forward 12-month Price/Sales ratio, META is trading at 7.48X, higher than its median of 6.57X and the Zacks Computer & Technology sector’s 6.36X.\nImage Source: Zacks Investment Research\nAlthough higher investments in AI infrastructure development and increasing losses in the reality labs business are risks, Meta Platforms’ AI focus bodes well for its long-term prospects. META’s growing footprint among young adults driven by improving recommendations boosts competitive prowess. AI usage is making it a popular name among advertisers that is expected to drive top-line growth.META currently has a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-08-28T16:07:22.000Z",
        "Title": "Meta faces $3.6 million fine in Brazil for allowing bogus Havan ads",
        "Author": "  Victor Pinheiro ",
        "Text": "By Victor Pinheiro\nSÃO PAULO - Meta Platforms faces a fine of up to $3.62 million after losing a lawsuit by Brazilian department store chain Havan that accused the social media company of accepting paid advertisements that fraudulently use the retailer's name to deceive consumers.\nA Santa Catarina state judge ruled on Monday that Meta had 48 hours to block ads that Havan did not contract and which mention it or its owner, billionaire Luciano Hang. If Meta does not comply, fines can go up to 20 million reais.\nIn her ruling, Judge Joana Ribeiro said it was unacceptable for Meta to sell ads in an insecure way to sustain its business model.\nIn a statement on Monday, Havan called the decision \"a landmark\" in protecting the company's and Hang's rights.\nMeta declined to comment. The company can appeal the decision.\nIn the lawsuit, Havan said Meta profits from illicit ads without taking responsibility or verifying their legitimacy, leading fraud victims to sue the retailer.\nEarlier this year, Reuters' fact-checking service in Brazil verified three false Havan ads on Meta platforms that used Hang's image. All showed signs of artificial intelligence being used to imitate the businessman's voice.\nThe fraudulent ads led victims to pay for nonexistent products.\n($1 = 5.5209 reais)\n(Writing by Bernardo Barbosa; Editing by Richard Chang)\n"
    },
    {
        "Date": "2024-08-01T19:49:24.000Z",
        "Title": "Meta's Early AI Strength Leads Bullish Analysts to Lift Stock Price Targets",
        "Author": "  Naomi Buchanan ",
        "Text": "\nMeta Platforms shares gained on Thursday as analysts lifted their price targets for the stock after the company's better-than-expected second-quarter earnings report.\nUBS analysts said that the strong results eased uncertainty around the stock and provided clarity about Meta's artificial intelligence plans.\nBank of America Securities analysts said that the early gains from AI are promising signals that Meta's AI investments will pay off for the company.\n\nMeta Platforms (META) shares rose Thursday after analysts lifted their price targets for the stock, citing positive signals surrounding the tech giant's artificial intelligence (AI) opportunity.\nAnalysts said the company's better-than-expected second-quarter results released Wednesday and the early AI gains, eased concerns about Meta's increased spending to invest in the technology.\nMeta shares were up 4.5% at $496.05 in recent trading, contributing to the stock's nearly 40% year-to-date gain.\nTradingView\nUBS analysts said \"the most important development\" from Meta's earnings call was that it eased lingering uncertainty about the stock after AI spending worried investors after the company's previous quarterly report.\nThe analysts said that the company's third-quarter outlook indicates that Meta expects a strong second half of the year. They also said that CEO Mark Zuckerberg's remarks gave investors more clarity on the company's expectations for AI spending and monetization.\nUBS on Thursday lifted its Meta price target to $635 from $630.\nMeta told investors that its AI tech is improving its recommendation engines, offering early indicators that its significant capital expenditures (CapEx) in that direction are benefiting the company.\nThe company lifted the lower end of its outlook for full-year spending to $37 billion from $35 billion and said increased CapEx is expected in the next year.\nBank of America Securities analysts said that Meta's \"solid quarter and outlook suggest durable AI advantages.\"\nBofA, which calls Meta the \"top AI play in consumer Internet,\" raised its price target on the stock to $563 from $550.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-08-31T15:52:38.000Z",
        "Title": "Meta Platforms, Inc. (META): This AI Stock Is Trending Right Now",
        "Author": "  Usman Kabir ",
        "Text": "We recently compiled a list of the 18 Trending AI Stocks on Latest Analyst Ratings and News. In this article, we are going to take a look at where Meta Platforms, Inc. (META) stands against the other trending AI stocks.\nGrowth investors have been piling into artificial intelligence (AI) stocks over the past few months as a variety of factors, including rapid technological advancements, soaring investment, and widespread adoption across sectors drive interest towards the AI business. Some important metrics illustrate this phenomenon. The global AI market was valued at approximately $142.3 billion in 2023 and is projected to grow at a compound annual growth rate of over 36%, reaching nearly $2 trillion by 2030. In 2024 alone, the AI market is expected to expand by around 40%, a pace that far outstrips the broader technology sector and the overall global economy, which is predicted to grow at a more modest 2.7%.\nRead more about these developments by accessing 33 Most Important AI Companies You Should Pay Attention To and 20 Industrial Stocks Already Riding the AI Wave.\nThis explosive growth is driven by the increasing integration of AI technologies across various industries, including healthcare, finance, retail, and manufacturing. Investment in AI is surging, with companies recognizing its potential to revolutionize business operations and deliver significant returns. According to PwC, AI could contribute up to $15.7 trillion to the global economy by 2030, with North America and China accounting for nearly 70% of this value. In 2024, corporate investment in AI is expected to surpass $500 billion, driven by companies seeking to enhance efficiency, reduce costs, and innovate their product offerings.\nIndustry experts are increasingly bullish on the long-term prospects for AI stocks. According to a survey by Gartner, 80% of executives believe that AI will be a critical business driver by 2025, with 75% already piloting or implementing AI solutions. McKinsey estimates that AI could deliver up to $6.1 trillion in annual value across industries, primarily through automation and optimization. This growing confidence in AI capabilities is reflected in the stock market, where AI-focused companies have consistently outperformed their peers. For instance, AI-driven companies have seen their stock prices surge by over 50% in 2023 alone, a trend expected to continue as demand for AI solutions grows.\nRead more about these developments by accessing Billionaire Stan Druckenmiller Is Betting On AI Infrastructure, Tobacco and Industrial Stocks and 10 Tech Stocks to Monitor Amid Market Volatility According to Bernstein Analyst.\nThese AI-focused firms are also investing in AI startups as they seek to diversify their businesses. NVIDIA, Apple, and Microsoft are all reportedly considering a huge investment in OpenAI, a California-based AI firms whose claim to fame is the launch of ChatGPT back in late 2022. If the rumors are true, the latest round of funding would take the valuation of the startup to $100 billion. For some additional context, this value is higher than the combined GDPs of 110 nations, the highest for any venture capital backed firm in the US since Facebook's IPO, and the most valuable private firm in the US after Musk-owned SpaceX.\nThis high valuation also follows an emerging trend in the startup universe. Research into the domain by Coatue Management reveals that up until June 2024 year-to-date, there were a total of 200 AI-related deals in the venture capital world, compared to just 7,000 for non-AI firms. The average valuation in these deals for AI startups was around $1 billion. On the non-AI side, this value was only $200 million. The average funding round for AI firms fetched over $120 million, while this figure for non-AI companies was around $20 million. The numbers highlight that AI firms, on average, are valued at five times more than their non-AI peers and raise six times more in funding.\nOur Methodology\nFor this article, we selected AI stocks based on the latest news and analyst ratings. These stocks are also popular among hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA team of developers working in unison to create the company's messaging application.\nNumber of Hedge Fund Holders: 219\nMeta Platforms, Inc. (NASDAQ:META) engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. The company has taken a somewhat different approach to AI than the other tech giants. While the large language models (LLMs) of other AI firms are closed, Meta has decided to open source Llama, the LLM it has developed over the past few years. Companies and businesses can develop their own AI supermodels, tailored to their specific needs, around Llama.\nThis Meta Platforms, Inc. (NASDAQ:META) strategy is already starting to bear fruit. Major companies have already started making their own AI models with Llama as a base. For example, professional services firm Accenture utilized Llama 3.1 to build a custom large language model to produce an annual ESG report. Telecom firm AT&T is using Llama and generative AI for customer service.\nOverall META ranks 4th on our list of the trending AI stocks. While we acknowledge the potential of META as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-08-01T09:49:00.000Z",
        "Title": "Meta’s Ad Strength Gives Its AI Spending Some Cover",
        "Author": "  Dan Gallagher ",
        "Text": "Meta Platforms is hardly the only big tech company with no plans to put the brakes on its blowout artificial-intelligence spending. It might be the only one where that news was already priced in.\nThe parent company of Facebook and Instagram used its second-quarter report on Wednesday to announce plans to make between $37 billion and $40 billion in capital expenditures this year. That is up from the prior range of $35 billion to $40 billion that the company gave three months ago—essentially a 3% raise at the midpoint.\nIntel to Cut Jobs and Suspend Dividend in Cost-Saving Push\nAmazon Shares Slide as Spending Surges and Revenue Outlook Disappoints\nApple’s iPhone Sales Slide, but Investors Still Expect AI Rally\nAfter Years of Raising Prices, Food Companies Hit Consumers’ Limits\nWeak Economic Data Prompts Stock Selloff\nEither one is a tidy sum given Meta’s size—at least relative to its other megacap tech peers. An outlay of $37 billion would represent 23% of what Wall Street projects for Meta’s total revenue this year. Amazon.com, Microsoft and Google parent Alphabet are projected to devote between 10% and 20% of their revenue to capex over the same period, according to consensus estimates from FactSet. And for good measure, Meta also said Wednesday that it expects “significant capital expenditures growth” in 2025. Three months ago the company simply said capex “will continue to increase” in the next year.\nIt was basically the same message on that front that Microsoft and Google broadcast in their recent reports. But Meta’s stock jumped more than 7% in after-hours trading following its Wednesday afternoon release, compared with respective drops of 1% and 5% for Microsoft and Alphabet following their results. Meta’s revenue beat Wall Street’s consensus estimate by a slightly wider margin than those other two. It also helps that the stock had already experienced sticker shock from AI spending plans broadcast in the last earnings season. Meta is the only one of the six trillion-dollar tech megacaps to have seen its shares lose ground between its March quarter report and the latest one.\nMeta’s turbulent record over the past few years shows that its investors are willing to roll with expensive ambitions as long as the core business holds up and other costs are held down. That is proving to be the case now. Advertising revenue grew 22% year over year to $38.3 billion, which was $3 billion higher than what Wall Street expected. Operating income of $14.8 billion also beat analysts’ estimates, despite a loss of nearly $4.5 billion in the Reality Labs division that houses the company’s VR and metaverse efforts.\nThe company is also keeping to the lessons of its “year of efficiency.” Head count grew by 1,470 in the June period, but remains 19% below the company’s peak in late 2022. Revenue per employee is up 51% from that time.\nStill, investors are getting antsier about the expensive race to build generative-AI services. It is a boon for Nvidia: The AI chip star’s stock jumped more than 3% in after-hours trading Wednesday following Meta’s results after surging nearly 13% in the regular session following Microsoft’s report. Capex questions from analysts dominated both earnings calls, and Meta Chief Executive Officer Mark Zuckerberg maintained his previously stated view that Meta’s direct payoff from genAI services isn’t close at hand. “I don’t think that anyone should be surprised that I would expect that that will be years,” he said on Wednesday’s call.\nYears are something the 40-year-old centibillionaire has. And years it might take, given the still tight supply of Nvidia’s most powerful chips. Zuckerberg showed up on stage with Nvidia CEO Jensen Huang at a conference on Monday, with the two joking about the 600,000 GPU chips Meta has already bought from the company.\nHuang is laughing all the way to the bank now. Zuckerberg eventually needs to ensure that his company’s AI spending doesn’t become a punchline.\nWrite to Dan Gallagher at dan.gallagher@wsj.com\nDon Lemon Sues Elon Musk and X for Canceling Partnership Deal\nVenu Sports Streaming Service to Cost $42.99 a Month\nNike Paid Him to Make Gold-Dipped Sneakers for LeBron. Now, It Is Suing Him.\nSeptember Rate Cut Would Thrust Fed Into Brutal Election Campaign\nSpirit Airlines Trims Workforce as Quarterly Loss Widens\n"
    }
]