[
    {
        "Date": "2024-10-01T13:34:16.000Z",
        "Title": "Meta, Alphabet initiated: Wall Street's top analyst calls",
        "Author": "The Fly ",
        "Text": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\nTop 5 Upgrades: \nMoffettNathanson upgraded Roku (ROKU) to Neutral from Sell with an $80 price target. The firm has advised clients to sell Roku's stock over much of the past three years due to a strong conviction that consensus was mismodeling the drivers of Platform revenues, compounded by \"incredibly poor financial disclosure,\" but it has softened its view as it looks into the second half of 2024 and 2025.\nDA Davidson upgraded Datadog (DDOG) to Buy from Neutral with a price target of $140, up from $115. The firm's proprietary developer data showed a strong positive inflection point for Datadog, which gives the firm confidence in the trajectory of demand.\nWedbush upgraded Dine Brands (DIN) to Outperform from Neutral with a price target of $47, up from $34. The firm believes the company's current sales challenges are well understood and reflected in the stock's \"depressed valuation.\"\nSusquehanna upgraded Coherent (COHR) to Positive from Neutral with a price target of $120, up from $80. The firm believes new CEO Jim Anderson, and his platform optimization program, will \"ultimately transform the company's long-term financial model,\" potentially providing the company with over 1,000 basis points of net margin expansion.\nGoldman Sachs upgraded Ford (F) to Buy from Neutral with a price target of $13, up from $12. There is a margin opportunity driven by the company's more profitable commercial business - Ford Pro, with mid-teens EBIT margins - and growing software and services mix, and the management's cost actions in internal combustion vehicles and EVs can help to offset industry headwinds, the firm tells investors in a research note.\nTop 5 Downgrades:\nRaymond James downgraded Disney (DIS) to Market Perform from Outperform. The firm sees demand moderating at the company's amusement parks after a strong post-COVID surge and says the shares are expected to remain range bound as it contends that consumers are still digesting price increases taken in the past roughly four years.\nWells Fargo downgraded General Dynamics (GD) to Equal Weight from Overweight with a price target of $317, down from $334, as the firm is cautious on the company and Boeing (BA) into the Q3 results. General Dynamics' 2024 guidance looked tough to hit at mid-year, and since then G700 deliveries appear to be well behind plan, Wells tells investors in a research note.\nCiti downgraded Hologic (HOLX) to Neutral from Buy with a price target of $85, down from $95. The firm believes current fiscal 2025 estimates are too high and will likely need to be lowered, driven by normalization of demand.\nCiti downgraded HP Inc. (HPQ) to Neutral from Buy with an unchanged price target of $37. The firm cites a more cautious view of the PC recovery in the second half of 2024 for the downgrade.\nOppenheimer downgraded Global Payments (GPN) to Perform from Outperform following analyst coverage transfer. Despite the recent stock pullback, the firm remains cautious on Global Payments, particularly as the acquiring industry remains \"intensely competitive.\"\nTop 5 Initiations: \nPivotal Research initiated coverage of Meta Platforms (META) with a Buy rating and $780 price target. The firm sees a \"strong\" revenue growth outlook from increased usage, new products, better targeting and higher prices, boosted by cost efficiencies and eventually materially declining Reality Labs losses combined \"with what appears to be an attractive valuation.\"\nPivotal Research initiated coverage of Alphabet (GOOG) with a Buy rating and $215 price target. If \"the status quo holds,\" Alphabet appears to be in a \"very strong competitive position with a deep moat\" around its dominant core search business model and an \"obvious path\" to leverage its global device presence, strong artificial intelligence platform and \"financial might\" to increase financial incentives to handset manufacturers for default AI placement, the firm tells investors in a research note.\nOppenheimer initiated coverage of SharkNinja (SN) with an Outperform rating and $120 price target. The firm notes the company's management team has executed quite well delivering consistent and well above expectation results in recent quarters, even in difficult U.S. consumer durables backdrop.\nPiper Sandler initiated coverage of Labcorp (LH) with a Neutral rating and $235 price target. The firm sees LabCorp as leading the industry in diagnostics services for decades, but with the stock's run over the last six months, Piper thinks the risk/reward is balanced at these levels.\nArgus initiated coverage of Snowflake (SNOW) with a Hold rating. The company is in a building phase as it invests in new product enhancements, particularly around AI/machine learning which are not generating near-term revenue, even though they may begin to payoff sometime in the future, the firm tells investors in a research note.\n"
    },
    {
        "Date": "2024-09-24T20:52:09.000Z",
        "Title": "Meta will not immediately join EU's AI Pact ahead of new law",
        "Author": "Reuters ",
        "Text": "(Reuters) - Meta Platforms will not immediately join the European Union's AI Pact, a company spokesperson said on Tuesday.\nThe pact is a temporary measure before the bloc's AI Act comes into full effect.\nEU lawmakers in May agreed to the act, the first-of-a-kind rules governing the development and deployment of artificial intelligence.\nThe AI Act entails that companies will be obliged to provide detailed summaries of the data used to train their artificial intelligence models.\nLast month, the European Commission said the majority of rules of the act will start applying on Aug. 2, 2026.\nUntil the law kicks in, companies are encouraged to sign up to a voluntary AI Pact to implement key obligations of the rules.\n\"We welcome harmonised EU rules and are focusing on our compliance work under the AI Act at this time,\" the Meta spokesperson said, adding that the Facebook parent could join the AI Pact at a later stage.\nThe AI Act is the fifth pillar of EU legislation and would work in conjunction with the Digital Markets Act, Digital Services Act, Data Governance Act, and Data Act.\n(Reporting by Harshita Mary Varghese in Bengaluru; Editing by Shounak Dasgupta)\n"
    },
    {
        "Date": "2024-09-18T10:33:01.000Z",
        "Title": "Meta closes deal to buy up to 3.9 million carbon credits in Latin America",
        "Author": "Reuters ",
        "Text": "SAO PAULO (Reuters) - Facebook owner Meta agreed to buy up to 3.9 million carbon offset credits from Brazilian investment bank BTG Pactual's forestry arm through 2038, the companies said on Wednesday in a statement.\nThey did not disclose the value of the deal. The average price for forestry carbon offsets last week was $4.22 per credit, according to data provider Allied Offsets. That could value the deal at up to $16 million based on that pricing.\nCarbon offsets allow companies to offset greenhouse gas emissions by paying for actions to cut emissions elsewhere to meet corporate climate goals. Each credit represents a reduction of one metric ton of carbon dioxide emissions.\nUnder the long-term contract signed by Meta and BTG Pactual Timberland Investment Group (TIG), the owner of Facebook and Instagram agreed to buy 1.3 million carbon credits, with options to purchase an additional 2.6 million credits.\nMeta said the deal is its largest carbon removal transaction from a single project and is part of its commitment to reach net zero emissions across its value chain in 2030.\nThe credits were generated by BTG Pactual TIG's forest restoration projects in Latin America, where it has planted more than 7 million seedlings, according to the statement.\nIn June, TIG announced the sale of 8 million carbon credits to Microsoft in the largest-ever transaction of such credits worldwide.\nThe deals from Microsoft and Meta come even though demand for offsets broadly stalled last year.\nCompanies including food giant Nestle and fashion house Gucci have reduced their buying of credits amid widespread doubts that they served to reduce emissions.\n(Reporting by Andre Romani; Editing by Tom Hogue)\n"
    },
    {
        "Date": "2024-09-18T14:12:01.000Z",
        "Title": "Facebook parent Meta Platforms beats lawsuit over Apple privacy, Sandberg disclosures",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\n(Reuters) - Meta Platforms won the dismissal of a lawsuit claiming it defrauded shareholders by concealing how changes to Apple's privacy settings would make Facebook and Instagram less desirable for advertisers.\nIn a decision on Tuesday, U.S. District Judge Yvonne Gonzalez Rogers also rejected claims that Meta concealed former Chief Operating Officer Sheryl Sandberg's use of company resources on personal matters, including her wedding and her best-selling book \"Lean In.\"\nThe Oakland, California-based judge also turned aside claims that Meta knew its transition to Reels, which copied TikTok's short-form video format, would hurt revenue because it offered fewer ads per hour than older formats.\nShareholders led by four Israeli insurers and pension funds challenged 17 allegedly false and misleading statements that Meta made in 2021 and 2022.\nThey said Meta's stock price fell 53% in less than a year as the truth came out, wiping out well over $500 billion of the Menlo Park, California-based company's market value.\nBut in her 34-page decision, Rogers said Meta's eventual admission that Apple's iOS privacy changes could pose a $10 billion \"headwind\" in 2022 did not demonstrate that its earlier disclosures were false.\nShe also said the claims about Sandberg came \"entirely from press reports\" and were unproven, and found no proof that the transition to Reels hurt Meta's financial performance.\n\"The court determines plaintiffs have not plausibly alleged violations of federal securities law,\" Rogers wrote.\nShe dismissed the lawsuit with prejudice, meaning it cannot be brought again.\nOther defendants included Sandberg, Chief Executive Mark Zuckerberg, Chief Financial Officer Susan Li and her predecessor David Wehner.\nLawyers for the plaintiffs did not immediately respond to requests for comment on Wednesday. Meta had no immediate comment.\nThe case, which has a different named plaintiff, is Plumbers and Steamfitters Local 60 Pension Trust v Meta Platforms Inc et al, U.S. District Court, Northern District of California, No. 22-01470.\n(Reporting by Jonathan Stempel in New York; editing by Jonathan Oatis)\n"
    },
    {
        "Date": "2024-09-12T17:53:04.000Z",
        "Title": "Australian lawmakers force Meta to admit only regulation will force it to offer AI training opt-out",
        "Author": "  Sage Lazzaro ",
        "Text": "Hello and welcome to Eye on AI. In today’s edition…Meta admits only regulation will stop it from scraping user data to train its AI products; AI models get more multimodal (and more emotional); big tech splurges big on AI equipment. \nDuring a government inquiry earlier this week in Australia, Meta's global privacy director Melinda Claybaugh admitted that the company scraped the public photos and posts of every Australian adult user to train its AI models without providing an option to opt out—because it can. More specifically, because regulators haven’t stopped it from doing so.\nAccording to the Australian Broadcasting Company, Claybaugh initially denied the scraping of user data for AI models, explicitly stating “we have not done that” when a senator asked whether Meta used posts from Australian users going back as far back as 2007 to train its AI products. After being pressed, she said that yes, in fact, the company has done that.\n\"The truth of the matter is that unless you have consciously set those posts to private since 2007, Meta has just decided that you will scrape all of the photos and all of the texts from every public post on Instagram or Facebook since 2007, unless there was a conscious decision to set them on private. That's the reality, isn't it?” another senator asked.\n\"Correct,” replied Claybaugh.\nClaybaugh went on to make clear that the company has not scraped data from users under 18, but she could not answer about the fate of posts from users who are now adults but opened their accounts when they were under 18. She also said that public photos of children posted by adults would have been scrapped. Additionally, she said that a user setting their account to private to prevent future scraping would not allow them to regain privacy over what’s already been used.\nOne could argue that these posts are public and open for the taking, but there’s a world of difference between allowing a profile to be public so users can interact with you and giving a trillion-dollar company unfettered permission to take your content and use it to build commercial AI products as it wishes. Yes, Meta may have legally gotten permission by putting its right to do so in its terms and conditions, but that is not anything near explicit or real consent. Overall, it’s a bleak picture of user privacy.\nMeta having questionable data practices is not exactly new—and it’s already been known that the company is training its models on user data. What struck me as interesting about this, however, was the part of the conversation that unfolded about why Australians were not offered an option to opt out.\nAfter being questioned about why Australian users don’t have the option to opt out as users in the EU do, Claybaugh cited the Union’s strict data laws.\n\"In Europe there is an ongoing legal question around what is the interpretation of existing privacy law with respect to AI training. We have paused launching our AI products in Europe while there is a lack of certainty. So you are correct that we are offering an opt-out to users in Europe. I will say that the ongoing conversation in Europe is the direct result of the existing regulatory landscape,” she said, referring to the European Union’s General Data Protection Regulation (GDPR). That law has created obstacles for Meta’s plans to train on EU user data and also caused the company in June to announce it was pausing plans to roll out its AI models to EU users.\nBasically, Claybaugh admitted that Meta will only take a privacy-first approach if regulators force its hand. In response to a request for comment about not offering an opt-out option in all jurisdictions, a Meta spokesperson further made clear that users are at the whim of their local regulators. “While we don’t currently have an opt-out feature, we’ve built in-platform tools that allow people to delete their personal information from chats with Meta AI across our apps. Depending on where people live, they can also object to the use of their personal information being used to build and train AI consistent with local privacy laws,” the spokesperson told Eye on AI.\nMany would argue that the entire discussion is misguided and that the process should be entirely opt-in. And, overall, the saga highlights the importance of both data privacy and AI regulations.\nCritics of regulating AI often argue that doing so would inadvertently hurt smaller AI startups, handing dominance to the big tech players. But those big tech players already dominate–and they use their access to massive amounts of user data to continue to advance their position. Regulation around data privacy might actually give smaller companies a fighting chance, especially if they found a less ethically challenged way to collect data.\nWhat’s more, Meta’s comments underline the urgent role regulators have in protecting consumers amid AI’s rapid proliferation.\nAnd with that, here’s more AI news.\nSage Lazzarosage.lazzaro@consultant.fortune.comsagelazzaro.com\nThis story was originally featured on Fortune.com\n"
    }
]