[
    {
        "Date": "2024-10-14T18:21:39.000Z",
        "Title": "Apple Intelligence features can also summarize breakup texts for you",
        "Author": "  Romain Dillet ",
        "Text": "When Nick S. installed the beta of iOS 18.1 to try out upcoming Apple Intelligence features, he probably didn’t expect to receive an AI-generated summary of breakup texts from his then girlfriend.\n\"No longer in a relationship; wants belongings from the apartment,\" the AI summarized. After sharing a screenshot of the unfortunate message on X, Ars Technica contacted Nick S. to confirm its authenticity — check out its story for more on the digital breakup.\nMany Apple Intelligence features have been designed to improve productivity and filter out signal from noise. For instance, text summaries can be useful in a group conversation with 68 unread messages.\nHowever, just as you wouldn’t want to see birthday notifications for deceased family members on Facebook, no one needs a machine-generated breakdown of a breakup. Let’s hope Apple makes some adjustments to the summary feature to improve Apple Intelligence's emotional intelligence.\nThis article originally appeared on TechCrunch at https://techcrunch.com/2024/10/11/apple-intelligence-features-can-also-summarize-breakup-texts-for-you/\n"
    },
    {
        "Date": "2024-10-11T19:12:17.000Z",
        "Title": "Apple Launches Largest Overseas R&D Lab in Shenzhen Amid Growing Competition from Huawei",
        "Author": "  Muslim Farooque ",
        "Text": "SHENZHEN, China, Oct. 11, 2024 iPhone-maker Apple (AAPL,Financial) just opened its largest research laboratory outside the U.S. at the Shenzhen Park in Hetao, according to a South China Morning Post report. The facility thats operational since Thursday, spans a whopping 20,000 square meters will be a focal area for Apples research and development hub in the Greater Bay Area, covering Guangdong, Hong Kong, and Macao.\nWarning! GuruFocus has detected 6 Warning Sign with TSLA.\nMoreover, it is expected that the new lab will significantly boost Apples research and testing capabilities for key products, such as its flagship iPhone, iPad, and Vision Pro mixed-reality headsets. Additionally, the facility aims to potentially employ upwards of 1,000 domestic and international experts, solidifying its place as Apple's most extensive R&D center outside the U.S.\nAdditionally, Apple's expansion comes at a point where there is heightened competition in the Chinese region, with domestic smartphone makers such as Huawei continuing to gain ground over the Cupertino giant. Moreover, a few months ago in March, Apple revealed it had built research centers in Beijing, Shanghai, Suzhou, and Shenzhen, doubling its development team over the past five years.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-10-01T14:00:00.000Z",
        "Title": "Sinclair’s NewsON Collaborates with Mindgrub to Redefine Local News Experience with Apple Vision Pro App",
        "Author": "Business Wire ",
        "Text": "Sinclair’s First Spatial Computing App for Local News, Built by Mindgrub, Now Available to Vision Pro Users\nBALTIMORE, October 01, 2024--(BUSINESS WIRE)--Sinclair’s NewsON, a leading provider of live and on-demand local news content and Mindgrub, a prominent digital innovation agency, today announced a landmark collaboration. Together, they are pioneering the future of spatial computing in news media consumption by launching an Apple Vision Pro app for NewsON. This marks Sinclair’s first foray into spatial computing specifically for local news delivery, blending digital content with physical surroundings.\nLeveraging Apple's cutting-edge Vision Pro technology, NewsON and Mindgrub are transforming the way audiences watch and interact with local news with Sinclair’s first spatial computing app built natively for Vision Pro devices.\nThe NewsON app for Vision Pro introduces a unique \"Newsroom immersion\" feature, leveraging spatial aspects of the Vision Pro for displaying interactive news maps and a complete immersive environment.\nNewsON's Vision Pro app features partnerships with over 280 local TV stations in TV markets covering more than 90% of U.S. households and provides access to on-demand newscasts and short form story clips from local TV stations nationwide.\nPowered by RealityKit and SwiftUI, NewsON’s Vision Pro app also offers photorealistic 3D renderings and intuitive user experiences.\n\"We’re always looking to embrace new outlets and ways of presenting local TV news and we’re excited to work with the team at Mindgrub to explore the possibilities of augmented reality in our new Vision Pro app. This is much more than just a repurposed mobile app. We’ve developed a native visionOS user experience and are excited to see how news audiences engage with this new form factor,\" said Ron Stitt, VP and General Manager, NewsON.\n\"The possibilities with Apple Vision Pro are limitless, and we are thrilled to be at the forefront of exploring its potential. This collaboration with NewsON really highlights our commitment to innovation and pushing the boundaries of digital media,\" said Mindgrub Founder & CEO Todd Marks.\nLauren Herda, Interactive Art Director at Mindgrub, highlights the app's geospatial features, noting: \"One of the major benefits of this app is that if something big is happening, you can find the station on our interactive map, and easily go directly to where news is happening,\" said Lauren Herda, Interactive Art Director at Mindgrub, highlighting the app's geospatial features.\nBy combining Mindgrub's transformative technology solutions with NewsON's extensive network of local news providers, this collaboration sets a new benchmark for immersive, accessible, and engaging news consumption in the era of spatial computing.\nAbout NewsON\nNewsON is a leading provider of live and on-demand local news content, dedicated to delivering timely and relevant news coverage to audiences across the United States. With a network of over 280 local TV station partners covering 90% of U.S. TV markets, NewsON offers a comprehensive platform for accessing local news anytime, anywhere. Available on iOS, Android, Apple TV, Roku, Amazon, and other platforms, NewsON's user-friendly app provides viewers with access to a diverse range of news content, including live newscasts and on-demand video clips. For more information, visit www.newson.us.\nAbout Mindgrub\nMindgrub Technologies is an award-winning digital agency whose mission is to create technology that people love to use—technology that makes lives better, jobs easier, and helps businesses thrive. Since 2002, Mindgrub has led digital transformations for global leaders including Exelon, NASA, and Wendy’s, and has been featured in Newsweek, CNN, and The Huffington Post. For more information about Mindgrub's work in AR/VR, visit mindgrub.com/what-we-do/services/ar-vr/\nFor more information about how Mindgrub can help your brand, connect with their experts at mindgrub.com/contact.\nCategory: General\nView source version on businesswire.com: https://www.businesswire.com/news/home/20241001520346/en/\nContacts\nSinclair – Jessica Bellucci jbellucci-c@sbgtv.com Mindgrub - Branddy Spence bspence@mindgrub.com\n"
    },
    {
        "Date": "2024-10-11T14:25:48.000Z",
        "Title": "Analysts Note an ‘Unexpected’ Positive Development on Apple (AAPL) iPhone 16 Demand Trends",
        "Author": "  Fahad Saleem ",
        "Text": "We recently published a list of Top 10 AI Stocks Investors are Talking About in October. Since Apple Inc. (NASDAQ:AAPL) ranks 4th on the list, it deserves a deeper look.\nVenu Krishna, Barclays head of U.S. equity strategy, said while talking to CNBC in a latest program that he is not revising his S&P 500 year-end projection of 5,600 because he believes stock valuations are “full.”\n“If you see what’s happening, numbers (earnings)  have been cut sharply going into the end. What is still anchoring the market is big tech, even though their earnings themselves are kind of decelerating. Then seasonality comes into play. October is the weakest month, and you don’t want to get ahead of that.”\nAsked whether he does not believe the market really broadened out, Krishna said while there were some signs of market broadening, the “anchor” of the rally remains big tech, which according to him, are just six stocks.\nMoving beyond the earnings and valuations debate, another factor still impacting investor sentiment is the Federal Reserve’s next moves.\nTalking about the latest Fed minutes released October 9,  Wolfe Research’s Stephanie Roth said on CNBC that a “substantial” majority of Fed officials wanted a 50-basis-point rate cut. However, she said in the next meeting, a 50bps rate cut is “off the table.”\nFor this article we picked 10 AI stocks trending on latest news. With each stock we mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Investors: 184\nApple Inc (NASDAQ:AAPL) iPhone 16 delivery times are lagging behind historical trends, but analysts suggest this could be due to stronger supply and high-end buyers holding off for the upcoming Apple Intelligence.\n“In Week 3 of our Apple Product Availability Tracker, delivery lead times are showing trends which, if continued, will explain the weaker lead times for the Pro models in the initial weeks as only an aberration led by a combination of better supply mix as well as delay in pick up in momentum from higher-end consumers awaiting the release of Apple Inc (NASDAQ:AAPL) Intelligence,” J.P. Morgan analysts, led by Samik Chatterjee, stated in a note to investors.\nShipping times for iPhone 16 base models in the U.S. improved to 10 days in week three, compared to 17 days the previous week. However, the iPhone 16 Pro and Pro Max models saw no change, remaining at 23 and 29 days, respectively. The trend in China mirrored this, with base models seeing faster delivery times while Pro versions stayed steady.\n“In aggregate, although overall lead times for the iPhone 16 models are still lower relative to iPhone 15 last year, narrowing of the gap between the two groups (Base vs. Pro) over the last week as well as steady lead times for the Pro models are highlighting the likelihood that the initial slower momentum in demand for the Pro models is correcting itself with the release of Apple Inc (NASDAQ:AAPL) Intelligence drawing closer,” Chatterjee added.\nMorgan Stanley’s data echoed this sentiment. “iPhone 16 lead times as of Sept 27th are still tracking lower than the past 3 iPhone cycles, but lead times for 16 Pro/Pro Max models are now extending/stabilizing across all regions that we track, an unexpectedly positive development,” noted analysts led by Erik Woodring.\nInterestingly, lead times for the Pro and Pro Max have grown by two days since last week, a trend more in line with the iPhone 12 and 13 models, rather than the iPhone 14 and 15, which saw shorter wait times at this stage in the cycle. “But interestingly, iPhone 16 Pro/Pro Max lead times have extended by 2 days since last Tuesday, an unexpectedly positive trend that more closely resembles the trajectory of the better-performing iPhone 12 and 13 Pro/Pro Max models,” Woodring added.\nAlmost every bullish case on Apple Inc (NASDAQ:AAPL) was built around this assumption: millions of people would rush to upgrade their iPhone because of AI features.\nHowever, Apple Inc (NASDAQ:AAPL) has been seeing a long-term decline in mobile carrier upgrade rates, especially postpaid, for several years. This suggests that people are holding onto their devices longer, likely due to economic factors, satisfaction with current technology, or a lack of exciting new features in recent models. This trend isn’t great for Apple Inc (NASDAQ:AAPL). Can Apple Intelligence break this trend? We’ll find out soon.\nHowever, the assumption that we will see a huge upgrade cycle of iPhone just because of AI is big and comes with a lot of risks. Apple Inc (NASDAQ:AAPL) trades at a forward PE multiple of around 35x, well above its 5-year average of nearly 27x. Its expected EPS forward long-term growth rate of 10.39% does not justify its valuation, especially with the iPhone upgrade cycle assumption. Adjusting for this growth results in a forward PEG ratio of 3.33, significantly higher than its 5-year average of 2.38.\nColumbia Contrarian Core Fund stated the following regarding Apple Inc. (NASDAQ:AAPL) in its Q2 2024 investor letter:\n“Apple Inc. (NASDAQ:AAPL) – Despite the stock falling after announcing earnings in late May, Apple regained ground toward the end of the quarter, fueled by the company’s long-awaited AI announcement at its annual Worldwide Developers Conference (WDC). At the conference, the company showcased some of its new AI features powered by Apple Intelligence that would be coming to Apple products and also announced a partnership with ChatGPT. Investors greatly welcomed the announcement of Apple’s AI strategy and the stock surged, passing Microsoft as the world’s most valuable company (although this hallmark wouldn’t last). Beta testing of these new features will be coming later this summer, but the initial promise and excitement looks to be a potential catalyst for an upgrade cycle, as the company looks to persuade users who have had the same smartphone for years to consider an upgrade.”\nOverall, Apple Inc. (NASDAQ:AAPL) ranks 4th on Insider Monkey’s list titled Top 10 AI Stocks Investors are Talking About in October. While we acknowledge the potential of Apple Inc. (NASDAQ:AAPL), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-01T16:00:00.000Z",
        "Title": "Introducing Pebblebee Universal: The World’s First Item Trackers Compatible with Both Apple Find My and Google Find My Device Networks",
        "Author": "Business Wire ",
        "Text": "Company announces Pebblebee Clip Universal and Card Universal devices now available in Best Buy stores across the U.S.\nSEATTLE, October 01, 2024--(BUSINESS WIRE)--Pebblebee, a leading innovator in smart tracking solutions, today announced the launch of Pebblebee Universal, a groundbreaking line of item trackers that can be seamlessly integrated with both the Apple Find My and the Google Find My Device networks. Previously, consumers had to choose between an Apple-compatible or Google compatible tracking device. Now, for the first time, consumers can use one Pebblebee device across either platform, offering unparalleled convenience for both Apple and Android users.\n\"Pebblebee Universal’s reach is unmatched as it connects to billions of nodes across the vast and powerful Google Find My Device and Apple Find My networks,\" said Daniel Daoura, founder & CEO, Pebblebee. \"Pebblebee continues to innovate and deliver on its mission to create one connected global ecosystem for all, and we are proud to unveil Pebblebee Universal as the tracker of choice for everyone.\"\nONE TRACKER FOR ALL: THREE VERSATILE FORM FACTORS\nThe new Pebblebee Universal lineup includes three distinct trackers, designed to cater to a variety of tracking needs:\nPebblebee Clip Universal – Compact and rechargeable with versatile attachment. Perfect for keys, bags, and more—keep your essentials secure wherever you go.\nPebblebee Card Universal – Ultra-thin rechargeable tracker that fits effortlessly. Slip it into wallets and passports—travel with confidence and peace of mind.\nPebblebee Tag Universal – Pebblebee’s smallest rechargeable item tracker ever. Ideal for luggage and all other items—explore without limits.\nAll three Pebblebee Universal trackers are rechargeable, ensuring long-lasting usability and reducing environmental impact.\nJUST IN TIME FOR THE HOLIDAYS\nThe new Pebblebee Universal trackers are not only practical but also make for an ideal gift for the tech enthusiast, the frequent traveler, or anyone who wants to keep their belongings safe and secure. Key benefits of Pebblebee Universal trackers include:\nLife Uninterrupted: Imagine the freedom of exploring the world without worrying about your valuables. With Pebblebee, users stay connected to what matters most, allowing them to focus on making memories, not searching for lost items.\nSeamless Integration: Use the devices and apps you already love. Pebblebee works effortlessly with both Apple Find My and Google Find My Device networks, giving users the flexibility to choose how they stay connected.\nPrivacy You Can Trust: With end-to-end encryption provided by Apple and Google, your location data is secure and accessible only by you. Rest easy knowing Pebblebee never accesses or sells user location data.\nNATIONWIDE AVAILABILITY\nPebblebee is happy to announce that the Pebblebee Clip Universal and Card Universal devices are now available nationwide in Best Buy stores and online at www.bestbuy.com. All three new models can be purchased online at pebblebee.com at $34.99 per tracker.\nPebblebee is also expanding its affiliate network. To become an affiliate partner, click here.\nFor more information on Pebblebee and its line of item locators, visit pebblebee.com.\nAbout Pebblebee\nPebblebee is a pioneer in the smart tracking industry, dedicated to creating innovative products that help people keep track of what matters most. With a commitment to quality, design, and sustainability, Pebblebee continues to lead the way in providing smart solutions for everyday life. For more information about Pebblebee and its new line of universal item trackers, please visit pebblebee.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20241001557140/en/\nContacts\nDonna Loughlin408.393.5575donna@lmgpr.com\n"
    }
]