[
    {
        "Date": "2024-01-04T21:10:07.000Z",
        "Title": "Stock market news today: Tech lags as Apple falls for 4th straight day ahead of Dec. jobs data",
        "Author": "  Josh Schafer    and Karen Friar    ",
        "Text": "US stocks' recent slump continued on Thursday, as equities struggled to shake off a dismal start to the year and Federal Reserve policymakers left hopes for an early interest rate cut hanging.\nThe Dow Jones Industrial Average (^DJI) closed just above the flatline, while the benchmark S&P 500 (^GSPC) fell about 0.3%. After a Wednesday sell-off, the Nasdaq Composite (^IXIC) pushed for gains at points in the session, but fell nearly 0.6% below the flatline by the close.\nInvestors looking for confirmation of bets on a March rate cut got uncertainty instead in the Fed minutes released Wednesday. While officials agreed rates had reached a peak and should be lower by the end of 2024, some signaled that they could stay at their historically high levels \"for some time\" depending on the path of inflation.\nIn single stock moves, Apple (AAPL) stock stumbled for a fourth straight day as Wall Street highlighted concerns about weakening iPhone demand.\nRead more: What the Fed rate-hike pause means for bank accounts, CDs, loans, and credit cards\nMultiple data points released Thursday morning showed the labor market remains intact while wages continue to cool, a welcome sign in the fight against inflation.\nThe latest ADP employment report showed private companies added 164,000 jobs in the month of December, above November's reading of 103,000 and higher than analysts' expectations for 115,000 additions.\nElsewhere, the Department of Labor reported that 202,000 jobless claims were filed last week, below economist estimates for 216,000.\nMeanwhile, US bond yields returned to gains, with the 10-year Treasury yield (^TNX) edging closer to 4% after falling away from that level on Wednesday.\nInvestors will now turn to the December jobs report. The monthly labor report from the Bureau of Labor Statistics, slated for release at 8:30 a.m. ET, is expected to show nonfarm payrolls rose by 175,000 in December while the unemployment rate ticked up to 3.8% from the previous month, according to consensus estimates compiled by Bloomberg.\nThe stock market's slide to kick off 2024 continued on Thursday.\nThe Dow Jones Industrial Average (^DJI) closed just above the flatline, while the benchmark S&P 500 (^GSPC) fell about 0.3%. After a Wednesday sell-off, the Nasdaq Composite (^IXIC) pushed for gains at points in the session, but fell nearly 0.6% below the flatline by the close.\nMeanwhile, tech stalwart Apple (AAPL) stock stumbled for a fourth-straight day as Wall Street's highlighted concerns about weakening iPhone demand. The big tech giant is now down almost 6% in the last five days.\nQuantumScape Corporation (QS) led the Yahoo Finance trending tickers page on Thursday. Shares of the Volkswagen's battery subsidiary soared almost 50% after its solid-state cell passed its first endurance test. \nMobileye Global (MBLY) stock dropped roughly 25% after the chipmaker announced it expects first quarter revenue to be down abut 50%. The stock had rallied nearly 30% over the last two months prior to the release.\nWalgreens (WBA) stock fell about 6% after reporting quarterly results. The company announced its cutting its dividend by 48% to $0.25 a share from $0.48 a share.\nPeloton (PTON) stock soared more than 15% on Thursday after an announcement that it will be launching a partnership with TikTok that will feature short-form fitness videos and other content.\nTravel stocks were trading higher on Thursday as oil prices fell, signaling lower fuel costs for cruise line and airline operators.\nAmerican Airlines (AAL), Delta (DAL), and United (UAL) all rose more than 1%. Cruise line operators Royal Caribbean (RCL) and Carnival (CCL) surged more than 2%.\nOil futures fell more than 2% earlier in the session amid higher-than-expected builds of US gasoline and distillate fuels.\nMeanwhile, energy-related stocks were under pressure on Thursday. The S&P 500 Energy Select ETF (XLE) was the worst-performing sector, down more than 1%.\nThe December jobs report is set for release Friday morning and is expected to show further signs of a cooling labor market to finish 2023.\nThe monthly labor report from the Bureau of Labor Statistics, slated for release at 8:30 a.m. ET, is expected to show nonfarm payrolls rose by 175,000 in December while the unemployment rate ticked up to 3.8% from the previous month, according to consensus estimates compiled by Bloomberg. In November, the US economy added 199,000 jobs while unemployment unexpectedly fell to 3.7%.\nHere are the key numbers Wall Street will be looking at, according to data from Bloomberg:\nOnce again, the report will be a crucial test for the stock market's end-of-year rally. Investors have largely attributed the move that pushed stocks near all-time highs to a shift in sentiment as many now believe the Federal Reserve can achieve a so-called soft landing, where inflation retreats to 2% without a complete downturn in economic growth.\n\"We expect the December employment report to show slower job growth and a further moderation in nominal wage growth, both something the Federal Reserve wants to see as it attempts to engineer a soft-landing,\" Oxford Economics lead US economist Nancy Vanden Houten wrote in note on Thursday.\nOil prices reversed course on Thursday after weekly US gasoline and distillate fuel stockpiles pointed to lower demand.\nWest Texas Intermediate (CL=F) sank more than 2% before paring most of those losses following the release of US crude inventory data. Brent (BZ=F) also sank into negative territory, losing its earlier gains.\nGasoline stockpiles rose by 10.9 million barrels, their highest week-over-week increase in more than three decades, according to Energy Information Administration data.\nCrude inventories fell by 5.5 million barrels for the week ending Dec. 29, but the bigger-than-expected draw may reflect supplies from the US making up for shipment interruptions stemming from Red Sea tensions.\nOil futures were up more than 1% earlier in the session, extending their gains from Wednesday amid concerns of supply interruptions in Libya.\nA precipitous fall in mortgage rates has stalled to start 2024.\nYahoo Finance's Rebeca Chen reports:\nThe average rates for 30-year loans inched up to 6.62% from 6.61% a week ago, according to tracking by Freddie Mac on Thursday. Aside from this week's minuscule rise, rates have been declining for weeks since late October, falling nearly 117 basis points from a 12-month high of 7.79% at the end of October.\nThose recent declines have boosted homebuyers' ability to purchase homes, but further affordability improvement could be curbed by a continual supply shortage, especially if lower rates bring back sidelined demand.\n\"While mortgage interest rates are expected to overall decline in 2024, minor fluctuations in weekly mortgage interest rates are to be expected,\" Jessica Lautz,the National Association of Realtors’ deputy chief economist, wrote to Yahoo Finance.\n\"The biggest demand is likely to come from those who had been priced out of the homebuying market. For spring, there will likely be competition among the steady share of all-cash homebuyers and first-time buyers trying to edge in,\" Lautz added.\nStocks are off to a rough start in 2024.\nThe famed Santa Claus Rally didn't come. The Nasdaq Composite (^IXIC) had its fourth-worst first day of a new year ever. And the Russell 2000 (^RUT), a darling of the recent market rally, just had its third-worst two-day start to a year ever.\n\"It's fair to say that financial markets have started 2024 with something of a mild hangover,\" Capital Economics deputy chief markets economist Jonas Goltermann wrote in a research note Wednesday.\nBut some on Wall Street think the current drivers of the market have been macro-focused. When that sentiment shifts to focus on earnings, the rally can continue.\nRecent data from FactSet shows analysts expect S&P 500 companies to report earnings growth of 11.7% for the full year, which would be above the 10-year average annual earnings growth rate of 8.4%.\nThat earnings backdrop is one of the main drivers behind Bank of America seeing nearly 10% growth for the S&P 500 from current levels, per BofA equity strategist Ohsung Kwon.\n\"Earnings season, starting next week, is going to be key to the market,\" Kwon said.\nWith companies officially exiting the earnings recession in the third quarter, Kwon believes that momentum continuing is crucial to the bullish thesis.\n\"Companies have cut costs throughout the earnings recession,\" Kwon said. \"They have managed margins. Margins went up for the second straight quarter. So I think the momentum is to the upside and if companies talk more positively this earnings season, given that the rate pressure and the macro uncertainty has eased somewhat. Now, that's going to be bullish for equities.\"\nUS stocks stalled on Thursday, struggling to shake off a dismal start to the year after Federal Reserve policymakers left hopes for an early interest-rate cut hanging.\nThe Dow Jones Industrial Average (^DJI) popped about 0.2%, while the benchmark S&P 500 (^GSPC) was down about 0.1%. Tech stocks signaled a return to their Wednesday sell-off, as the Nasdaq Composite (^IXIC) dropped about 0.4%.\nMultiple data points released Thursday morning showed the labor market remains intact while wages continue to cool, a welcome sign in the fight against inflation.\nThe latest ADP employment report showed private companies added 164,000 jobs in the month of December, above November's reading of 103,000 and higher than analyst expectations for 115,000 additions.\nAlso within the release, ADP revealed annual wage growth fell to 5.4% from 5.6% the month prior.\n\"We're returning to a labor market that's very much aligned with pre-pandemic hiring,\" said Nela Richardson, chief economist at ADP. \"While wages didn't drive the recent bout of inflation, now that pay growth has retreated, any risk of a wage-price spiral has all but disappeared.\"\nElsewhere, data from the Department of Labor shows 202,000 jobless claims were filed last week, below economist estimates for 216,000. Jobless claims are an area several economists have told Yahoo Finance they're monitoring for signs of a slowdown, as an uptick in claims would mean more people are being laid off from their jobs.\nThe big labor data update for the week still awaits investors as the December jobs report is expected for release at 8:30 a.m. ET on Friday.\nApple (AAPL) was hit with its second downgrade in the four days of 2024, this time from Piper Sandler.\nThe reason for the downgrade from analyst Harsh Kumar was similar to the one from peers at Barclays earlier this week: iPhone demand, especially in an expectedly weak Chinese market.\nApple's stock has already been hit this year, and it was down more than 1% in premarket trading on Thursday:\nPiper Sandler's downgrade to Neutral from Overweight was perhaps less jarring than that of Barclays, which cut its rating to Underweight on Tuesday. Apple's stock responded with its biggest percentage drop since September.\nAccording to Bloomberg, the percentage of analysts with a bullish rating on the stock is at a three-year low.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-01-18T22:35:52.000Z",
        "Title": "Stock market today: Nasdaq surges as chipmakers shine, Apple pops",
        "Author": "  Josh Schafer    and Karen Friar    ",
        "Text": "Big tech led a stock market rally on Tuesday as Apple (AAPL) had its best day since May 2023.\nThe S&P 500 (^GSPC) popped 0.9%, while the tech-heavy Nasdaq Composite (^IXIC) led gains, rising more than 1.3%. The Dow Jones Industrial Average (^DJI) rose about 0.5%. The S&P 500 is now nearing its record closing high of 4,796.56.\nBig tech stocks led the market higher after a bullish AI-fueled revenue outlook from TSMC (TSM), a key supplier to Apple and Nvidia (NVDA). The Taiwanese contract chipmaker's profit fell but beat Wall Street estimates. Shares of AMD (AMD) and other chipmakers stepped higher as TSMC put on more than 9%.\nMeanwhile, an upgrade from to Buy from Neutral by Bank of America sent Apple stock more than 3% higher on hopes the tech giant's new Vision Pro headset could drive increased hardware sales.\nAlso on Thursday, Atlanta Fed President Raphael Bostic said he doesn't see the Federal Reserve cutting interest rates until the third quarter, later than the market's current projection for March, unless there is \"convincing\" evidence of inflation's decline.\nThe odds of a rate cut in March as seen by traders have dropped more than 10 percentage points from a week ago, per the CME FedWatch Tool.\nRead more: What the Fed rate-hike pause means for bank accounts, CDs, loans, and credit cards\nBig Tech led a stock market rally on Tuesday as Apple (AAPL) had its best day since May 2023.\nThe S&P 500 (^GSPC) popped 0.9%, while the tech-heavy Nasdaq Composite (^IXIC) led gains, rising more than 1.3%. The Dow Jones Industrial Average (^DJI) rose about 0.5%. The S&P 500 is now nearing its record closing high of 4,796.56.\nSmall caps have had a rough run in January.\nThe Russell 2000 index is down about 5% in the month of January and is back around levels last seen before the December Federal Reserve meeting sent the markets into soft-landing euphoria.\nBut while investors have been more tepid on the interest rate sensitive sector as skepticism builds on when the first interest rate cut will come, Goldman Sachs still sees 15% upside in the index over the next 12 months.\nGoldman Sachs equity strategist Ben Snider told Yahoo Finance his team sees opportunity with the index about 20% off its 2021 highs and a trajectory for strong economic growth to power small-cap companies.\n\"From a macro economic perspective, generally speaking, the US economy is the most important driver of equity performance broadly, and especially with small-cap equity performance,\" Snider said.\nAnd while Snider believes much of the positive economic news expected could have been priced in during the November and December rally for the index, the recent pullback in small caps reflects further potential upside.\n\"There is substantial lingering risk premium embedded in parts of the market, including small caps, because investors are still unsure that we're moving away from this higher-for-longer interest rate environment,\" Snider said. \"As the Fed begins to cut, we expect that to start at the March meeting, but whenever it is, as the Fed begins to cut, we should see that risk premium decline. We should see valuations normalize to average levels, if not above-average levels.\n\"And that is the reason why investors should be pretty optimistic about small gains.\"\nApple stock was up nearly 3% on Thursday an upgrade from Bank of America.\nYahoo Finance's Dan Howley reports: \nAfter a string of downgrades from Wall Street analysts, Apple’s (AAPL) stock received a much-needed vote of confidence on Thursday as Bank of America (BAC) analyst Wamsi Mohan upgraded the bank’s position on the company and raised its price target. Shares of Apple were up nearly 3% as of midday Thursday.\nIn a research note, Mohan upgraded Apple to Buy from Neutral and increased its price objective from $208 to $225. Mohan said the company stands to benefit from a number of industry trends, as well as a glut of users who are using older iPhones and will need to upgrade to newer models in the coming years.\nSpecifically, Mohan says that he expects a “stronger multi-year iPhone upgrade cycle driven by need for the latest hardware to enable Generative AI features to be introduced in 2024/2025.” He also expects to see better growth in the company’s services business and said risks around potential legal issues Apple could face are “manageable.”\nApple is also preparing to launch its most ambitious product yet: the Vision Pro headset. The first new product category for the company since it launched the Apple Watch, the $3,499 Vision Pro will serve as a test for Apple’s ability to produce a new kind of device for what could be the next generation of computing.\nTaiwan Semiconductor (TSM) led the Yahoo Finance trending tickers pages on Thursday afternoon following its latest quarterly earnings release. The company topped Wall Street's estimates for earnings per share and projected revenue will grow 20% in 2024 driven by artificial intelligence demand.\nShares of Apple (AAPL) increased nearly 3% after Bank of America upgraded the stock to Buy from Neutral. Analyst Wamsi Mohan bumped his price target to $225 from $208 citing artificial intelligence and the new Vision Pro headset as key drivers.\nHumana (HUM) stock tumbled roughly 10% after the US health insurer said an increase in older patients seeking care would hurt its fourth quarter results.\nPlug Power (PLUG) shares tumbled about 15% on Thursday after the hydrogen fuel cell developer announced a potential $1 billion stock offering plan.\nThe vast training sets that gobble up troves of data from the open web to inspire AI models may become smaller and more curated, bypassing copyright issues at the center of the legal debate over tools like ChatGPT.\nOpenAI CEO Sam Altman says he believes future AI models will use less training data but of higher quality.\n\"One thing that I expect to start changing is these models will be able to take small amounts of higher-quality data during their training process and think harder about it and learn more,\" Altman said on a panel interview at the World Economic Forum in Davos on Thursday.\nCurrent generative AI models rely on huge datasets to train their tools. And since the data comes from the internet, the material includes copyrighted works from creators who never consented for their content to be part of the training set. Some major publishers have agreed to license their content to AI companies. But others, including the New York Times, have sued AI companies for copyright infringement.\nHow courts will apply legacy copyright law to new AI technologies is perhaps the biggest challenge facing businesses like OpenAI.\nAltman said during the interview that \"any one particular training source doesn't move the needle for us that much.\" For OpenAI and others, a model where publishers opt out of the training process, excluding their content from the development process, is one way for creators to protect themselves.\nBut Altman also envisions a new paradigm of smaller pools of data and one in which creators are compensated for helping to inspire AI tools. \"We wont need the same massive amounts of training data,\" he said. \"But what we want in any case is to find new economic models that work for the whole world including content owners.\"\nHe added: \"If you teach our models, if you help provide the human feedback, I'd love to find new models for you to get paid based off the success of that.\"\nMortgage rates' recent decline continued in data released on Thursday.\nYahoo Finance's Rebecca Chen reports: \nThe average rate for a 30-year loan dropped to 6.60% from 6.66% a week prior, according to Freddie Mac on Thursday. The latest average is the lowest level in seven months, since May 2023 when rates were around 6.57%.\nHomebuyers are returning to the market as borrowing costs retreated nearly 120 basis points from their October high, when rates nearly broke the 8% mark. Aiding homebuyers is the uptick in listings from homeowners finally selling after a year of gridlock.\nHowever, experts said the rise in inventory may still not be enough to supply underlying demand.\n“Mortgage rates decreased this week, reaching their lowest level since May of 2023,” Sam Khater, Freddie Mac’s chief economist, said in a statement. “This is an encouraging development for the housing market and in particular first-time homebuyers who are sensitive to changes in housing affordability. However, as purchase demand continues to thaw, it will put more pressure on already depleted inventory for sale.”\nPlug Power (PLUG) shares tumbled as much as 16% on Thursday after the hydrogen fuel cell developer announced a potential $1 billion stock offering plan.\nThe capital raise comes about two months after the Latham, N.Y.-based company issued a \"going concern\" notice regarding its potential inability to fund operations over the next year.\nOn Thursday Morningstar analysts noted, \"This hints that the company may be experiencing difficulty in arranging other financing solutions at reasonable terms.\"\nDuring the company's third quarter earnings call last November, Plug Power CEO Andy Marsh said, \"This was a difficult quarter.\"\nHe added, \"Over the past several months, there have been enormous challenges associated with the availability of hydrogen, primarily due to downed plants, including our Tennessee facility, and temporary plant outages across the entire hydrogen network.\"\nPlug Power shares were down 12%, trading at around $2.40 each at 11:30 a.m. Eastern. The stock is down roughly 48% year to date.\nHomebuilders pulled back less than expected on the start of construction for new homes in December while permits issued to build rose, signaling a continued recovery in the housing market.\nNew residential construction, including single family and multifamily homes, fell 4.3% in December from the month prior to an annualized rate of 1.460 million units, according to data from the Census Bureau released Thursday. The results were higher than the forecast of 1.425 million units from economists surveyed by Bloomberg.\nAuthorized residential permits — an indicator of future activity — rose 1.9% to a rate of 1.495 million units in December, up from November's revised rate of 1.467 million units. This beat forecasts for a rate of 1.477 million units, according to data from Bloomberg.\n\"Most of the drop in housing starts reflects the partial reversal of the spike in November single-family starts, but the less-volatile permits numbers suggest that the steady uptrend in single-family construction will continue,\" Kieran Clancy, senior US economist at Pantheon Macroeconomics, wrote following the release.\nStarts on multifamily structures with five or more units landed at 417,000 for December, slightly higher than the previous month's 404,000 units. Permits to start construction on multiple properties with five or more units reached 449,000 units in December, a 3.2% increase from the previous month.\n\"The fall on the month [for housing starts] was something of a surprise to us given that November’s strength was caused by it being an unseasonably warm and dry month, and last month was the warmest December on record,\" wrote Thomas Ryan, property economist at Capital Economics.\n\"Looking ahead to this year, we don’t think mortgage rates will fall enough to unwind mortgage rate 'lock-in' and cause a meaningful recovery in supply,\" Ryan added. \"Against that backdrop, demand will continue to get diverted to newbuilds, which will also encourage stronger construction activity.\"\nMarkets had been in search of a catalyst that wasn't macroeconomic data, and it appears the tech sector has once again stepped in with good news to lift the broader averages.\nTaiwan Semiconductor (TSM) took the lead role on Thursday as the chipmaker, which supplies to the likes of Apple (APPL) and Nvidia (NVDA), reported quarterly results before the opening bell that beat estimates.\nThe company's adjusted earnings per share of $1.48 came in higher than Wall Street's expectations for $1.38. And, perhaps more importantly, the chipmaker said artificial intelligence is fueling its success. Taiwan Semiconductor said it expects revenue to grow 20% in 2024 due in part to AI demand.\nThe news sent the semiconductor index (^SOX) nearly 3% higher while market bellwether Nvidia shot up over 2%. This came as an upgrade on Apple (AAPL) stock from Bank of America sent shares of the iPhone maker nearly 3% higher.\nTo Keith Lerner, the co-chief investment officer at Truist, news like Thursday's is still key to driving the market higher given tech's outsized weight in the major averages.\n\"With the concentration that you still have, I think, tech showing the earnings and the ability to grow earnings at a good pace, even if we have a step down in growth, is very important to keep this market moving forward,\" Lerner told Yahoo Finance on Wednesday ahead of tech earnings.\nThe S&P 500 (^GSPC) added around 0.4%, while the tech-heavy Nasdaq Composite (^IXIC) led gains, rising 1% in morning trade.\nUS stocks tipped higher on Thursday, eyeing a rebound from recent losses as investors looked to fresh quarterly earnings for inspiration amid dwindling hopes for an early 2024 interest rate cut.\nThe S&P 500 (^GSPC) added around 0.4%, and the tech-heavy Nasdaq Composite (^IXIC) led gains, rising 1%. The Dow Jones Industrial Average (^DJI) dropped about 0.3%.\nTechs led stocks higher after a bullish AI-fueled revenue outlook from TSMC (TSM), a key supplier to Apple (APPL) and Nvidia (NVDA). The Taiwanese contract chipmaker's profit fell but beat Wall Street estimates. Shares of AMD (AMD) and other chipmakers stepped higher as TSMC put on almost 7%.\nWeekly jobless claims hit their lowest level in more than a year last week despite concerns over slowing in the labor market to start 2024.\nFresh data from the Department of Labor showed 187,000 unemployment claims were filed last week. Economists surveyed by Bloomberg had expected 208,000 claims.\n\"Most labor market indicators show progress toward a rebalancing in supply and demand, but that is happening without a rise in layoffs, with initial jobless claims falling to their lowest level since September 2022,\" Oxford Economics US economist Matthew Martin wrote in a note to clients. \"Though seasonal factors overstate the drop, the low levels of claims suggest vacancies rather than employment continue to bear the burden of softening labor demand.\"\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-01-04T19:41:43.000Z",
        "Title": "Why Wall Street is cooling on Apple stock",
        "Author": " Hamza Shaban    · Senior Reporter",
        "Text": "The brightest light on Wall Street is dimmer at the start of 2024.\nApple (AAPL), the most valuable company on the market, has endured a bruising run in the first days of the new year. The iPhone maker, which commands about 7% of the weight of the S&P 500 (^GSPC) index, steering the fate of investor portfolios, drew two stock downgrades this week, pulling shares down more than 5% and raising concerns about weakening iPhone demand.\nBarclays struck the first blow. Analysts there cut Apple's rating to Underweight and dropped their price target to $160, representing what was a roughly 17% stock price drop for the tech giant from last year.\n\"We rate Apple Under Weight as questions persist about the deterioration of iPhone upgrade demand with rising competition in the premium smartphone segment,\" the analysts wrote.\nThe follow-up punch landed Thursday, when analysts at Piper Sandler downgraded their rating on Apple's stock to Neutral from Overweight and sliced their price target by $15 to $205. Apple shares were trading hands at around $182 as of Thursday afternoon.\n\"We are concerned about handset inventories entering into 1H24 and also feel that growth rates have peaked for unit sales,\" said lead analyst Harsh Kumar in a note to clients. \"Deteriorating macro environment in China could also weigh on handset business.\"\nThe percentage of analysts with a bullish rating on the stock is at a three-year low, according to Bloomberg data.\nApple's iPhone revenue sank about $5 billion in 2023 from the year prior. The flagship iPhone accounts for roughly half the company’s total revenue. Sales of Macs, iPads, and wearables also declined, as rising inflation and interest rates pressured consumers.\nBut bullish analysts focus on Apple's growing services businesses, which swelled from $78 billion in 2022 to $85 billion in 2023. In the most recent quarter revenue from services ballooned by almost 20% compared to the same period the year before. Apple's enormous user base and the strength of its services are a crucial component of more optimistic readings on the company's future. Wedbush analysts led by Dan Ives pin the value of Apple's services business as high as $1.6 trillion and predict that Cupertino will become the first $4 trillion company by the end of 2024.\nSkeptical observers, however, see heightened risks even in Apple's most promising segment. Barclays noted that services might attract more regulatory scrutiny. Investigations into the app store could intensify, especially as other tech giants brace for a wave of significant antitrust rulings this year. How Big Tech figures into the US presidential election and how aggressively the next administration will pursue competition enforcement is another major factor for tech stocks.\nApple's lucrative agreement to use Google as the default search engine in its Safari browser, which is estimated to bring in billions of dollars to its services business, could also be under threat. Closing arguments for the Department of Justice's antitrust case against the search giant are scheduled for the spring.\nApple's dimming prospects among some analysts coincide with a stock performance that lags behind other members of the Magnificent Seven.\nAll the names in the elite, tech-centric group handily beat out the benchmark S&P 500 index. But Apple claimed the lowest position, rising roughly 50% in 2023. That’s nothing to sneeze at, but is notable compared to the staggering gains of Nvidia (NVDA) and Meta (META), up 239% and 194%, respectively, or even Microsoft's (MSFT) more modest 57% rise. The Nasdaq 100's (^NDX) increase of 54% managed to edge out Apple too.\nWhere much of the tech world and even players outside it have scrambled to get in on the AI hype — releasing products, announcing new ventures or simply reciting the words \"AI\" — Apple CEO Tim Cook has taken a more subtle approach. That too may have played a factor in the market's cooling reception.\nIn recent earnings calls, Cook has explained that AI is already integrated into the Apple consumer experience. It's just that the company doesn't call out the technologies explicitly, as if it were a marketing gimmick, but relies instead on weaving AI into its products and focusing on the customer benefit. In another rhetorical move that appeared to be gently critical of other tech leaders, Cook said the company tends to unveil new technologies when they are ready for users. And not before.\nIf there is a consumer tech company defined by how its products make users feel — for the vibes rather than the intricacies of its software, it's Apple. So not showboating about what's coming in the AI development cycle has its benefits.\nBut a more pessimistic interpretation is that as rivals like Microsoft and Meta lean into their large language models, framing generative AI as tech's next great frontier, Apple is getting left behind. And most of us already have phones.\nHamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on Twitter @hshaban.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-01-10T18:27:11.000Z",
        "Title": "Microsoft challenges Apple as world's most valuable company",
        "Author": "  Noel Randewich ",
        "Text": "By Noel Randewich\n(Reuters) - A recent dip in Apple's stock over worries about iPhone sales has left the Silicon Valley tech heavyweight in danger of being overtaken by Microsoft as the world's most valuable company.\nFresh worries about smartphone demand have pushed Apple's shares down 4% so far in 2024 after rallying 48% last year. Microsoft is up about 2% year to date after surging 57% in 2023.\nApple dipped 0.4% on Wednesday, while Microsoft added 1.6%, further eroding the iPhone maker's lead. Apple's stock market value is now at $2.866 trillion, compared to Microsoft's $2.837 trillion value.\nApple's market capitalization peaked at $3.081 trillion on Dec. 14, while Microsoft's value reached as much as $2.844 trillion on Nov. 28.\nIPhone sales in China dropped 30% in the first week of 2024, Jefferies analysts said in a client note this week, adding to signs of growing competitive pressures from Huawei and other domestic rivals.\nSales of Apple's Vision Pro mixed-reality headset start on Feb. 2 in the United States, marking Apple's biggest product launch since the iPhone in 2007. However, UBS in a report on Monday estimated that Vision Pro sales would be \"relatively immaterial\" to Apple's earnings per share in 2024.\nA handful of times since 2018, Microsoft has briefly taken the lead over Apple as the most valuable company, most recently in 2021, when concerns about supply chain shortages related to the COVID-19 pandemic hit the iPhone maker's stock price.\nBoth tech stocks look relatively expensive in terms of price to their expected earnings, a common method of valuing publicly listed companies. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24.\nIn its most recent quarterly report in November, Apple gave a sales forecast for the holiday quarter that missed Wall Street expectations, hurt by weak demand for iPads and wearables.\nAnalysts on average see Apple posting revenue up 0.7% to $117.9 billion for the December quarter, according to LSEG. That would mark its first year-on-year revenue increase in four quarters. Apple reports its results on Feb. 1.\nAnalysts see Microsoft reporting a 16% increase in revenue to $61.1 billion, lifted by ongoing growth in its cloud business when it reports in the coming weeks.\n(Reporting by Noel Randewich; editing by Jonathan Oatis)\n"
    },
    {
        "Date": "2024-01-10T18:27:11.000Z",
        "Title": "Microsoft challenges Apple as world's most valuable company",
        "Author": "  Noel Randewich ",
        "Text": "By Noel Randewich\n(Reuters) - A recent dip in Apple's stock over worries about iPhone sales has left the Silicon Valley tech heavyweight in danger of being overtaken by Microsoft as the world's most valuable company.\nFresh worries about smartphone demand have pushed Apple's shares down 4% so far in 2024 after rallying 48% last year. Microsoft is up about 2% year to date after surging 57% in 2023.\nApple dipped 0.4% on Wednesday, while Microsoft added 1.6%, further eroding the iPhone maker's lead. Apple's stock market value is now at $2.866 trillion, compared to Microsoft's $2.837 trillion value.\nApple's market capitalization peaked at $3.081 trillion on Dec. 14, while Microsoft's value reached as much as $2.844 trillion on Nov. 28.\nIPhone sales in China dropped 30% in the first week of 2024, Jefferies analysts said in a client note this week, adding to signs of growing competitive pressures from Huawei and other domestic rivals.\nSales of Apple's Vision Pro mixed-reality headset start on Feb. 2 in the United States, marking Apple's biggest product launch since the iPhone in 2007. However, UBS in a report on Monday estimated that Vision Pro sales would be \"relatively immaterial\" to Apple's earnings per share in 2024.\nA handful of times since 2018, Microsoft has briefly taken the lead over Apple as the most valuable company, most recently in 2021, when concerns about supply chain shortages related to the COVID-19 pandemic hit the iPhone maker's stock price.\nBoth tech stocks look relatively expensive in terms of price to their expected earnings, a common method of valuing publicly listed companies. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24.\nIn its most recent quarterly report in November, Apple gave a sales forecast for the holiday quarter that missed Wall Street expectations, hurt by weak demand for iPads and wearables.\nAnalysts on average see Apple posting revenue up 0.7% to $117.9 billion for the December quarter, according to LSEG. That would mark its first year-on-year revenue increase in four quarters. Apple reports its results on Feb. 1.\nAnalysts see Microsoft reporting a 16% increase in revenue to $61.1 billion, lifted by ongoing growth in its cloud business when it reports in the coming weeks.\n(Reporting by Noel Randewich; editing by Jonathan Oatis)\n"
    }
]