[
    {
        "Date": "2024-02-08T11:20:00.000Z",
        "Title": "AAPL Stock Forecast 2024: Why Apple Is a No-Brainer Buy for Investors",
        "Author": "  Chris MacDonald ",
        "Text": "Any Apple (NASDAQ:AAPL) stock forecast has to recognize how critical the iPhone has been, but, as the company’s management team has proven, the company is far more than that. From its cloud business to its services and accessories (among other hardware devices), Apple is an absolute behemoth in the consumer discretionary sector.\nFluctuating between the world’s largest and second-largest company regularly, Apple keeps its power in the markets and remains a core portfolio holding of many passive investors (whether or not they know it). In fact, the market weighting for Apple remains at or near a market-leading level, for good reason. Let’s dive into why the company should be considered a core holding by active and passive investors alike.\nAfter Apple’s recent earnings report, 43 analysts projected the company’s 2024 revenue to come in at $388.3 billion, similar to the previous 12 months. Predicted earnings per share stood at $6.55, also consistent with last year’s results.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nThese were down from previous estimates, but the market has remained steadfast with its view that cash flow growth should remain robust at this mega-cap giant. For many, that’s enough of a reason to own this company at over 30-times earnings.\nAnalysts reaffirmed Apple’s consensus price target at $200, indicating they don’t expect lower revenue forecasts to affect its market worth. Now varied estimates resulted in this consensus estimate. These analyst price targets range from a bullish $250 to a bearish $125 per share, showcasing diverse perspectives on Apple’s future.\nAside from its gadgets, Apple also has a very strong services segment. The segment boasts $23.1 billion in revenue, and it has been helping drive the company’s to success. Because of its innovation, the stock surged about 23% in 2023 and is expecting to grow more in 2024.\nWedbush analysts hailed Apple’s Vision Pro as a potential “game changer” post its store debut. They noted its early mass appeal and strong initial reception, surpassing expectations and foreseeing future integration with AI.\nApple’s Vision Pro entered the competition against Meta’s Quest 3, the leading AR headset in 2023. Despite its higher price starting at $3,499 compared to Quest 3’s $500, analysts viewed it as a valuable asset for Apple.\nBank of America estimated it could contribute 68-89 cents per share to Apple’s EPS over five years. They also foresee a multi-year iPhone upgrade cycle driven by generative AI.\nIn the recent earnings call CEO Tim Cook also highlighted some adjustments to Apple’s iOS, Safari, Apple Pay, and App Store that aligns with EU’s Digital Markets Act (DMA).\nHe emphasized Apple’s commitment to privacy, security, and usability, despite potential limitations due to regulatory compliance. Apple’s CFO Luca Maestri clarified these changes would affect only EU users, constituting approximately 7% of the global App Store revenue.\nIn the fourth quarter, Cook highlighted robust growth in emerging markets, including record-breaking sales in Malaysia, Mexico, the Philippines, Poland, and Turkey, and strong performance in India, Indonesia, Saudi Arabia, and Chile.\nDespite declining sales in China, where Apple remains strong, this company is a top global smartphone seller, and will likely continue to be for years to come.\nApple is a company that is really unparalleled in the world of financial markets right now. The company’s recent product innovations, its pursuit of more ecosystem-driven services revenue, and its rock-solid balance sheet make this stock one to hold for the long-term.\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\nThe post AAPL Stock Forecast 2024: Why Apple Is a No-Brainer Buy for Investors appeared first on InvestorPlace.\n"
    },
    {
        "Date": "2024-02-06T22:12:55.000Z",
        "Title": "Spotify CEO Daniel Ek unloads on Apple by calling its compliance with new EU antitrust rules ‘a farce’",
        "Author": "  Rachyl Jones ",
        "Text": "Spotify CEO Daniel Ek ratcheted up his yearslong fight with Apple over its app store policies by accusing the company of skirting new EU requirements to fix the problem.\nEk had successfully pushed Europe’s antitrust regulators to require that Apple let users download iOS apps from third party app stores. But on Tuesday, he complained that Apple’s subsequent changes are “a farce” that continues to harm app developers.\n“Apple’s stance is very much incongruent to our stance on the matter, and frankly, I think it’s a bit of a farce,” Ek said during Spotify’s earnings call on Tuesday.\nTo comply with the EU’s new rules, Apple recently introduced new terms for app purchases and downloads. While Apple is reducing its commission fee for in-app transactions—from 30% to 17%, or 10% for small businesses—it is tacking on additional charges. Developers who use the App Store’s payment processing system will have to pay a 3% fee, and large developers will have to pay €0.50 ($0.54) every time a user downloads their app from an alternative app store.\nThis leaves music streaming giant Spotify in the same or a worse position than under Apple’s old policy of charging developers a 30% commission on in-app purchases, Spotify said. App developers can choose whether they want to operate under the old rules or switch to the new ones, but those who adopt the new terms can never switch back.\n“It looks on the surface like they’re complying with it,” Ek said during the call about Apple complying with the new EU regulations. “But behind the surface, they’re doing pretty much everything to make this such an unattractive experience that no sane developer would want to pick the new terms.”\nApple didn’t immediately respond to a request for comment.\nApple’s policy changes and the new regulation, called the Digital Markets Act (DMA), go into effect in March. During Apple’s earnings call last week, CEO Tim Cook said predicting how consumers will react to the change is difficult, and that it’s too early to know how the changes will impact the company’s revenue. While Spotify says Apple’s new policies circumvent the new rules, the European Commission will ultimately decide on the matter.\nAt the core of this feud is Spotify’s bottom line. Over the past four quarters, it has reported a profit only once. Ek protested that some of his company’s ideas to generate more revenue, like selling individual audiobooks, are undermined by Apple’s excessive fees.\n“Apple insists on taking a 30% cut, which in many cases exceeds even our own cut,” he said, adding that it limits “some of these innovative things we would like to do.”\nThe good news for Spotify investors is that Apple’s policy changes result in no downside for Spotify’s existing business, Ek said. Spotify can continue to operate under Apple’s old terms. If the European Commission strictly enforces the DMA against Apple, though, the “potential upsides could be quite significant,” he said.\nFor the most recent quarter, which ended Dec. 31, Spotify reported subscriber growth that beat analysts’ expectations and revenue that fell slightly below. The company had 236 million paid subscribers, up 10 million from the previous quarter. Meanwhile, it generated $3.67 billion in revenue, or 16% year-over-year growth.\nInvestors cheered the news Tuesday morning, sending the stock soaring 9% before it retreated to a 4% gain, at $231.92.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-02-13T15:30:00.000Z",
        "Title": "If You Invested $10,000 in Apple When Tim Cook Became CEO, This Is How Much You'd Have Today",
        "Author": "  Jeremy Bowman, The Motley Fool ",
        "Text": "Apple (NASDAQ: AAPL) is one of the most influential companies in history.\nThe iPhone heralded the era of the mobile internet, and now, the Vision Pro may kick off the next major computing platform. Most of the credit for the company's success is usually given to co-founder and longtime CEO Steve Jobs. He led Apple through its most inventive period when it released the iPod, iPhone, and iPad in less than a decade, setting the stock on an incredible growth path that's lasted to this day.\nCurrent CEO Tim Cook took the helm in Aug. 2011, shortly before Jobs' death. Cook had previously served as Chief Operating Officer, running the company's sales operation and supply chain. While some were skeptical that Cook could fill Jobs' shoes, he's skillfully led Apple and its stock to new heights. Here's how the company has fared during his tenure.\nIn 2011, the tech industry was much smaller than it is today. Smartphones were still relatively new, and the mobile economy was just developing.\nTrue to expectations, Apple's pace of innovation has slowed under Cook. Prior to the release of the Vision Pro earlier this month, the biggest products launched under his tenure have been accessories like the Apple Watch and AirPods.\nCook's biggest accomplishments have likely been the growth of the company's installed base of devices, which reached 2.2 billion in its most recent quarter, and the growth of the services business. Services generate significantly higher margins than Apple's devices, and annual services revenue exploded from $12.9 billion in fiscal 2012 to $85.2 billion in fiscal 2023. Revenue from this segment is largely driven by the App Store, or the 30% commission Apple takes on in-app payments, as well as offerings like Apple Pay and Apple Care insurance.\nThese achievements have largely been incremental: Improving each iteration of the iPhone enough to keep customers coming back for an upgrade, helping to grow the services business, and selling complementary devices like Apple Watches and Airpods.\nHowever, 2024 has set the stage for arguably the biggest risk the company has taken under Cook: the release of the Vision Pro. Though reviews have been mixed, most industry observers believe that if any company can crack the headset market, it's Apple.\nAs most investors know, Apple has been a big winner in the Cook era.\nAs you can see, the stock has outperformed the S&P 500 by a wide margin since Cook took over in Aug. 2011 -- up 1,270% (or 1,530% on a total return basis). That means an investor who bought $10,000 of Apple stock at the start of Cook's tenure would have $163,000 today after enjoying a compound annual return of 25%. An equal investment in the S&P 500 would be worth just $52,100 today.\nApple held the title of the world's most valuable company for most of the past several years, but it recently lost the crown to longtime rival Microsoft. Nonetheless, Apple is still in good shape to deliver solid profit growth as it grows services revenue, repurchases stock, and refreshes its device lineup.\nThe company dominates the consumer tech industry, and it's grown its share of the smartphone market in recent years.\nWhile the stock commands premium to the broad market with a price-to-earnings ratio of 29, Apple has proven itself time and again, and its core businesses look as strong as ever. Cook teased a generative AI announcement for later this year, which could be transformative for the company. And the Vision Pro, if successful, could reshape Cook's legacy as an innovator.\nMaintaining a pace of 25% average annual returns might be difficult, but the company is still well-positioned to outperform the market for the foreseeable future.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nJeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Microsoft. The Motley Fool has a disclosure policy.\nIf You Invested $10,000 in Apple When Tim Cook Became CEO, This Is How Much You'd Have Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-15T21:38:57.000Z",
        "Title": "Apple plans AI-based code completion tool -report",
        "Author": "Reuters ",
        "Text": "(Reuters) - Apple plans to launch an artificial intelligence tool for completing lines of software code, Bloomberg reported on Thursday.\nThe tool would be similar to Microsoft's Copilot, which can complete lines and blocks of code based on the first parts of the code typed in by a developer, the news service reported. Apple could include the feature in its Xcode software as early as this year.\nApple gives away Xcode for free to software developers but charges $99 per year to submit apps to its app stores.\nBloomberg also reported that Apple is planning other AI features in its products, such as the ability to automatically create Apple Music playlists and slide decks in its business presentation software. The news service said a new version of Apple's \"Spotlight\" search feature on its devices could dig deeper into apps to control specific features of the apps.\nApple did not immediately respond to request for comment.\n(Reporting by Stephen Nellis in San Francisco; Editing by Cynthia Osterman)\n"
    },
    {
        "Date": "2024-02-27T19:47:47.000Z",
        "Title": "Apple Stock Could Notch New Record High",
        "Author": "  Fernanda Horner ",
        "Text": "Apple Inc (NASDAQ:AAPL) stock sports a 21.7% year-over-year lead, but is already down 6.5% in 2024. The shares are today pacing for their third-straight daily drop, last seen down 0.2% at $180.76, and have recently slipped back below familiar pressure at the $166 level. AAPL hit a Dec. 14, record high of $199.62, and thanks to a historically bullish trendline may soon notch a fresh peak.\nApple stock is within one standard deviation of its 260-day moving average. Per Schaeffer's Senior Quantitative Analyst Rocky White's data, the equity saw three similar signals in the past three years, defined for this study as having traded north of this trendline 80% of the time in the last two months, and in eight of the last 10 trading days.\nJust one month later after 67% of those instances, the security was higher, averaging an 11.8% gain. A comparable move from its current perch would place AAPL at a brand-new record high of $202.08.\n  \nNow looks like the right time to speculate with options, too, which are affordably priced. Apple stock's Schaeffer's Volatility Index (SVI) of 19% sits higher than 19% of readings from the last 12 months -- a relatively low reading.\n"
    }
]