[
    {
        "Date": "2024-03-08T16:32:20.000Z",
        "Title": "If You Invested $1,000 in Apple Stock in 2012, It Would Be Worth This Much Today",
        "Author": "  Josephine Nesbit ",
        "Text": "The past decade, or even several decades, have been good for Apple investors. According to Apple’s Q1 earnings report for 2024, company revenue is up 2%, while quarterly earnings per diluted share are up 16% year-over-year. But what if you invested $1,000 over a decade ago?\nCheck Out: 10 Valuable Stocks That Could Be the Next Apple or AmazonRead Next: 6 Genius Things All Wealthy People Do With Their Money\nOn March 9, 2012, Apple announced plans to reinstate its dividend. The day after, shares traded for around $600 each. If your broker allowed fractional share trading back then, you could have bought one and two-thirds shares for $1,000, according to The Motley Fool. Since then, Apple split its stock twice: 7-for-1 in 2014 and 4-for-1 in 2020. Consequently, you’d have 46 and two-thirds shares today from the original $1,000 purchase. Today, those shares would be worth $8,700.\n“Over the past 14 years [sic, as the Apple dividend was only reinitiated in 2012], you’d have received $361.65 in dividend payments. That brings your total return to more than nine-fold your original investment. But you could have done even better if you reinvested those dividends in more Apple shares as you received them. If you’d done that, you’d now have about 55 shares worth approximately $10,300,” The Motley Fool detailed.\nLearn More: I’m a Self-Made Millionaire — 5 Stocks You Shouldn’t Sell\nSponsored: Protect Your Wealth With A Gold IRA. Take advantage of the timeless appeal of gold in a Gold IRA recommended by Sean Hannity.\nEven if you didn’t invest in Apple in 2012, it’s not too late to capitalize on the company’s growth.\nAlthough Apple stocks are down this year, thanks to weak iPhone sales, The Fool noted that sales could come late this year with the release of the iPhone 16. Two business sectors have also recently given Apple’s sales and profits a boost: services and wearables, according to Investor’s Business Daily. In December, Apple’s services revenue increased 11% to $23.1 billion, and hardware sales rose to $96.5 billion. Apple’s services include the App Store, AppleCare, iCloud, Apple Pay, Apple Music, Apple TV+, Apple Arcade and other offerings.\nThe company is also cash-rich with modest debt. The Fool pointed out that Apple has a market capitalization of just under $3 trillion, and it’s the most profitable company in the world. On top of the company’s net income of $97 billion last fiscal year, it also got a little over $60 billion worth of cash or highly liquid cash-like holdings in its books. In terms of debt, the company has less than $100 billion in long-term debt, and $49 billion in other long-term liabilities. While this is a huge amount of debt, it’s not bad for a company of Apple’s size.\nThe Fool also noted that the company’s business model is evolving from a focus on devices to a cultural and solutions-oriented one. Apple is expanding its digital ecosystem, which drives hardware and software sales, so we could see a shift in the growth of its services branch.\nAnother reason to invest in Apple — it’s Apple. There may be declines over the short term, but the company has built one of the most loyal fanbases in the world over decades, and it’s unlikely to disappear.\nMore From GOBankingRates\nI'm a Shopping Expert: 9 Items I'd Never Put in My Grocery Cart\n9 Ways Frugal Retirees Spend Their Social Security Checks\nAvoid This Simple Banking Mistake That Could Cost You Over $1,000\n6 Things You Should Never Do With Your Tax Refund (Do This Instead)\nThis article originally appeared on GOBankingRates.com: If You Invested $1,000 in Apple Stock in 2012, It Would Be Worth This Much Today\n"
    },
    {
        "Date": "2024-03-26T09:00:00.000Z",
        "Title": "Apple CEO visits Hello Group Inc. and is impressed with inSpaze on Apple Vision Pro",
        "Author": "PR Newswire ",
        "Text": "BEIJING, March 26, 2024 /PRNewswire/ -- Mr. Cook, visited the headquarters of Hello Group Inc. (\"Hello Group\" or the \"Company\") on March 23, 2024, where Jia Wei, Senior Vice President of the Company, and Yi Ming, the head of inSpaze project, introduced Hello Group and its innovative social app 'inSpaze' on Apple Vision Pro. Mr. Cook commented that spatial computing has brought about new opportunities and the immersive social experience of inSpaze is truly impressive under the spatial computing power of Apple Vision Pro.\nAs the first spatial social app on Apple Vision Pro, inSpaze aims to recreate reality in the virtual world. Yi Ming demonstrated how inSpaze enables users to chat, share and play games in a social space that feels as real as face-to-face interactions. He mentioned that with the immersive experience created with inSpaze, users can reshape their social boundaries and experience the most realistic effects closest to the real world.\nFifteen years after the introduction of the iPhone in China, Hello Group launched the Momo app specifically designed for the iPhone, which was a great success. In February of this year when Apple Vision Pro was released in North America, Hello Group simultaneously launched the immersive spatial social app inSpaze specially designed for Apple Vision Pro based on visionOS. Jia Wei said that with inSpaze, Hello Group hopes to grow together with Apple once again.\nAbout Hello Group Inc.\nHello Group Inc. was founded in 2011 and listed on the Nasdaq Stock Market (NASDAQ: MOMO) in 2014. The company is a leading player in mainland China's online social networking space. Through Momo, Tantan and other properties within our product portfolio, the company enables users to discover new relationships, expand their social connections and build meaningful interactions. Starting from 2019, the company has incubated a number of other new apps, such as Hertz, SoulChill, Duidui, TieTie and inSpaze, which target more niche markets and more selective demographics.\nView original content:https://www.prnewswire.com/news-releases/apple-ceo-visits-hello-group-inc-and-is-impressed-with-inspaze-on-apple-vision-pro-302099154.html\nSOURCE Hello Group Inc.\n"
    },
    {
        "Date": "2024-03-18T15:00:16.000Z",
        "Title": "If Trump Is Elected, Here’s What You Should Do With Apple, Microsoft and Other Tech Stocks",
        "Author": "  John Csiszar ",
        "Text": "President Joe Biden and former President Donald Trump have already clinched the presidential nominations of their respective parties, making a rematch in the 2024 election a reality. Regardless of your own political views, as an investor, it’s a good idea to take note of who the next president will be, as it can affect your investments.\nRead Next: I’m a Self-Made Millionaire: 5 Stocks You Shouldn’t SellLearn More: One Smart Way To Grow Your Retirement Savings in 2024\nWhile the president doesn’t directly control the stock market, everything from tax changes, trade policies and even casual comments made while on the political trail can affect stock prices. And when big tech stocks like Apple and Microsoft comprise nearly 13% of the market cap of the S&P 500 all on their own, how tech stocks react to the president can have a big effect on the overall market.\nHere’s a look at how tech stocks have done under President Biden and his predecessor, and what the implications might be for Apple, Microsoft and other tech stocks if Biden doesn’t win a second term.\nSponsored: Protect Your Wealth With A Gold IRA. Take advantage of the timeless appeal of gold in a Gold IRA recommended by Sean Hannity.\nWhile the Nasdaq-100 index is often used as a proxy for the technology market, that index is also filled with non-tech stocks, such as healthcare and consumer products companies.\nTo compare the performance of tech stocks under the Trump and Biden presidencies, this analysis used the Technology Select Sector SPDR Fund, which is an exchange-traded fund with the symbol XLK. This $65 billion ETF is a true tech index that only includes stocks in technology hardware, storage, and peripherals; software; communications equipment; semiconductors and semiconductor equipment; IT services; and electronic equipment, instruments and components.\nOn the day Trump was inaugurated, Jan. 20, 2017, the XLK closed at 45.92. When Biden took office four years later, on Jan. 20, 2021, the ETF closed at 128.26. That translates to a gain of 179%.\nDiscover More: 8 Best Cryptocurrencies To Invest In for 2024\nIn a nutshell, tech stocks performed much better during Trump’s presidency than Biden’s. Even though Biden still has 10 months left in his presidency, the performance gap of tech stocks between the two presidents is vast.\nSince the XLK closed at 128.26 on the day that Biden took office, it has posted a return of 64.5%, closing at 211.02 on Mar. 13, 2024. This means that the performance of the XLK under Trump was nearly triple what it earned so far under Biden.\nThe S&P 500 index is often used as a proxy for the stock market as a whole, but it’s also heavily weighted towards technology. As of Feb. 20, 2024, the information technology sector comprised 29.4% of the entire S&P 500, more than the next two sectors — financials and healthcare — combined. Thus, analyzing the performance of the entire S&P 500 over a president’s term incorporates how both tech stocks and the general market are doing.\nBiden’s first term is not yet complete — he still has at least 10 months in office — but as of year-end 2023, the S&P 500 was up 25.9%. This makes it highly unlikely that his four-year performance will match Trump’s, as the S&P 500 returned 67% under the former president.\nWho resides in the White House should just be one of the considerations you factor into your investment analysis when it comes to stocks like Apple and Microsoft. Other factors, like earnings, interest rates, inflation and geopolitical turmoil can all drive stock prices up or down even more than who the president is. And let’s not forget — both presidents have dealt with the ramifications of a pandemic.\nBut there’s no denying that presidential policies can play a role as well. For example, according to Lee Munson, president of Portfolio Wealth Advisors, “Biden has not been friendly to China, but Trump’s going to be even worse … When you look at Trump, he’s mercurial and could just cut off the tap … and tell Nvidia they can’t sell anything.”\nChina is important for American tech stocks both due to its demand and its role in the supply chain, so a president’s policy towards China can move markets. However, again, this is just one factor that will affect big tech under the next president.\nWhile Trump might cause more trouble in China, TD Securities analysts note that corporate and personal taxes will likely remain higher under Biden than Trump. This could affect both demand for products and corporate earnings. Of course, this effect might be more than balanced out by falling inflation and interest rates, which may very well become tailwinds for stocks in the second half of 2024 and into 2025.\nThe best course of action is to continue to do your own research and due diligence and look to the long term. Apple and Microsoft will likely far outlast the next four years. If you believe in these specific stocks, tech stocks in general or the market at large, continuing to add to your positions — especially if they temporarily fall — is likely the best course of action.\nMore From GOBankingRates\nDownsizing for Retirement? Avoid These 6 Mistakes\n5 Rare Coins That Sold for At Least $600,000\nOne Simple Way to Earn More on Your Savings in 2024\nThe Biggest Mistake People Make With Their Tax Refund -- And How to Avoid It\nThis article originally appeared on GOBankingRates.com: If Trump Is Elected, Here’s What You Should Do With Apple, Microsoft and Other Tech Stocks\n"
    },
    {
        "Date": "2024-03-14T13:33:13.000Z",
        "Title": "Apple Stock Has 31% Upside, According to This Wall Street Analyst",
        "Author": "  John Ballard, The Motley Fool ",
        "Text": "After climbing 48% in 2023, Apple (NASDAQ: AAPL) stock has underperformed so far in 2024. The stock is down about 11% year to date, in part, due to worries regarding slowing iPhone sales in China. However, one Wall Street analyst sees this price dip as a buying opportunity.\nEarlier this week, Bank of America Securities analyst Wamsi Mohan renewed his $225 price target on the stock. That price target represents a potential upside of about 31% in the next 12 months or so over the current share price of $171.\nA recent report from Counterpoint Research showed that iPhone sales in China fell 24% year over year in the first six weeks of the year. This seems to be what is weighing on the stock right now, but Mohan noted that Apple has an important option for dealing with this.\nApple does an effective job of lowering the prices of its older phones to maintain steady demand, according to Mohan. The analyst also says Apple's long-term trend of shifting customers toward higher-value units can help offset weak sales in China. China generated 21% of Apple's operating profit last quarter.\nChina sales are getting the blame for the stock's recent performance, but the shares were due for a correction. The stock traded at a high price-to-earnings ratio of 32 at the end of 2023 and now trade at a more reasonable P/E of 27, which is still higher than the market average.\nDespite weakness in China, Apple's earnings per share grew 16% year over year last quarter, mostly driven by growing revenue in the higher-margin services category, and the company's ongoing share repurchases.\nIt might take a while for the market to come around, but Apple has plenty of strengths outside of China to deliver returns to investors.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. John Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Bank of America. The Motley Fool has a disclosure policy.\nApple Stock Has 31% Upside, According to This Wall Street Analyst was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-16T09:00:00.000Z",
        "Title": "Young talent gave us Microsoft, Apple and Facebook—but today, Gen Z bosses say they are treated as the butt of generational jokes: ‘You look like a child, are you sure?’",
        "Author": "  Eleanor Pringle ",
        "Text": "Steve Jobs was a 21-year-old college dropout when he founded Apple. 20-year-old Bill Gates launched Microsoft, and Mark Zuckerberg was 19 when he first came up with the idea of Facebook. Their present-day equivalents—today's Gen Z entrepreneurs—want the same opportunity to innovate, but keep coming up against stereotypes they can't avoid.\nOf course, the legacies built by the aforementioned trio didn't come without decades of hard work. But had these young hopefuls not gained the respect—and financial backing—of their older peers early on, society might never have known the iPhone, Excel or the 'like' button.\nTwenty years later and for the first time, Gen Z founders have reached the age—at the upper end of the 11-to-27-year-old spectrum—where they have the experience and ability to launch the first wave of disruptors for their own generation.\nYet in a post-pandemic world, the workforce is facing inter-generational friction. Just ask actress Jodie Foster, who said younger peers can be \"annoying\" to work with or the managers who say they're \"difficult.\"\nSo it's perhaps no wonder that the GenZ bosses Fortune spoke to said they have received something of a mixed reaction to their own forays into entrepreneurship.\nThe phenomenon of being dunked on by older generations isn't new—ask the millennials accused of missing out on affordable housing because they spent all their spare cash on avocados and oat milk lattes.\nBut while Gen Z can wait for time to dispel the notion that they're social media-obsessed and work-shy, investors may already have missed out on the next big thing.\nWhen Nicole Rechtszaid sits down with prospective clients for her L.A.-based social commerce company it's a \"coin toss\" as to whether they'll believe she has the experience she claims to.\nThe founder of Ghost Agency already has a raft of major clients under her belt, having worked with TikTok for a number of years before taking on the likes of Alo Yoga, G Fuel Energy and a wide range of content creators.\nRechtszaid's CV is unusual—after all, she has more than a decade's worth of experience working with streaming platforms since landing her first salaried contracts on Twitch at the age of 14.\nBut even with her wealth of knowledge, her meetings are often sprinkled with a dose of distrust.\nShe explained: \"About half the time a prospective client will say to me: ‘But you look so young? I don’t believe that you actually did all this.’ Or ‘You look like a child, are you sure?’ They think it’s funny.\"\n\"I try and make a joke out of it because I don’t want to make them uncomfortable,\" the 24-year-old told Fortune. \"I don’t think it’s usually done with malintent but they definitely are saying to themselves: ‘This person is less professional or less experienced than competitors that I’m meeting with.’\"\nBeing a Gen Z boss at the moment is out of the ordinary: less than 10% of the entire U.S. workforce fell into this demographic in 2020 according to Purdue Global, but this figure is expected to rise to around 30% by 2030.\nIn cases where Nicole and her 37-year-old co-founder Jenny Woo need to \"convince\" partners of their abilities, they've realized it simply isn't worth it: \"There are going to be companies that get it, and companies that absolutely do not understand.\"\nOn the other side of the Atlantic, Meagan Loyst has unique insight into the brightest minds of her generation courtesy of her organization, GenZ VCs, and its 28,000 members.\nLoyst, a New Yorker currently studying at the University of Oxford, created the platform three years ago to bring together like-minded individuals wanting to gain advice on investing, as well as entrepreneurs looking to expand their networks.\nThe CEO born in 1997 said the marketplace's preoccupation with millennial-era college hotshot founders is now giving way to investors more concerned with derisking.\n\"This notion of funding young, smart founders coming out of elite universities has been perpetuated for a long time,\" Loyst said, citing Mark Zuckerberg and Snap's Evan Spiegel.\nYet in the current macroeconomic environment, Loyst echoed Rechtszaid's belief that youth is no longer seen as a guarantee for innovation—it's a red flag.\n\"This is not everyone but investors are going back to repeat founders, those who have already seen success, because it helps derisk,\" she said.\n\"It’s negatively impacting young founders who have less experience: the onus falls on them to establish their credibility early and be able to articulate that in a very serious way.\n\"If you’re already seeing investors pulling back… and you know that the odds are stacked against you, you have to go above and beyond.\"\nAnother dynamic between Gen Z bosses and their inter-generational teams is at play: social media.\nGen Z is a group who have never known a world without Facebook, born in the era of the baby influencer with everything from their day of birth to their high school graduation snapped online.\nThough battling loneliness and isolation, they're a generation accustomed to being highly visible, with Loyst saying this can work \"for you, towards you or against you.\"\nAn influencer herself, she echoed Rechtszaid: \"People can come to a conversation with preconceived notions around what you know vs what you don’t.\"\nAt Ghost Agency, Rechtszaid said the sunnier side to the age debate is that some clients acknowledge her company simply knows more about the subject.\nWhether it's because she's got more experience with the platform, understands the demographic her client is trying to reach, or has a team built to achieve these aims, Rechtszaid wants to make sure the reasons her clients trust her are exemplified in the make-up of her team.\nWith six full-time staff expected to be on the books by the end of spring, Rechtszaid said her hiring technique was centered around individual growth.\n\"Determination, motivation and really an understanding of the space is all that we care about,\" when looking for staff, she said. \"At that point, we feel people can be trained and molded into understanding how to take on a manager role or a director role.\n\"It’s not that challenging to understand how to shift from something you’ve done before to learning how to communicate it with other people, as long as you have the desire.\"\nThis story was originally featured on Fortune.com\n"
    }
]