[
    {
        "Date": "2024-04-09T20:37:20.000Z",
        "Title": "Apple Stock Has 47% Upside, According to 1 Wall Street Analyst",
        "Author": "  Rich Smith, The Motley Fool ",
        "Text": "Apple (NASDAQ: AAPL) stock is in a funk. Concerned by the company's late arrival to the artificial intelligence (AI) game (and its consequent need to iPhone Google for help), share prices of the iEverything stock are down about 12% since the start of 2024.\nAnd that's not all. Investors also seem worried Apple has lost its mojo in China. Last summer, the Chinese Communist Party banned the use of Apple iPhones in government offices, giving Chinese consumers a none-too-subtle cue that Apple is persona non grata in the Middle Kingdom.\nWedbush Securities analyst Daniel Ives called this \"one of the more difficult China demand environments seen the last five years,\" in a note covered on TheFly.com on Tuesday. And yet, Ives suspects Apple will come out on top -- and urges investors not to miss the \"forest for the trees.\"\nApple's still a buy, insists Ives, and with a $250 target price, he's predicting the stock will gain 47% over the next 52 weeks.\nIs Ives right? The analyst argues Apple has a \"golden installed base\" of 1.5 billion iPhones in use around the world -- a big fanbase of potential buyers of its upcoming iPhone 16, and a bigger market for Apple services on all those devices. And yet, there's another way of looking at this.\nWhat if those 1.5 billion users are already happy with their iPhones? What if a lot of them decline to upgrade to iPhone 16, and some of them even decide to switch to Android?\nWith nearly 1-in-4 persons around the world already owning an iPhone, the simple fact that Apple has already penetrated so much of the mobile phone market makes it that much harder for the company to keep growing quickly. Indeed, long-term forecasts see Apple's earnings growing barely 10% a year over the next five years. That's not particularly fast for a supposed growth stock costing a rich 26 times earnings, like Apple.\nIves may think this stock has another 47% of stock appreciation in it. But I have my doubts.\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of April 8, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Rich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Apple. The Motley Fool has a disclosure policy.\nApple Stock Has 47% Upside, According to 1 Wall Street Analyst was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-30T12:00:00.000Z",
        "Title": "Apple Stock is a Top Holding in These Tech ETFs",
        "Author": "  Kent Thune ",
        "Text": "Consumer electronics giant Apple Inc. announces its latest financial results post-market Thursday amid various headwinds, including missed growth expectations, increased competition and increasing perceptions that it is not as innovative as it once was.\nAPPL stock rose 3% on Monday amid investor hopes that the Cupertino, Calif.-based company would build on the same artificial intelligence momentum that has recently swept Microsoft and other tech firms upward. But AAPL is down nearly 12% for the year.\nThis poor performance has been a drag on many tech-focused exchange-traded funds this year. For example, the Vanguard Information Technology ETF (VGT) started the week up a modest 4.4% year-to-date, which lagged the 7.3% gain on the SPDR S&P ETF Trust (SPY).\nApple, Inc. (AAPL) stock is down in 2024 for many reasons. Here's a breakdown of some potential factors that some analysts say are contributing to the stock price decline:\nMissed growth expectations: While Apple maintains a massive installed user base, its product sales, particularly iPhones, were down 19% in the first three months of 2024. This has led to investor disappointment and a decline in stock price.\nCompetition: Renewed competition from Huawei, particularly in the Chinese market, is putting pressure on Apple's smartphone dominance. Huawei's resurgence with its advanced 5G technology disrupts Apple's market share, especially in a critical country like China.\nInnovation shortfall: Apple is battling a rising perception among investors that Apple hasn't delivered groundbreaking innovations recently. Compared to previous years with product launches like the Apple Watch or AirPods, there is a lack of excitement surrounding newer offerings, leading to a less bullish outlook.\nTech sector slowdown: The technology sector hasn't performed as well as some other sectors in 2024. This broader slowdown might be affecting AAPL stock along with other tech giants.\nValuation concerns: Apple's stock price might have reached a point where some investors believe it's overvalued compared to its current growth prospects. The AAPL price-earnings ratio is approximately 26, which is not extreme, but is slightly above the 20-25 average range for growth stocks.\nTicker\nFund\nExpense Ratio\nAUM\nAAPL Allocation\nVGT\nVanguard Information Technology ETF\n0.10%\n$62.6B\n21.5%\nXLK\nTechnology Select Sector SPDR Fund\n0.09%\n$61.9B\n19.9%\nFTEC\nFidelity MSCI Information Technology Index ETF\n0.08%\n$9.2B\n19.6%\nIXN\niShares Global Tech ETF\n0.41%\n$4.2B\n18.1%\nIYW\niShares U.S. Technology ETF\n0.40%\n$15.7B\n15.2%\nData as of April 25, 2024. Leveraged ETFs were excluded from this list. See the full list of ETFs holding AAPL stock.\nAnalysts' forecasts for AAPL stock in 2024 are mixed, but generally lean toward moderate growth, as Apple remains a valuable company with a strong brand and loyal customer base. Here's a breakdown of what analysts are saying:\nAverage price target: As of April 29, 2024, analyst consensus suggests an average price target for AAPL in the range of $200 to $207 per share, according to TipRanks. This represents a potential upside of roughly 15-20% from its most recent price of about $174.\nVaried opinions: While the average price target indicates potential growth, individual analyst forecasts can vary significantly. Some analysts might be more bullish, predicting higher price points, while others might be more cautious with lower targets.\nFocus on revenue and earnings: Analyst forecasts often consider factors like projected revenue, earnings per share (EPS), and overall company performance. Apple's recent sales figures, particularly in China, might be leading some analysts to revise their forecasts downward.\nWhile Apple's stock is down year-to-date in 2024, it's important to consider its long-term performance and remember that the overall stock market can be volatile in the short term as economic conditions fluctuate.\nIt's always wise to conduct your own research and consider your investment goals and risk tolerance before making investment decisions.\n\nPermalink | © Copyright 2024 etf.com. All rights reserved\n"
    },
    {
        "Date": "2024-04-15T16:11:59.000Z",
        "Title": "Global iPhone shipments drop nearly 10% as Apple's 2024 woes continue",
        "Author": " Daniel Howley    · Technology Editor",
        "Text": "Global shipments of Apple’s (AAPL) iPhone fell nearly 10% in the first quarter despite a broader smartphone market recovery as the company continues to contend with rising challengers from China such as Xiaomi.\nAccording to market intelligence firm IDC, Apple’s Q1 shipments fell 9.6% year over year from 55.4 million units in the first quarter of 2023 to 50.1 million units in Q1 this year. The company’s overall global market share also slipped from 20.7% to 17.3%.\nShares of Apple were off by less than 1% Monday morning.\nApple wasn’t the only company to face headwinds in the quarter. Samsung, the world’s largest smartphone maker, also saw shipments decline, though by just 0.7%.\n\"The smartphone market is emerging from the turbulence of the last two years both stronger and changed,\" IDC research director Nabila Popal said in a statement.\n\"Firstly, we continue to see growth in value and average selling prices (ASPs) as consumers opt for more expensive devices knowing they will hold onto their devices longer. Secondly, there is a shift in power among the Top 5 companies, which will likely continue as market players adjust their strategies in a post-recovery world.”\nWhile Apple is still the second largest smartphone maker in the world by shipment volume behind Samsung, Chinese firms like Xiaomi and Transsion are gaining momentum in the market. Xiaomi saw shipments rise 33.8% in the quarter to 40.8 million units, while Transsion shipments increased 84.9% to 28.5 million units.\nApple’s China business has been a thorn in the company’s side over the last two quarters. iPhone revenue fell 13% in the first quarter of the year and is expected to drop again when the company reports its Q2 earnings on May 2.\nChina is Apple’s third-largest market behind the Americas and Europe, making the region especially important for the company’s success.\nThe ongoing geopolitical tensions between the US and China are also adding to Apple’s difficulties. According to Bloomberg, Chinese officials are increasingly telling workers not to use iPhones or other foreign-made phones in the office.\nApple is also working to wean itself off China as its main manufacturing hub. The company is increasingly looking toward Vietnam and India to take on a larger portion of its manufacturing capabilities. CEO Tim Cook posted a series of photos of himself in Vietnam on Monday to X, formerly Twitter.\nApple is facing a series of challenges ranging from declining iPad and Wearables sales to the Department of Justice’s antitrust lawsuit claiming that Apple purposely works to harm competition in the smartphone space. The European Union’s European Commission also hit the company with a $2 billion fine related to antitrust concerns about streaming music. The tech giant is also facing a potential $1 billion lawsuit in the UK related to fees it charges developers that sell apps through the App Store.\nApple shares have taken a beating so far this year, with the stock falling more than 8% since January. Shares of the company are up just 6% over the last 12 months, while the S&P 500 is up more than 20%.\nBut things could start to turn around for the company in the latter half of the year. Apple is widely expected to announce some form of generative AI-based capabilities during its WWDC developer conference in June. If Apple implements the technology in a new and interesting way, it could provide a boost to iPhone, iPad, and Mac sales.\nStill, it’s unclear exactly what Apple will have on offer when it comes to generative AI, and there’s no guarantee it will be a massive success. Google (GOOG, GOOGL) and Samsung have already started introducing the technology on their smartphones, but it’s largely meant for manipulating photos and quick translation.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nClick here for the latest technology business news, reviews, and useful articles on tech and gadgets\nRead the latest financial and business news from Yahoo Finance.\n"
    },
    {
        "Date": "2024-04-26T16:00:30.000Z",
        "Title": "How Another Trump Presidency Might Affect Your Apple Investment",
        "Author": "  John Csiszar ",
        "Text": "No president has any direct control over the stock market, in spite of the fact that many claim that a booming stock market is a result of their own actions. But it’s certainly true that governmental trade policies, tax changes and even offhand presidential comments can affect how specific stocks or even the market overall perform over the short term. This is particularly true in the case of Donald Trump, who is famously outspoken and who references the stock market’s performance more than most presidents.\nRead More: Trump-Era Tax Cuts Are Expiring — How Changes Will Impact RetireesFind Out: 5 Genius Things All Wealthy People Do With Their Money\nRegardless of your own view on politics, as an investor, it’s important to keep your eye on all potentially market-moving events, including the November 2024 presidential election. If Trump were to be re-elected, he may reinstate some of the policies from his first term and this could affect big tech stocks like Apple, among others. With that in mind, here’s a look at how Apple did under Trump’s presidency and how another term might affect your Apple investment.\nAlso see how another Biden presidency might affect your Apple investment.\nSponsored: Protect Your Wealth With A Gold IRA. Take advantage of the timeless appeal of gold in a Gold IRA recommended by Sean Hannity.\nTrump’s first day in office was January 20, 2017. On that day, Apple closed at a price of $27.88. When Trump handed over the reins to Joe Biden on January 20, 2021, Apple closed at $129.57. This amounts to a return of 365%.\nAn interesting note is that Apple’s share price as of April 24, 2024 was just $169.02, meaning in the three-plus years since Trump left office, Apple has “only” returned 30%.\nFor You: 10 Valuable Stocks That Could Be the Next Apple or Amazon\nApple is often the biggest stock in the S&P 500, but as it has fallen in 2024 as the broad market has advanced, it has slipped to the number two position, behind tech giant Microsoft. Still, Apple comprises 5.76% of the entire S&P 500, so it can have a huge effect on the market overall.\nThus, even if you only own an S&P 500 index fund and don’t own Apple directly, any Trump policies affecting Apple can also push your investment higher or lower. By way of reference, the S&P 500 index returned 67% during President Trump’s term.\nTrump already has a complicated relationship with Apple and that’s likely to continue if he’s re-elected in November. When Trump unleashed his stiff tariffs on China — one of the signature policy pieces of his term in office — Apple got caught in the crossfire, as China is one of its biggest suppliers. As the company tried to find a way to avoid paying tariffs, as reported by The New York Times, Trump laid down the gauntlet in a July 26, 2019 tweet, saying “Apple will not be given Tariff waiver, or relief, for Mac Pro parts that are made in China” and that the company should “Make them in the USA, no Tariffs!”\nHowever, over time, Apple managed to avoid most of these tariffs. In August 2019, Trump said “I had a very good meeting with Tim Cook […] Tim was talking to me about tariffs and one of the things, he made a good case, is that Samsung is their number one competitor and Samsung is not paying tariffs because they’re based in South Korea. And it’s tough for Apple to compete with a very good company that’s not.” Ultimately, Apple was able to avoid tariffs on its flagship iPhone, iPad and MacBook products and by March 2020, the Apple Watch joined that list as well.\nWhether or not these exemptions hold up if Trump is re-elected is anyone’s guess. As Lee Munson, president of Portfolio Wealth Advisors said, “Biden has not been friendly to China, but Trump’s going to be even worse…When you look at Trump, he’s mercurial…” What this means is that it’s a gamble whether or not Trump will reinstate tariffs and if they will directly affect Apple this time around.\nWhether the next president will be Trump or Biden is just one of the factors you should consider when looking at a stock like Apple. While things like tariffs and Department of Justice investigations can affect individual stocks, many things beyond a president’s control, such as interest rates, inflation, geopolitical turmoil and corporate earnings also play a big role in determining stock prices. For example, while tariffs on China might be an impediment for Apple, falling interest rates and/or inflation, as many predict for 2024 and 2025, would be tailwinds for the stock.\nIf you’re a long-term investor, you should take into account who’s in the White House, but you should balance this against product development and long-term earnings trends. If you believe Apple is an innovative company that can survive, adapt and continue to grow in any environment, then it shouldn’t matter if Trump wins re-election or not. On the other hand, if you feel Apple’s best days are behind it, you should likely sell the stock no matter who the president is.\nMore From GOBankingRates\nI'm a Shopping Expert: 9 Items I'd Never Put in My Grocery Cart\n10 Cars That Outlast the Average Vehicle\nThis is One of the Best Ways to Boost Your Retirement Savings in 2024\n7 Things You'll Be Happy You Downgraded in Retirement\nThis article originally appeared on GOBankingRates.com: How Another Trump Presidency Might Affect Your Apple Investment\n"
    },
    {
        "Date": "2024-04-28T17:56:47.000Z",
        "Title": "Apple looks to Southeast Asia, India as hedge against China difficulties",
        "Author": " Daniel Howley    · Technology Editor",
        "Text": "Apple (AAPL) CEO Tim Cook toured Southeast Asia last week, visiting Vietnam, Indonesia, and Singapore, as part of a multiday trip geared toward reducing Apple’s reliance on China as its central manufacturing hub.\nAnd while Apple isn’t looking to abandon China — Cook spent a number of days in the country just last month — the company is hedging against the potential for future manufacturing roadblocks in the region.\nAt the same time, the company is slowly setting its sights on India as its next major growth opportunity now that China has become a more mature smartphone market.\n“Apple is in the beginning stages of a decade[-long] transition away from reliance on China and diversify that to other countries in Southeast Asia on both the manufacturing front and the demand front,” Deepwater Asset Management managing partner Gene Munster told Yahoo Finance.\nBut reducing Apple’s dependence on China for building its devices and growing its market share could take some time.\nChina accounts for a disproportionate amount of Apple’s supply chain partners such as Foxconn and Pegatron. That concentration of manufacturing capacity in one area proved especially damaging during the pandemic when China forced factories to shut down, limiting Apple’s ability to build and ship devices.\nOnce capacity came back online, Apple was able to meet consumer demand again. But the fact that a factory closure had such an impact on the company was a troubling sign of fragility in its supply chain.\n“Apple basically said they fulfilled about $5 billion of back revenue on the last conference call,” BofA Securities analyst Wamsi Mohan told Yahoo Finance. “That's $5 billion for one facility shut down in China.”\nLeft unchecked, that lack of supply chain resiliency could come back to bite Apple again given the gloomy state of the US and China’s relationship and tit-for-tat maneuvers the countries are making with regard to their respective tech companies. The US has tried to box out Huawei from getting access to high-end processors and is working to get ByteDance to sell TikTok, while China is reportedly requiring state employees to ditch devices made by Western companies.\n“We see Cupertino going aggressively after [Southeast Asian] countries on the supply front,” Wedbush analyst Dan Ives told Yahoo Finance. “Cook is hedging his bets as China remains a very dicey situation for Apple while Vietnam and Indonesia are soft landing spots for iPhone production.”\nApple’s problems in China extend beyond manufacturing complexities. The company is also contending with a slowdown in iPhone sales in the region as economic growth flags and regional rivals grab market share.\nGreater China is Apple’s third-largest market by revenue behind the Americas and Europe. But iPhone sales in the region are slowing. In Q1, Apple reported revenue in Greater China fell 13% year over year, and that’s after falling 2% for all of 2023. Apple previously reported 9% growth in the region in 2022.\nChina is also a relatively mature smartphone market, making massive growth gains a difficult proposition, which is where India comes in.\nThe most populous country in the world, India has a growing middle class that could prove to be a boon for Apple.\n“China took probably five years before it really mattered,” Munster explained. “India probably takes 10 years, and the reason is they've got the population on their side, but the GDP per capita is about a quarter in India what it is in China. And so just in general, people don't have … the same wealth in India as they do in China.”\nApple opened its first official store in India last year, with Cook himself kicking off the festivities for the Mumbai location. Apple also builds some of its latest iPhones in the country, making it even more important for the company.\nEmerging markets like India are going to be key to Apple’s growth in the coming years, as its larger markets continue to mature and growth declines. The company has been telegraphing that much as well. In earnings calls, executives repeatedly point to emerging markets as growth areas during earnings calls, with Tim Cook specifically pointing to the likes of India and other growth markets in his opening remarks during Apple’s Q1 call.\nStill, Apple’s push to expand its manufacturing and market share outside of China will take years. So, for the foreseeable future, the company will have to continue to rely on China and figure out how to make the best of it.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finance.\n"
    }
]