[
    {
        "Date": "2024-05-29T14:40:22.000Z",
        "Title": "Apple's Southeast Asia Growth: New Kuala Lumpur Store Set to Open In June",
        "Author": "  Anusuya Lahiri ",
        "Text": "Apple Inc (NASDAQ:AAPL) will open its first retail store in Malaysia on June 22 at The Exchange TRX mall in Kuala Lumpur, expanding its presence in Southeast Asia.\nThis new store aims to boost sales and operations outside of China. Apple already has stores in India, Thailand, and Singapore.\nMalaysia is becoming increasingly important for Apple in both production and sales, Bloomberg reports.\nAlso Read: Taiwan Semi Leverages Asian Expertise and Culture for Chip Manufacturing Edge\nThe company began producing some Macs in Malaysia a few years ago and manufactures iPhones in India and AirPods in Vietnam.\nThe new store has been under construction for several years, with hiring starting early last year.\nApple initially planned the opening for February. CEO Tim Cook visited Southeast Asia in April to promote regional growth in Singapore, Indonesia, and Vietnam.\nRecent reports indicated Apple consolidating its relationship with China while expanding in Southeast Asia and India.\nIn 2023, Apple boosted its number of China-based suppliers and manufacturing sites, lowering its reliance on suppliers from Taiwan, the U.S., Japan, and South Korea.\nApple stock gained over 7% in the last 12 months. Investors can gain exposure to the stock via Fidelity MSCI Information Technology Index ETF (NYSE:FTEC) and Vanguard Information Tech ETF (NYSE:VGT).\nPrice Action: AAPL shares traded higher by 0.01% at $190.01 premarket at the last check on Wednesday.\nImage Source – Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Apple's Southeast Asia Growth: New Kuala Lumpur Store Set to Open In June originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-05-07T14:53:39.000Z",
        "Title": "Apple debuts iPad Pro with M4 chip as company looks to turn around sales",
        "Author": " Daniel Howley    · Technology Editor",
        "Text": "Apple (AAPL) debuted its latest lineup of iPads during a virtual launch event on Tuesday. The new tablets include more powerful versions of the $999 11-inch and $1,299 13-inch iPad Pro outfitted with Apple's M4 chip and more vibrant OLED displays, and an upgraded iPad Air, which gets a 13-inch screen option to go along with the existing 11-inch version.\nThe company also unveiled the latest version of its Apple Pencil stylus complete with a new haptic feedback feature and an updated Magic Keyboard case for the iPad Pro line.\nThe new iPad Pros come equipped with Apple's new Ultra Retina XDR displays, which use OLED technology to improve overall color quality. Apple says the screens, its most advanced yet, use two OLED panels to form what the company calls its Tandem OLED panel.\nOLED panels are known for their exceptional color quality, but they're also thinner than traditional LCD screens. That, Apple says, makes the 10.9-inch iPad Pro just 5.3mm thick and the 13-inch model just 5.1mm thick, making it the company's thinnest device ever.\nIn addition to their new screens, the iPads come with Apple's new M4 chip. The first device to get Apple's latest silicon, the chip makes the latest iPad Pro 4 times faster than the iPad Pro with Apple's M2 processor and 10 times faster than the original iPad Pro.\nThe M4 runs on Apple's second-generation 3-nanometer technology and features up to four performance cores for heavy-duty processing and six efficiency cores for less resource-intensive applications. The company says the M4 provides up to 50% faster CPU performance than the M2 in the iPad pro. On the graphics side of things, Apple says the M4 has a 10-core GPU and provides four times faster graphics performance than the M2.\nApple also hinted at its AI ambitions, saying that the M4's new 16-core neural engine is more powerful than any neural processing unit in any PC today. Intel, AMD, and Qualcomm are all putting neural processing units into their latest processors to power onboard AI applications. Apple, however, was quick to point out that it's been adding neural engines to its processors for years, implying that it has a significant lead in the space.\nThe iPad Air, Apple's mid-range tablet, now comes with a 13-inch screen option to go along with the standard 11-inch model. Apple says roughly half of iPad Pro consumers opt for the larger 13-inch iPad Pro, giving them a reason to go for the larger screen option.\nThe front camera is now in the center of the side bezel, so you can use it in landscape mode while making FaceTime calls, and sports spatial audio. The 13-inch model gets double the base of the 11-inch.\nBoth iPad Airs now come with Apple's M2 chip, making it 50% faster than the prior iPad Air with the M1 chip and 3x faster than the A14-equipped Air. The Air also works with Apple's Magic Keyboard and the Apple Pencil stylus. The 11-inch iPad Air starts at $599, while the 13-inch version starts at $799.\nDuring Tuesday's event, Apple also unveiled its Apple Pencil Pro stylus. The accessory, priced at $129, now includes a haptic feedback feature that produces a slight vibration to let you know when you've successfully selected something on the screen. There's also a built-in gyroscope that lets you roll the Apple Pencil Pro to choose specific inputs in drawing and painting apps. Find My compatibility also means you can quickly locate your pencil if you misplace it.\nApple's latest iPads come as the product line is mired in a sales slump. In 2022, the company reported iPad revenue of $29.29 billion, down 8% from the $31.86 billion it brought in in 2021. Declines continued in 2023, though they were less severe, with sales falling 3% on the year.\nSales continued to falter in Q1 and Q2 this year, dropping 22% and 17%, respectively. Apple's latest tablets, however, should give the lineup a much-needed sales boost.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nClick here for the latest technology news that will impact the stock market.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-05-18T08:07:00.000Z",
        "Title": "1 Unstoppable Stock That Could Join Microsoft, Apple, Nvidia, Alphabet, Amazon, and Meta in the $1 Trillion Club",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "Since early last year, it's become crystal clear that advancements in artificial intelligence (AI) are causing a paradigm shift in technology. Nowhere is that more evident than in the list of companies that are among the world's most valuable, measured in terms of market cap.\nMicrosoft made headlines over the past year or so with its definitive moves in generative AI and is currently the only company with a market cap above $3 trillion. Apple has been toying with AI for years, and while it ceded its market cap crown to Microsoft, it continues to cling stubbornly to second place, worth $2.9 trillion. Nvidia has moved up the ranks quickly thanks to its industry-leading AI-centric computer chips, currently worth $2.3 trillion. Alphabet, Amazon, and Meta Platforms round out the other top 10 AI players, with market caps of between $2.1 trillion and $1.2 trillion.\nWith a market cap of roughly $789 billion (as of this writing), it seems clear that Taiwan Semiconductor Manufacturing (NYSE: TSM), often referred to as TSMC, is bucking for membership in this elite fraternity. Given the accelerating demand for the semiconductors needed for AI, TSMC's admittance might come sooner than later.\nAs the world's largest contract chipmaker, TSMC is in an enviable position in the industry. The company doesn't make semiconductors for its own use, but rather is contracted to make them for big tech companies, including Nvidia, Arm Holdings, Advanced Micro Devices, and Apple, among others.\nOnce upon a time, the bulk of TSMC's revenue came from processors used in smartphones, but high-performance computing (HPC), which includes chips used for AI, has taken the top spot, recently accounting for 46% of revenue.\nBusiness is picking up. In the first quarter, revenue climbed 16.5% to $18.9 billion, while its earnings per share (EPS) of $1.38 edged 5% higher. Management is expecting its accelerating growth to continue, forecasting second-quarter revenue of $20 billion at the midpoint of its guidance, which would represent growth of 28%.\nTSMC is in an enviable position in the AI revolution. It's a foundry partner to the AI stars, and since it makes chips for all comers, it's not a part of the fierce competition for AI chip supremacy. Given its position in the space and its current size, I don't think it will take very long to join the society of trillionaires.\nAccording to Wall Street, TSMC is poised to generate revenue of $84.8 billion in 2024, giving it a forward price-to-sales (P/S) ratio of roughly 9.3. Assuming its P/S remains constant, TSM would have to grow its revenue to roughly $107 billion annually to support a $1 trillion market cap.\nInterestingly, Wall Street is forecasting revenue growth of 22% in both 2024 and 2025. If the company achieves those fairly reasonable benchmarks, it could easily achieve a $1 trillion market cap by 2026.\nThere could be much more to come. TSM's management expects the company's AI-related revenue to grow at a compound annual growth rate of 50% over the coming five years and account for 20% of TSM's total revenue by 2028.\nThat's not surprising, considering the magnitude of the opportunity. Generative AI is expected to generate economic value of between $2.6 trillion and $4.4 trillion annually over the coming decade, according to global management consulting firm McKinsey & Company. However, estimates continue to ratchet higher as more applications for AI join the mix.\nFinally, at just 24 times forward earnings, TSMC is attractively priced, giving investors an inexpensive way to profit from the AI revolution.\nBefore you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $578,143!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n1 Unstoppable Stock That Could Join Microsoft, Apple, Nvidia, Alphabet, Amazon, and Meta in the $1 Trillion Club was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-31T17:01:02.000Z",
        "Title": "The 10th-gen Apple iPad hits a low of $300, plus the rest of the week's best tech deals",
        "Author": " Jeff Dunn    · Senior Reporter, Buying Advice",
        "Text": "It's Friday, which means it's time for another curated roundup of the week's best tech deals. This week's selection is highlighted by a new low on Apple's entry-level iPad, which is down to $300 at Amazon with an on-page coupon. That's about $50 less than buying direct from Apple. Beyond that, a new PlayStation sale has cut $50 off the PlayStation 5 — and if you already subscribe to Sony's PlayStation Plus service, you can get a year of Netflix thrown in on top. We're also seeing discounts on year-long Peacock memberships, various Sonos speakers, the newest MacBook Air and Roku's Streaming Stick 4K, among other gadgets we recommend. Here are the best tech deals from this week that you can still buy today.\nFollow @EngadgetDeals on Twitter and subscribe to the Engadget Deals newsletter for the latest tech deals and buying advice.\n"
    },
    {
        "Date": "2024-05-06T10:10:00.000Z",
        "Title": "Apple, Amazon, Nvidia and Tesla are part of Zacks Earnings Preview",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – May 6, 2024 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Apple AAPL, Amazon AMZN, Nvidia NVDA and Tesla TSLA.\nWith Q1 results from Apple and Amazon now out, we only have Nvidia’s results still awaited at this stage of the ‘Magnificent 7’ group of companies. The sub-par growth numbers from Tesla and Apple notwithstanding, the Mag 7 group as a whole showed impressive top- and bottom-line growth numbers.\nIn fact, had it not been for the substantial earnings contribution from the Mag 7, Q1 earnings growth for the rest of the S&P 500 index would be in negative territory.\nIt is interesting to note here that the market reaction to the Tesla and Apple releases has thus far been the best of the group. This may look odd since Tesla’s Q1 earnings were down -53.4% from the year-earlier level on -8.7% lower revenues, and Apple’s earnings and revenue growth rates were -2.2% and -4.3%, respectively. But it isn’t surprising as both companies’ results proved better than what market participants had feared. We also need to keep in mind the impact of Apple’s blockbuster buyback announcement, the largest ever in history.\nUsing estimates for Nvidia, which will be coming out with its March-quarter results on May 22nd, and actual results for the other six members of the group, total Q1 earnings for the group are expected to be up +49% from the same period last year on +13.6% higher revenues.\nPlease note that the Mag 7 companies currently account for 29.9% of the S&P 500 index’s total market capitalization and are expected to bring in 21.2% of the index’s total earnings in 2024. For 2024 Q1, the Mag 7 group is on track to bring in 22.1% of all S&P 500 earnings.\nGiven their enormous earnings power and growth profile, it is hard to argue with the group’s market leadership.\nBeyond these mega-cap players, total Q1 earnings for the Technology sector as a whole are expected to be up +28.2% from the same period last year on +8.9% higher revenues.\nWe remain in the heart of the Q1 earnings season this week, with more than 1200 companies reporting results, including 54 S&P 500 members. This week’s notable reports include Disney, Uber, Lyft, Shopify, and others.\nThrough Friday, May 3rd, we have seen Q1 results from 400 S&P 500 index members, or 80% of the index’s total membership. Total Q1 earnings for these 400 index members are up +4.4% from the same period last year on +4.2% higher revenues, with 78.3% beating EPS estimates and 61% beating revenue estimates.\nLooking at Q1 as a whole, total S&P 500 earnings are expected to be up +5.3% from the same period last year on +4.3% higher revenues, which would follow the +6.8% earnings growth on +3.9% revenue gains in the preceding period.\nAs you likely know already, the Tech and Energy sectors are having the opposite effects on the aggregate growth picture. Excluding the Tech sector, Q1 earnings for the rest of the index would be down -2.2%, while the growth pace improves to +8.3% on an ex-energy basis.\nLooking at the overall earnings picture on an annual basis, total 2024 S&P 500 earnings are expected to be up +8.9% on +1.7% revenue growth.\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>> A Positive Earnings Picture Remains \nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]