[
    {
        "Date": "2024-06-10T21:39:10.000Z",
        "Title": "Apple debuts AI-generated … Bitmoji",
        "Author": "  Sarah Perez ",
        "Text": "An Apple Intelligence-powered feature coming in iOS 18 will allow iPhone users to create AI images of people they're messaging with — a feature that works something like an AI-upgraded Bitmoji.\nThe new offering will help to make your \"everyday conversations more enjoyable,\" according to Apple. It announced the new tech at WWDC 2024.\nApple Intelligence will have an understanding of who you're talking with in a messaging conversation, so if you want to personalize that chat with a custom AI image, you can create one on the fly.\nFor example, Apple showed off making an AI Bitmoji of a friend celebrating their birthday with an image that included cake, balloons and flowers. Another showed a mom dressed in a superhero cape to show off her kid's respect for her abilities.\nThe feature will support just three illustrative styles at launch: sketch, illustration and animation.\nIt's reminiscent of something a group of ex-Snap researchers were working on with their startup Easel, which was something of a next-generation Bitmoji. \nThe image-generation capabilities will also work across other apps like Notes, Freeform, Keynote and Pages, Apple says.\nLater in the keynote, Apple more formally announced Genmoji, a feature that lets you create AI emoji-like images of anyone from your Photos library or just custom emoji. The Genmoji can be used as a sticker for reacting to messages with a Tapback or inline with your messages, Apple said.\nAnother new feature, Image Playground — also available as a stand-alone app and API for developers — will allow users to create images using concepts like themes, costumes, accessories, places and more. You select the times you want to include and, moments later, the Apple Intelligence-powered feature will create a preview of your image.\nThere's no need to engineer the perfect prompt, the company notes.\nYou can swipe through the image previews and create more images by selecting different styles, like sketch, animation, or illustration, or switch back. Apple Intelligence will also suggest concepts related to your messages conversation, but all this takes place on the device, according to Apple.\nIn addition to generating images, Apple Intelligence will work across apps to allow for other functionality, like the ability to ask it to pull up the files you interacted with last week or the photos of a specific person. Or you may want to ask it to play the podcast someone recommended to you previously.\nIts understanding of apps and the actions included will make the feature more powerful as it will understand things like the details of your Calendar appointments alongside traffic information from Maps and more, providing a more personal context to your interactions.\nAlso at WWDC 2024, Apple announced updates to Siri and introduced macOS Sequoia.\nhttps://www.youtube.com/watch?v=Q_EYoV1kZWkThis article originally appeared on TechCrunch at https://techcrunch.com/2024/06/10/apple-debuts-ai-generated-bitmoji/\n"
    },
    {
        "Date": "2024-06-12T20:37:00.000Z",
        "Title": "Top Analyst Reports for Microsoft, Apple & Alphabet",
        "Author": "  Mark Vickery ",
        "Text": "Wednesday, June 12, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corp. (MSFT), Apple Inc. (AAPL) and Alphabet Inc. (GOOGL), as well as a micro-cap stock CompX International Inc. (CIX). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Microsoft’s shares have outperformed the Zacks Computer - Software industry over the past year (+31.8% vs. +23.7%). The company is riding on strong growth from Intelligent Cloud and Productivity and Business Processes. Intelligent Cloud revenues are driven by growth in Azure and other cloud services.Productivity and Business Processes revenues continue to rise due to the strong adoption of Office 365 Commercial solutions. Microsoft 365 Consumer subscribers grew to 80.8 million in the third quarter. Continued momentum in the small and medium businesses and frontline worker offerings, as well as a rise in revenue per user, drove top-line growth.However, the office's declining commercial licensing has been a headwind due to the continued customer shift to cloud offerings. Higher operating expenses and spending on Azure enhancements amid stiff competition in the cloud space remain a concern.(You can read the full research report on Microsoft here >>>)Shares of Apple have outperformed the Zacks Computer - Mini computers industry over the past year (+17.4% vs. +13.5%). The company is benefiting from increasing customer engagement in the services segment. The expanding content portfolio of Apple TV+ and Apple Arcade helped in driving subscriber growth. Apple’s top-line benefits from strong growth in emerging markets and growing adoption of its devices among enterprises.However, Apple’s near-term prospects remain foggy due to sluggish China sales amid stiff competition. It expects the June quarter’s (third-quarter fiscal 2024) revenues to grow low-single-digit year over year. Unfavorable forex is expected to hurt revenues by 2.5%.Apple has been playing catch-up in the AI space compared with Alphabet, Microsoft and Amazon, its peers in the “magnificent seven” group. Following the launch of Apple Intelligence, its competitive position is expected to improve.(You can read the full research report on Apple here >>>)Alphabet’s shares have outperformed the Zacks Internet - Services industry over the year-to-date period (+28.4% vs. +22.2%). The company’s robust cloud division is aiding substantial revenue growth. Expanding data centers, cloud regions and availability zones will continue to bolster its presence in the cloud space.Major search updates and removal of bad ads to enhance the search results continue to boost traffic on the company’s search engine. Growing momentum across Google’s mobile search is contributing further. Strengthening generative AI capabilities should aid business growth in the long term. Deepening focus on wearables category remains a tailwind. Expanding presence in the autonomous driving space is a plus.However, sluggish Network advertisement business is a negative. Increasing litigation issues and expenses remain concerns. Rising cloud competition from Microsoft and Amazon is a concern.(You can read the full research report on Alphabet here >>>)Shares of CompX International have outperformed the Zacks Office Supplies industry over the past six months (+18.2% vs. +10.8%). This microcap company with market capitalization of $292.45 million have a strong cash and marketable securities balance of $75.6 million as of Mar 31, 2024, ensures robust liquidity for operations and growth.CompX International also consistently pays dividends, with a recent 20% increase. The Security Products segment saw a 9% year-over-year sales increase in the first quarter of 2024, indicating strong demand. Efficient cost management in the Marine Components segment and aligning inventory with market conditions reflect operational efficiency.However, CompX faces a challenging 2024 outlook, particularly in the Marine Components segment, due to reduced demand and OEM customers cutting production. Security Products’ sales are expected to be lower, as a significant government project from 2023 is not anticipated to recur. Also, intense competition and dependency on key customers pose additional risks.(You can read the full research report on CompX International here >>>)Other noteworthy reports we are featuring today include NVIDIA Corp. (NVDA), Merck & Co., Inc. (MRK) and The Home Depot, Inc. (HD).Mark VickerySenior EditorNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nAdoption of Cloud & Office 365 Strength Aid Microsoft (MSFT)\nRobust Portfolio, Services Strength to Benefit Apple (AAPL)\nSolid Momentum in Cloud Business Benefits Alphabet (GOOGL)\nFeatured Reports\nKeytruda to Remain Merck's (MRK) Key Top-Line DriverThe Zacks analyst expects Keytruda to drive Merck's (MRK) sales and see strong growth for the next 2-3 years despite concerns of how it will grow its business once Keytruda loses patent exclusivity.\nHome Depot's (HD) Interconnected Strategy to Boost SalesPer the Zacks analyst, Home Depot has been benefiting from the execution of the \"One Home Depot\" plan focused on expanding supply chain facilities technology investments and enhancing digital business\nUber (UBER) Benefits From Delivery Business Amid High DebtThe Zacks Analyst likes Uber's efforts to expand its Delivery operations in response to the surge in business. However, high debt does not bode well for its bottom line.\nMondelez (MDLZ) Gains on Solid Chocolate & Biscuit CategoriesPer the Zacks analyst, Mondelez gains on core chocolate and biscuit categories, as they show resilience amid challenges. The company aims to derive most of its revenues from these categories by 2030.\nSteady Demand Buoy American Tower (AMT), Debt Woes LingerPer the Zacks Analyst, American Tower is witnessing steady demand at its towers owing to a surge in wireless services usage. Yet, a substantially leveraged balance sheet may hurt cash-flow generation.\nCadence (CDNS) to Benefit from Robust Portfolio & BuyoutsPer the Zacks analyst, Cadence's performance is powered by uptrend demand for the company's differentiated product portfolio. New products and synergies from acquisitions are expected to foster steady\nTC Energy's (TRP) C$34B Growth Projects to Boost EarningsThe Zacks analyst believes that TC Energy's C$34 billion of growth projects should support its earnings and dividend payouts but is worried over the massive debt of C$50.6 billion.\nNew Upgrades\nNVIDIA (NVDA) Rides on Strong Adoption of GPUs, PartnershipsPer the Zacks analyst, rapid adoption of NVIDIA's GPUs in the datacenter and automotive markets is a key growth driver. Partnership with companies like Arrow, Baidu, Daimler and Bosch is a tailwind.\nSolid Underwriting, Capital Deployment Aid RLI Corp (RLI)Per the Zacks analyst, RLI's solid portfolio, business expansion, rate rise, expanded distribution and operational strength drives profitability, in turn supports dividend hikes, special dividends.\nStrong Enrollments Growth Aids Strategic Education (STRA)Per the Zacks analyst, Strategic Education benefits from strong enrollment growth in USHE and ANZ segments. Also, focus on digital learning platforms and competency-based learning models bode well.\nNew Downgrades\nIntense competition, Strict Regulations Ail NRG Energy (NRG)Per the Zacks analyst, NRG Energy's operations are subject to extensive regulations at both federal and state levels. Strong competition in the wholesale power markets impede the company's growth.\nHigh Leverage & Capital Requirement to Ail Asbury (ABG)The Zacks analyst is worried about Asbury's long-term debt-to-capital ratio, which is higher than the industry's. Also, rising capital expenditure could adversely impact its near-term cash flows.\nHealthcare Industry Regulations Ail AMN Healthcare (AMN)The Zacks analyst is worried about AMN Healthcare being subjected to extensive federal laws and regulations. A tough competitive space is an added concern.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nMerck & Co., Inc. (MRK) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThe Home Depot, Inc. (HD) : Free Stock Analysis Report\nCompX International Inc. (CIX) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-11T05:41:55.000Z",
        "Title": "AI Tokens Failed To Rally After Apple Intelligence Announcement, Elon Musk Threatens Apple Device Ban",
        "Author": "  Hope C ",
        "Text": "Apple’s 2024 Worldwide Developers Conference saw the tech giant unveil “Apple Intelligence” — a suite of new generative AI features set to be included in iOS 18, iPadOS 18, and macOS Sequoia later this year. One of the key features revealed was Siri’s ability to relay user questions to ChatGPT when necessary, with user consent required before any data, documents, or photos are sent to the AI. The responses would then be delivered directly by Siri, powered by OpenAI’s latest iteration of ChatGPT, GPT-4o.\nHowever, the announcement of Apple Intelligence did not trigger a price rally for AI-linked cryptocurrencies. Render (RNDR), Fetch.ai (FET), and Bittensor (TAO) have all seen declines of 7.5%, 3.5%, and 6.6% respectively over the last 24 hours, despite the buzz around AI.\nMeanwhile, billionaire entrepreneur Elon Musk has threatened to ban the use of Apple devices at his companies if Apple integrates OpenAI’s ChatGPT into its iPhone, iPad, and Mac operating systems. Musk expressed his concerns via a post on X, formerly known as Twitter, on June 10. “If Apple integrates OpenAI at the OS level, then Apple devices will be banned at my companies. That is an unacceptable security violation,” Musk asserted. He even suggested that visitors to Tesla, Space Exploration Technologies Corp (SpaceX), and his other ventures would need to \"store their Apple devices in a Faraday cage\" upon entry to prevent any potential security breaches.\nMusk criticized Apple for relying on OpenAI instead of developing its own AI technology. “It is patently absurd that Apple isn’t smart enough to make their own AI,” he said. “They’re selling you down the river. Apple using the words ‘protect your privacy’ while handing your data over to a third-party AI that they don’t understand and can’t themselves create is *not* protecting privacy at all.”\n"
    },
    {
        "Date": "2024-06-14T17:53:17.000Z",
        "Title": "Apple, Meta set to face EU charges under landmark tech rules, sources say",
        "Author": "  Foo Yun Chee ",
        "Text": "By Foo Yun Chee\nBRUSSELS (Reuters) - Apple (AAPL)and Meta Platforms (META) will likely face charges for failing to comply with landmark EU rules aimed at reining in their power before the summer, three people with direct knowledge of the matter said on Friday.\nThe European Commission, which launched investigations into the two companies and Alphabet's Google in March under the Digital Markets Act (DMA), sees Apple and Meta as priority cases, the people said.\nThe DMA requires Big Tech to open up space for smaller rivals to compete and make it easier for people to move between competing online services like social media platforms, internet browsers and app stores.\nEU regulators will issue preliminary findings which are similar to antitrust charges before the summer break in August, with Apple the first to be charged, followed by Meta, the sources said.\nThe Commission and Meta declined to comment. Apple referred to its March statement where it said that it was confident that its plan complies with the DMA and that it continues to constructively engage with the Commission.\nCompanies can offer remedies to address concerns laid out in the findings before a final decision expected before EU antitrust chief Margrethe Vestager leaves office in November, which could include fines up to 10% of a company's global annual turnover for breaches.\nThe EU investigation targets Apple's steering rules, which regulators say impose limitations that hinder app developers from informing users about offers outside its App Store free of charge, and also its new fees levied on apps developers.\nEU regulators are expected to charge Apple related to this issue, the people said, adding that a second investigation focusing on its choice screen for its Safari web browser will likely take more time.\nThe preliminary finding on Meta focuses on its recently introduced pay or consent model where users pay a subscription fee for an ad-free Facebook and Instagram, the people said.\nThe FT was the first to report that Apple would face EU charges.\n(Reporting by Foo Yun Chee; Editing by Jan Harvey)\n"
    },
    {
        "Date": "2024-06-18T21:30:00.000Z",
        "Title": "XLK Rebalancing to Reverse Apple, Nvidia Stock Positions",
        "Author": "  Kent Thune ",
        "Text": "The Technology Select Sector SPDR Fund (XLK), the second-largest technology sector exchange-traded fund by assets under management, will dramatically shift the weighting for two of its top holdings on Friday. \nXLK, which has $72 billion in assets under management, will increase its allocation in Nvidia from roughly 5% to more than 20% and drop its allocation of Apple from about 21% to 5%, reversing the stocks’ positions in the ETF with Nvidia becoming the second largest holding.\n“XLK will be a forced seller of ~$11 billion worth of $AAPL and a forced buyer of almost $10 billion worth of $NVDA in a rebalance... assuming Nvidia remains larger than Apple at market close on Friday,” Bloomberg research analyst James Seyffart wrote in a post on the social media platform X.\nMicrosoft will retain the top weighting in the index, State Street Global Advisors, the fund’s issuer, confirmed. XLK’s rebalancing follows Nvidia's (NVDA) recent market capitalization surpassing Apple's (AAPL). The tech sector fund passively tracks the performance of its benchmark index, the Technology Select Sector Index, which holds a basket of technology companies. \nThe weighting of each company in XLK must reflect their weighting in the index. So XLK must now purchase Nvidia Shares and sell Apple on Friday to mimic their new weightings in the index that the fund tracks.\nThe rebalancing of the XLK ETF this Friday is likely to cause upward pressure on Nvidia's stock price and downward pressure on Apple's price, based on similar reallocations. However, the exact impact is difficult to predict and will depend on various market factors.\nThe impact on stock prices depends on how the broader market reacts to the rebalancing. Investors anticipating the rebalancing may have already adjusted their holdings, meaning the price movements might be smaller than expected. \nThe price movements might be more prominent in the short term, around the time of the rebalancing. In the long run, the stock prices will likely be driven more by the companies' individual performance and overall market conditions.\n\nPermalink | © Copyright 2024 etf.com. All rights reserved\n"
    }
]