[
    {
        "Date": "2024-07-24T15:41:59.000Z",
        "Title": "Apple App Store Practices Under Scrutiny In Spain For Anti-Competitive Behavior",
        "Author": "  Lekha Gupta ",
        "Text": "Apple Inc. (NASDAQ:AAPL) shares are trading lower Wednesday. The National Commission for Markets and Competition (CNMC) is investigating Apple for possible violations of Spanish and EU competition laws.\nApple is under investigation for potentially imposing unfair trading conditions on developers using its App Store.\nThe investigation, which was initiated due to the growing significance of app store activities in Spain, has a maximum duration of 24 months.\nRead: Apple iPhone Settlement Deadline Extended: Users Get Extra Time To File Claims To Get Up To $349\nIf confirmed, Apple’s conduct could breach Article 2 of the Defense of Competition (LDC) and Article 102 of the Treaty on the Functioning of the European Union (TFEU), potentially resulting in fines of up to 10% of the companies’ global turnover from the previous year.\nIn March this year, a case filed in the Northern District of California claimed that Apple is imposing “surgical” restrictions that prevent customers from effectively using any service except its iCloud storage system.\nOn Tuesday, Apple said that it is planning to integrate its A18 chip into its upcoming entry-level iPhones and iPads in order to make them capable of running Apple Intelligence, the company’s suite of AI features.\nAAPL stock gained over 15% in the last twelve months. Investors can gain exposure to the stock via ETF Opportunities Trust T-Rex 2X Long Apple Daily Target ETF (BATS:AAPX) and Fidelity MSCI Information Technology Index ETF (NYSE:FTEC).\nRead: Apple Hit With Class-Action Lawsuit Over Alleged Unequal Pay For Women\nPrice Action: AAPL shares are down 2.96% at $218.36 at the last check Wednesday.\nRead Next:\nApple and Micron Leaders Visit Beijing As US Intensify Advanced Semiconductor Sanctions: Report\nImage via Apple\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Apple App Store Practices Under Scrutiny In Spain For Anti-Competitive Behavior originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-07-18T09:15:00.000Z",
        "Title": "Forget Apple: These Unstoppable Stocks Are Better Buys",
        "Author": "  James Brumley, The Motley Fool ",
        "Text": "Apple (NASDAQ: AAPL) is once again the world's largest company (as measured by market cap) right now. It's also one of the most profitable (as measured by total profits generated).  But that wasn't always the case. It earned its way to these accolades with sustained growth largely set in motion by 2007's debut of the iPhone.\nHowever, investors know that past performance is no guarantee of future results. What got Apple to where it is today doesn't seem to be working quite as well lately. Sales of its top products have been stagnant for a couple of years, in fact. While the stock's been soaring since May 1 (up 38%), it's currently sitting just 6% above analysts' consensus price target. Weakness may well be on the horizon. That has some investors considering other options.\nSo, if you're looking for a new pick, there are three better options than Apple to consider.\nThere's no sense in not beginning with the market's most fruitful stock pick of this century so far. That's Amazon (NASDAQ: AMZN), of course. Shares of the e-commerce giant are up an amazing 257,000% since the company's 1997 initial public offering, soaring in step with the expansion of the then-nascent internet.\nThe company's fastest growth and the stock's fastest gains are likely in the past, of course, as the e-commerce market is mature even if it's not yet at its peak potential But there's still plenty of growth in store given Amazon's more nascent business lines.\nOne of these young ventures is cloud computing. Although Amazon Web Services only accounts for about 16% of the company's revenue, this revenue grew 13% year over year in 2023. Given that cloud computing services already drive roughly two-thirds of the company's operating income, even merely modest growth on this front could remain impactful. That's what makes Mordor Intelligence's outlook for the global cloud computing market so compelling for Amazon shareholders. The research outfit expects an annualized growth rate of 16% through 2029.\nThe company's e-commerce platform is also evolving. Although it still generates revenue and earnings on every item sold at Amazon.com, it's generating much more higher-margin revenue as an advertising platform. Sellers paid a total of nearly $47 billion last year to more prominently feature their products at the well-trafficked website, monetizing it in a way that wasn't even an afterthought just a few years back.\nAgain, neither Amazon nor Amazon stock will repeat the feat achieved during the first 30 years of the company's existence. The next 30 years, however, could still be pretty darn rewarding.\nYou've almost certainly heard of the company. You may not know, however, a single thing Broadcom (NASDAQ: AVGO) manufactures. That's because nearly everything it makes is found on the inside of the electronics you regularly rely on. Wi-Fi and Bluetooth chips, fiber-optic connection components, data-storage device boards, and a wide range of automation software are just a sampling of its offerings. Without Broadcom's tech, the world would look considerably different.\nMore important to interested investors, the need for Broadcom's technologies isn't going away anytime soon, if ever. Consumers and corporations alike are far too reliant on mobile phones, wireless networking, data centers (for artificial intelligence), and cybersecurity -- all markets that Broadcom serves -- to simply cease using them now.\nAlso know that Broadcom's technology remains well protected by patents. It holds more than 45,000 of them, with roughly one-third of them in active use right now, according to Insights by GreyB. Just late last year the company successfully enforced a key patent against streaming powerhouse Netflix.\nFinally, add Coca-Cola (NYSE: KO) to your list of unstoppable stocks to buy instead of Apple.\nIt's obviously a very different outfit than either Amazon or Broadcom. It operates a slow-growth, cash-driving business that generates tons of reliable cash. Indeed, the beverage behemoth hasn't just been able to pay a dividend like clockwork for decades now. It's raised its annual payment every year for the past 62 years; the most recent increase was a 5.4% improvement, extending a long streak of inflation-beating payout growth. Coke shares are also up a hefty 26,400% for that time frame, bolstering the gains stemming from its reliable dividend payments.\nIt's a tough act to follow to be sure. In fact, the next 62 years aren't apt to be nearly as fruitful for shareholders as the past 62 have been. There's just too much competition in the well-developed and highly competitive beverage business these days.\nThat doesn't mean the next six decades, however, still can't be amazingly rewarding.\nSee, while Coca-Cola's business isn't complicated, the company handles the most crucial aspects of it brilliantly. That's marketing, mostly. It's been able to use lifestyle-oriented advertising to create brand names and product logos that consumers readily recognize. Purchasing its products has become a habit for many of its customers.\nIt's also worth pointing out that operating in the consumer staples space makes it easier for the company to continue selling goods to a crowd that might occasionally rethink purchases of more cyclical products and services like automobiles, vacations, or home improvements. More to the point, this competitive edge within a resilient business should keep The Coca-Cola Company's stock reliably chugging along.\nIt will never be a growth stock, to be clear. What the company lacks in growth firepower, however, it more than makes up for in consistent forward progress.\nBefore you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $774,281!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. James Brumley has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Netflix. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy.\nForget Apple: These Unstoppable Stocks Are Better Buys was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-15T08:32:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Amazon, Apple Walmart and Chevron",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – July 15, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Amazon.com Inc. AMZN, Apple Inc. AAPL, Walmart Inc. WMT and Chevron Corp. CVX.\nU.S. stock markets have been on an impressive bull run over the past 18 months. However, the Dow, despite participating in the rally, lagged its peers, the S&P 500 and the Nasdaq Composite. Wall Street’s blue-chip index is up 5.4% year to date. On the other hand, the broad-market S&P 500 Index and the tech-heavy Nasdaq Composite have climbed 17.8% and 23.8%, respectively.\nMeanwhile, the Dow recorded its all-time high of 40,077.40 on an intraday basis on Mar 20 and 40,003.59 on a closing basis on May 17. Technically, at its current level of 39,753.75, the Dow is well above its 50-day and 200-day moving averages of 39,035.26 and 37,365.23, respectively.\nThe 50-day moving average line is generally recognized as a short-term trendsetter in financial literature, while the 200-day moving average is considered a long-term trendsetter. Historically it has been noticed in the technical analysis space that whenever the 50-day moving average line surges ahead of the 200-day moving average line, a long-term uptrend for the asset (in this case the Dow Index) becomes a strong possibility.\nWe have narrowed our search to four Dow stocks that have strong earnings growth potential for the rest of 2024. These stocks have seen positive earnings estimate revisions in the last 60 days. Finally, each of our picks carries either a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nAmazon.com Inc. is gaining on solid Prime momentum owing to ultrafast delivery services and a strong content portfolio. A deepening focus on generative AI is a major plus. Strengthening relationships with third-party sellers is a positive for AMZN.\nThe strong adoption rate of AWS is aiding AMZN’s cloud dominance. Improving Alexa skills along with robust smart home offerings are tailwinds. The advertising business is also pretty robust. AMZN enjoys a strong global presence and solid momentum among small and medium businesses. Growing capabilities in grocery, pharmacy, healthcare and autonomous driving are its other positives.\nZacks Rank #2 Amazon.com has an expected revenue and earnings growth rate of 11% and 57.9%, respectively, for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.9% over the last 60 days.\nApple Inc. has been playing catch-up in the AI space compared with Alphabet, Microsoft and Amazon, its peers in the “magnificent seven” group. Following the launch of Apple Intelligence, AAPL’s competitive position is expected to improve. Moreover, AAPL is benefiting from increasing customer engagement in the services segment.\nThe expanding content portfolio of Apple TV+ and Apple Arcade helped drive subscriber growth. AAPL’s top-line benefits from strong growth in emerging markets and growing adoption of its devices among enterprises.\nZacks Rank #2 Apple has an expected revenue and earnings growth rate of 0.8% and 7.5%, respectively, for the current year (ending September 2024). The Zacks Consensus Estimate for current-year earnings has improved 0.2% over the last 30 days.\nWalmart Inc. has been gaining from its highly diversified business with contributions from various segments, channels and formats. WMT has been benefiting from an increase in in-store and digital channel traffic due to its robust omnichannel initiatives. Store-fulfilled delivery sales jumped 50% in the first quarter of fiscal 2025.\nWalmart’s strategic focus on enhancing delivery services has also been rewarding, as evidenced by the constant increase in the market share for groceries. Upsides like these, along with growth in the advertising business, fueled WMT’s first-quarter results and led to an encouraging fiscal 2025 view.\nZacks Rank #1 Walmart has an expected revenue and earnings growth rate of 4.3% and 9.5%, respectively, for the current year (ending January 2025). The Zacks Consensus Estimate for current-year earnings has improved 3% over the last 60 days.\nChevron Corp. is positioned as one of the top global integrated oil firms, set for sustainable production growth, particularly due to its dominant position in the lucrative Permian Basin. Further, the recent acquisition of Hess Corporation is expected to significantly strengthen CVX’s presence in oil-rich Guyana.\nCVX seems one of the best-placed global integrated oil companies to achieve sustainable production ramp-up. We expect the company's average output during 2024 to rise 4-7% year over year, due to the PDC Energy acquisition and robust output in the showpiece Permian Basin region.\nZacks Rank #2 Chevron has an expected revenue and earnings growth rate of 2.3% and 0.4%, respectively, for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.1% over the last 30 days.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nWalmart Inc. (WMT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-26T18:01:42.000Z",
        "Title": "What You Need To Know Ahead of Apple's Earnings Report",
        "Author": "  Naomi Buchanan ",
        "Text": "\nApple will report third-quarter earnings after the bell on Thursday, Aug. 1.\nAnalysts expect revenue and earnings to grow from the year-ago period.\nInvestors will likely be watching for signs that iPhone sales are stabilizing in China.\nThe iPhone maker could also provide updates related to artificial intelligence.\n\nApple (AAPL) is set to report fiscal third-quarter earnings after the bell on Thursday, Aug. 1, with investors likely to be watching for sales results in the China region and updates related to artificial intelligence (AI).\nThe iPhone maker is expected to report revenue of $84.39 billion, according to estimates compiled by Visible Alpha, which would represent 3.1% growth from the year-ago period. Net income is projected to be $20.64 billion, or $1.34 per share, an increase from the third quarter of 2023.\n \nAnalyst Estimates for Q3 2024\nQ2 2024\nQ3 2023\nRevenue\n$84.39 billion\n$90.75 billion\n$81.8 billion\nDiluted Earnings Per Share\n$1.34\n$1.53\n$1.26\nNet Income\n$20.64 billion\n$23.64 billion\n$19.88 billion\nWorries surrounding slowing sales in China have weighed on Apple's stock, but analysts said the third quarter could be the end of the decline, ahead of recovery.\nCFRA analysts said they believe \"the company’s fate is turning around in the region,\" based on increased iPhone shipments in China driven by pricing discounts.\nAnalysts project Apple will report a 2.6% decline in sales in the region for the third quarter, according to consensus estimates compiled by Visible Alpha. CFRA expects the China iPhone sales figure will represent a revenue trough ahead of the anticipated new iPhone 16.\nApple is expected to launch an AI-supercharged iPhone 16 in September after recently unveiling iOS 18 with Apple Intelligence and an AI partnership with OpenAI.\nThe iPhone maker could be on track to reach a $4 trillion market capitalization, Wedbush analysts said, with a new iPhone upgrade cycle in the near future. The company could discuss its ongoing AI initiatives during the earnings call, offering investors greater clarity on how the emerging tech could affect Apple.\nApple shares have gained about 13% so far this year, at $217.96 as of Friday's close.\nUPDATE—July 26, 2024: This article has been updated to reflect more recent share price information.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-07-31T16:00:00.000Z",
        "Title": "Apple ETFs to Buy Ahead of its Fiscal Q3 Earnings",
        "Author": "  Sweta Killa ",
        "Text": "All eyes are on technology giant Apple AAPL, which is set to release third-quarter fiscal 2024 results after market close on Aug 1. Since Apple accounts for nearly 7% of the total market capitalization of the entire technology sector on the S&P 500 Index, it is worth taking a look at its fundamentals ahead of its quarterly results. Apple reclaimed the most valuable title last month and emerged as one of the strongest performers relative to the other “Mag 7” amid the recent sell-off. The stock has gained about 28.5% over the past three months, outperforming the industry’s growth of 8.4%. The solid trend is expected to continue, given that the tech giant has a strong chance of beating earnings estimates. It has seen positive earnings estimate revision activity, which is generally a precursor to an earnings beat (see: all the Technology ETFs here).\nImage Source: Zacks Investment Research\nThis has put investors’ focus on ETFs having the largest allocation to the tech titan. Vanguard Information Technology ETF VGT, MSCI Information Technology Index ETF FTEC, iShares US Technology ETF IYW, iShares Russell Top 200 Growth ETF IWY and Vanguard Mega Cap Growth ETF MGK have Apple as the top or second firm with a double-digit allocation. These ETFs have a Zacks ETF Rank #1 (Strong Buy) or 2 (Buy).\nApple has an Earnings ESP of +0.30% and a Zacks Rank #2 (Buy). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter. Apple saw a positive earnings estimate revision of a penny over the past seven days for the fiscal third quarter. Analysts raising estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The Zacks Consensus Estimate indicates modest year-over-year growth of 6.3% for earnings and 3.2% for revenues. The company has a strong track record of positive earnings surprises. It delivered an average earnings surprise of 4.14% in the trailing four quarters (read: Tech ETFs Faceoff: Apple Vs. Microsoft). The stock currently has an average brokerage recommendation (ABR) of 1.62 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 30 brokerage firms. The current ABR compares to an ABR of 1.68 a month ago based on 30 recommendations. Of the 30 recommendations deriving the current ABR, 20 are Strong Buy and three are Buy. Strong Buy and Buy, respectively, account for 66.67% and 10% of all recommendations. A month ago, Strong Buy made up 63.33%, while Buy represented 10%.Based on the short-term price targets of 32 analysts, the average price target for Apple comes to $232.22. The forecasts range from a low of $180.00 to a high of $300.00.\nApple, which was way behind its competitors in adopting AI, is finally turning around following the launch of a brand-new AI feature called Apple Intelligence for iPhones, iPads and Macs in June. The introduction of numerous AI-powered features is expected to kickstart the next upgrade cycle, enhancing the company's performance and restoring investor confidence in Apple (read: Apple Jumps on the AI Bandwagon: ETFs to Buy).The technology will help summarize text, create original images and retrieve the most relevant data when users need it. Apple also announced a partnership with ChatGPT-maker OpenAI, which provides customers access to ChatGPT via Siri at no extra cost. The company released a beta version of its new iOS 18.1 to developers early this week, offering the first look of Apple Intelligence and some of the iPhone maker's new artificial intelligence features.According to LSEG data, the tech titan is expected to win back some customers in China with big iPhone discounts and by selling more high-margin iPads with a refreshed design. iPhone sales are expected to decrease 2.2% in the to-be-reported quarter, a big improvement from the 10.5% decline in the second quarter. This suggests that the worst might be over for Apple.For the fiscal third quarter, the iPhone maker expects overall revenues \"to grow low-single digits\" and iPad revenues to grow in double digits.\nVanguard Information Technology ETF (VGT) - Apple accounts for a 16.1% share.MSCI Information Technology Index ETF (FTEC) - Apple accounts for a 16% share in the basket. iShares US Technology ETF (IYW) - Apple makes up 16.1% of the assets.iShares Russell Top 200 Growth ETF (IWY) - Apple accounts for a 13.8% share in the basket.Vanguard Mega Cap Growth ETF (MGK) - Apple accounts for 12.4% of the total assets\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nFidelity MSCI Information Technology Index ETF (FTEC): ETF Research Reports\niShares U.S. Technology ETF (IYW): ETF Research Reports\nVanguard Information Technology ETF (VGT): ETF Research Reports\niShares Russell Top 200 Growth ETF (IWY): ETF Research Reports\nVanguard Mega Cap Growth ETF (MGK): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]