[
    {
        "Date": "2024-08-20T16:51:00.000Z",
        "Title": "Top Analyst Reports for Apple, NVIDIA & Coca-Cola",
        "Author": "  Sheraz Mian ",
        "Text": "Tuesday, August 20, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc. (AAPL), NVIDIA Corporation (NVDA) and The Coca-Cola Company (KO), as well as two micro-cap stocks Star Group, L.P. (SGU) and Aware, Inc. (AWRE). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Apple shares have lagged the the Zacks Tech sector past year ( +28.8% vs. +38.6%), but performed roughly in-line with the broader market (+28.8% vs. +27.5% for the S&P 500 index). Weighing on the stock's muted momentum is the macro overhang from China whose economic outlook continues to remain uncertian. The company reported decline in iPhone sales in third-quarter fiscal 2024 partially offset by strong growth in Services revenues. Apple now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+ and Apple Arcade helped in driving subscriber growth. Apple expects the September quarter’s (fourth-quarter fiscal 2024) revenues to grow at the same rate as of June quarter on a year-over-year basis. Unfavorable forex is expected to hurt revenues. For the Services segment, Apple expects a double-digit growth rate similar to the first three quarters of fiscal 2024. Introduction of Apple Intelligence, an advanced personal intelligence system seamlessly integrated into iOS 18, iPadOS 18 and macOS Sequoia will help Apple shares to push higher.(You can read the full research report on Apple here >>>)Shares of NVIDIA have outperformed the Zacks Semiconductor - General industry over the year-to-date period (+160.7% vs. +114.9%). The company is benefiting from the strong growth of artificial intelligence (AI), high-performance and accelerated computing. The data center end-market business is benefiting from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures. A surge in hyperscale demand and higher sell-ins to partners across the Gaming and ProViz end markets following the normalization of channel inventory are acting as tailwinds. Collaborations with Mercedes-Benz and Audi are likely to advance its presence in the autonomous vehicles and other automotive electronics space. However, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds.(You can read the full research report on NVIDIA here >>>)Coca-Cola shares have outperformed the Zacks Beverages - Soft drinks industry over the year-to-date period (+18.9% vs. +11.3%). The company experiences positive business trends, as evidenced by its strong track record of beating expectations. In second-quarter 2024, the company exceeded sales and earnings estimates for the sixth consecutive quarter, with both metrics showing year-over-year improvement. Strong revenue growth across most operating segments, supported by improved price/mix and unit volume growth aided results. KO is well-poised to benefit from innovations and growing digital investments. It has provided an optimistic view for 2024. However, Coca-Cola faces inflationary cost pressures due to higher commodity and material costs, as well as increased marketing investments.(You can read the full research report on Coca-Cola here >>>)Shares of Star have gained +6.6% over the year-to-date period against the Zacks Electronics - Miscellaneous Products industry’s gain of +11.1%. This microcap company with market capitalization of $409.70 million witnessed strong revenue growth, driven by a 25.3% increase in heating oil and propane volumes, and improved margins despite warmer weather. Strategic acquisitions are bolstering market position, adding significant volume and operational synergies. The company has enhanced profitability by reducing its adjusted EBITDA loss by $18.9 million and maintaining strong cost control, leading to improved margins. Star Group's leadership in home heating, diversification into related services and a robust balance sheet with solid cash flow management further strengthen its investment case. However, challenges include declining heating oil volumes, weather sensitivity, customer attrition and rising operating expenses. Additionally, the company faces competitive pressures from alternative energy sources, which could impact market share and profitability.(You can read the full research report on Star here >>>)Aware’s shares have outperformed the Zacks Internet - Software and Services industry over the year-to-date period (+48.8% vs. +5.0%). This microcap company with market capitalization of $53.17 million witnessed 17% revenue growth in the first half of 2024, driven by new customer acquisitions and a 14% rise in recurring revenue, reflects a shift toward a subscription model and underscores its market expansion and improved financial predictability. Strategic cost management reduced operating expenses by 7%, narrowing net losses and enhancing adjusted EBITDA. The shift to a recurring revenue model, with a 31% second-quarter 2024 revenue uptick, and securing large contracts, including a $1.2 million automated biometric identification system (ABIS) deal, highlight Aware's growing global footprint. Yet, declining cash reserves, continued net losses, reliance on government contracts and limited market diversification pose significant risks. Increasing competition and execution risks in strategic initiatives could pressure revenue growth and profitability.(You can read the full research report on Aware here >>>)Other noteworthy reports we are featuring today include Thermo Fisher Scientific Inc. (TMO), GE Aerospace (GE) and Pfizer Inc. (PFE).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nRobust Portfolio, Services Strength to Benefit Apple (AAPL)\nNVIDIA (NVDA) Rides on Strong Adoption of GPUs, Partnerships\nCoca-Cola's (KO) Digital Investments to Aid the Top Line\nFeatured Reports\nStrategic Buyouts Aid Thermo Fisher (TMO) Amid Macro IssuesThe Zacks analyst is bullish on Thermo Fisher boosting top-line and new capabilities through buyouts like Olink. Lower COVID-19 sales and slower economic activity in China continue to pose concerns.\nPfizer's (PFE) New Products Can Drive Long-Term Sales GrowthThough Pfizer's (PFE) revenues from COVID products are declining, non-COVID operational revenue growth is improving, driven by its key in-line products, new launches and newly acquired products.\nFund-Raising Ability Aids Blackstone (BX), High Costs AilsPer the Zacks analyst, Blackstone's solid fund-rising capability and asset inflows will likely aid profitability. Yet, mounting expenses and low capital distribution sustainability are major woes.\nIntel (INTC) Rides on Solid AI Traction & Product InnovationPer the Zacks analyst, a strong emphasis on developing leading-edge AI chips to match the increasing demand for AI PCs will likely boost Intel's top line. Cost-cutting actions are positive.\nDeal With Isuzu to Aid Cummins (CMI), High Capex to AilCummins' collaboration with Isuzu to launch a 6.7-liter engine in Japan is promising. However, the Zacks analyst is cautious amid high 2024 capex forecast of $1.2-$1.3 billion, which may impact FCF.\nTarga (TRGP) To Benefit From Mont Belvieu FractionatorThe Zacks analyst believes that Mont Belvieu's ownership, strategic location, infrastructure, and proximity to end markets are advantages for Targa but is worried about the high debt burden.\nInvestments, Expanding Customer Base Aid Atmos Energy (ATO)Per the Zacks analyst, Atmos Energy's investment plan will help to increase the safety and reliability of its natural gas pipelines. Increasing customer count will boost demand for its services.\nNew Upgrades\nCommercial Engines & Services Unit Drives GE Aerospace (GE)Per the Zacks analyst, strong performance of GE Aerospace's Commercial Engines & Services unit, fueled by robust demand for LEAP, GEnx & GE9X engines and aftermarket services, will lend it momentum.\nDigital Transformation, Product Strength Aids Nutanix (NTNX)Per the Zacks analyst, Nutanix is benefiting from higher investments by clients in digital transformation, as well as frequent product refreshes which help it gain new customers.\nImproved Portfolio Mix Aids AXIS Capital (AXS), Cat Loss AilsPer the Zacks analyst, AXIS Capital is set to grow on Specialty Insurance, Reinsurance and Accident and Health that pave way for long-term growth. However, cat loss is a concern.\nNew Downgrades\nGolar LNG (GLNG) Grapples With High Vessel Operating CostsThe Zacks Analyst is worried about the escalating vessel operating expenses as they are likely to keep the bottom line under pressure.\nMarketing & Product Development Costs Hurt Green Dot (GDOT)Per the Zacks analyst, Green Dot's increasing expenses toward sales, marketing and product development are likely to keep the bottom line under pressure.\nBad Weather & Low Contracts to Hit Martin Marietta (MLM)Per the Zacks analyst, slower shipment trends due to persistent weather impacts and ongoing economic pressures along with a decrease in government contract awards are concerns for Martin Marietta.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nGE Aerospace (GE) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nCocaCola Company (The) (KO) : Free Stock Analysis Report\nPfizer Inc. (PFE) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThermo Fisher Scientific Inc. (TMO) : Free Stock Analysis Report\nStar Group, L.P. (SGU): Free Stock Analysis Report\nAware, Inc. (AWRE): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-08-26T20:30:00.000Z",
        "Title": "Apple announces Chief Financial Officer transition",
        "Author": "Business Wire ",
        "Text": "CUPERTINO, Calif., August 26, 2024--(BUSINESS WIRE)--Apple® today announced that Chief Financial Officer Luca Maestri will transition from his role on January 1, 2025. Maestri will continue to lead the Corporate Services teams, including information systems and technology, information security, and real estate and development, reporting to Apple CEO Tim Cook. As part of a planned succession, Kevan Parekh, Apple’s Vice President of Financial Planning and Analysis, will become Chief Financial Officer and join the executive team.\n\"Luca has been an extraordinary partner in managing Apple for the long term. He has been instrumental in improving and driving the company’s financial performance, engaging with shareholders, and instilling financial discipline across every part of Apple. We’re fortunate that we will continue to benefit from the leadership and insight that have been the hallmark of his tenure at the company,\" said Tim Cook, Apple’s CEO.\n\"For more than a decade, Kevan has been an indispensable member of Apple’s finance leadership team, and he understands the company inside and out. His sharp intellect, wise judgment, and financial brilliance make him the perfect choice to be Apple’s next CFO.\"\nDuring his time as CFO, Maestri enabled essential investments and practiced robust financial discipline, which together helped the company more than double its revenue, with services revenue growing more than five times.\n\"It is the greatest privilege of my professional life to serve the world’s most innovative and admired company, and to work side by side with a leader as inspirational as Tim Cook,\" said Maestri. \"I’m looking forward to the next stage of my time at Apple, and I have enormous confidence in Kevan as he prepares to take the reins as CFO. He is truly exceptional, has a deep love for Apple and its mission, and he embodies the leadership, judgment, and values that are so important to this role.\"\nParekh has been at Apple for 11 years and currently leads Financial Planning and Analysis, G&A and Benefits Finance, Investor Relations, and Market Research. Prior to this role, Parekh led Worldwide Sales, Retail, and Marketing Finance. He began his tenure leading the financial support of Apple’s Product Marketing, Internet Sales and Services, and Engineering teams.\nBefore joining Apple, Parekh held various senior leadership roles at Thomson Reuters and General Motors, where he also had extensive global experience. Parekh is an electrical engineer with a Bachelor’s of Science from the University of Michigan and an MBA from the University of Chicago.\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it.\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple’s Media Helpline at media.help@apple.com.\n© 2024 Apple Inc. All rights reserved. Apple and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240826777589/en/\nContacts\nPress Contact: Josh RosenstockApplejrosenstock@apple.com (408) 862-1142\nInvestor Relations Contact: Suhasini ChandramouliApplesuhasini@apple.com (408) 974-3123\n"
    },
    {
        "Date": "2024-09-02T03:55:17.000Z",
        "Title": "Apple Hospitality REIT, Inc. (APLE): A Good Stock That Pay Dividends Monthly",
        "Author": "  Vardah Gill ",
        "Text": "We recently compiled a list of the 10 Stocks that Pay Dividends Monthly. In this article, we are going to take a look at where Apple Hospitality REIT, Inc. (NYSE:APLE) stands against the other stocks that pay dividends monthly.\nOver the years, dividend stocks have consistently demonstrated resilience in challenging market conditions. While the recent focus on AI might suggest otherwise, the long-term attractiveness of these stocks has increased. Income investors have taken note of this trend, which is reflected in the growing role of dividends as a portion of personal income. According to a report by S&P Dow Jones Indices, the share of dividend income has risen from 2.68% in the fourth quarter of 1980 to 7.88% in the second quarter of 2024, highlighting dividends as a significant source of income. The report also mentioned that since 1936, dividends have contributed to over one-third of the broader market's total equity returns, with the remaining two-thirds coming from capital appreciation.\nThis highlights how dividends have become increasingly important over the years. When considering inflation, dividends have outpaced it, suggesting that investors should focus on these stocks. A report by Wisdom Tree noted that from 1957 to 2023, dividends grew by an average of 5.7% annually, which is more than 2% higher than the inflation rate. The report also pointed out that in the last 64 years, dividends only declined in six years, and only once by more than 5%. In contrast, stock prices fell in 18 of those years, with the worst annual decline exceeding 40% and an average drop of over 11%. Stock prices were more than twice as volatile as the dividend cash flows, as short-term prices are more influenced by market sentiment, while long-term value is driven by cash flow stability.\nAlso read:\n10 Highest Paying Monthly Dividend Stocks\nWhen investing in dividend stocks, receiving payments more often is definitely a plus. Although most dividend stocks distribute payments to shareholders on a quarterly basis, there are a few hundred publicly traded companies that opt to pay dividends monthly instead. However, monthly dividend stocks have their downsides. While they offer appealing investment opportunities, their high yields can be misleading, often accompanied by multiple dividend cuts. The high yields are primarily due to the nature of the companies that opt for monthly payments, such as real estate investment trusts (REITs), closed-end funds, business development companies (BDCs), and royalty trusts, which are common among monthly dividend payers. That said, many monthly dividend companies have not only kept up their payouts over the years but have also increased them, all while maintaining high yields.\nOnce the risks associated with high yields are addressed, investors can concentrate on the benefits of compounding. Monthly dividend stocks provide cash to investors more frequently than other stocks, allowing them to reinvest it sooner and take advantage of faster compounding. Since 1960, 85% of the cumulative total return of the broader market Index can be traced back to reinvested dividends and the effects of compounding, as reported by Hartford Funds. With this, we will take a look at some of the best dividend stocks that offer monthly payouts.\nOur Methodology:\nFor this list, we reviewed a list of companies providing monthly dividends to their shareholders. Among these, we specifically chose businesses with robust dividend practices, consistently maintaining their payouts across multiple years. The majority of these selected companies operate within the Real Estate Investment Trust (REIT) sector, as they are required to allocate 90% of their income towards dividends. From that list, we picked 10 stocks with the highest number of hedge fund investors, using Insider Monkey’s Q2 2024 database of 912 hedge funds and their holdings.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here).\nLong exposure of a busy city skyline featuring tall roof tops of different hotel brands.\nNumber of Hedge Fund Holders: 19\nApple Hospitality REIT, Inc. (NYSE:APLE) is a Virginia-based real estate investment trust company that operates in hotel properties across the US. The company's portfolio includes 224 hotels with over 30,000 guest rooms, spread across 87 markets in 37 states and the District of Columbia. The portfolio is concentrated on leading industry brands, featuring 100 Marriott-branded hotels, 119 Hilton-branded hotels, and five Hyatt-branded hotels.\nIn the second quarter of 2024, Apple Hospitality REIT, Inc. (NYSE:APLE)'s business fundamentals remained robust, supported by a slower rate of new supply growth compared to historical levels. Its comparable hotel occupancy reached 80%, which is more than a 2% increase from the same quarter in 2023. While the greatest potential for continued growth is expected from the ongoing improvement in midweek business travel demand, the company also achieved higher occupancy rates on both weekdays and weekends during the quarter. This reflects the resilience of leisure travel demand and the benefits being realized as business travel patterns return to normal. Comparable hotel revenue per available room (RevPAR) for the second quarter rose by 2.5% compared to the previous year, accompanied by a slight increase in average daily rate (ADR).\nApple Hospitality REIT, Inc. (NYSE:APLE), one of the best dividend stocks, has been making uninterrupted dividend payments to shareholders since 2008. The company offers a monthly dividend of $0.08 per share and has a dividend yield of 6.73%, as of August 29.\nApple Hospitality REIT, Inc. (NYSE:APLE) was a popular buy among elite funds during Q2 2024, with hedge fund positions growing to 19, from 13 in the previous quarter, according to Insider Monkey's database. These stakes have a total value of more than $116.5 million. With over 2.6 million shares, Balyasny Asset Management was the company's leading stakeholder in Q2.\nOverall APLE ranks 6th on our list of the stocks that pay dividends monthly. While we acknowledge the potential APLE as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than APLE but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-08-18T12:15:26.000Z",
        "Title": "What one AI CEO learned by working 20 feet from Apple's Steve Jobs",
        "Author": " Grace Williams    ",
        "Text": "Listen and subscribe to Opening Bid on Apple Podcasts, Spotify, or wherever you find your favorite podcasts.\nLearning from tech's grandmaster.\nIt’s not often that one can absorb life and business lessons from an all-time great. But Chet Kapoor, chairman and CEO of AI company DataStax, has the distinct pleasure of being in a rarified group.\nDuring his time at the computer company NeXT from 1989 to 1993, which Steve Jobs founded in 1985 and sold to Apple (AAPL) in 1997, Kapoor was the self-professed “person that got coffee for the person that made coffee.\"\nKapoor said he learned lessons that stayed with him well into his leadership career.\n”There were so many things that I saw [from Steve] that I’ve incorporated into what I do, what I’ve done over the last 30 years,” he told Yahoo Finance Executive Editor Brian Sozzi on his Opening Bid podcast (see video above).\nThe former IBM (IBM) and Google (GOOG) exec says in business, inspiration is rarely a problem, but actually reaching innovation is hard. Pushing people to innovate and sweat the details is what Jobs did best.\n“Innovation doesn’t happen by saying please go out and do this, you have to push people and get them to a place where they will deliver on something they didn’t think they could deliver on,\" Kapoor said.\nBefore Jobs died in 2011 from complications tied to pancreatic cancer, he was considered an inspiration and mentor to many in the business and tech fields. Despite his illness, he continued to innovate on products such as the iPad and iPhone.\nThat drive at any cost highlights one of the many lessons Kapoor picked up from working near Jobs in the office.\n“He always got up in the morning thinking about what people needed, not what people wanted,\" Kapoor added.\nNoting that consumers would be stuck with BlackBerry (BB) technology or Nokia (NOK) phones without Jobs, Kapoor stressed Jobs's “relentless obsession for what people needed\" is something that still influences Kapoor's own work.\nKapoor also praised Jobs for his dedication to changing the world.\n“I believe it’s about making a dent on the universe,” he said. “I learned from Steve [to ask], ‘Are you changing the world? Are you really thinking about it from the user’s perspective, from a societal perspective, and going off and making that happen?” he asked.\nThe ability to put those questions to work is part of what inspires Kapoor.\n“I love building product businesses that developers love, the products that developers love, and change the trajectory of the enterprises that they work for,” he said.\nAnother valuable lesson that comes courtesy of Jobs is making “sure you are very clear on what you’re doing this for,” said Kapoor. “A lot of people in Silicon Valley get stuck where they actually build really cool tech. But the problem is it’s technology. It’s a solution looking for a problem.”\nToday, Apple is the most valuable company in the world with a market cap of $3.43 trillion according to Yahoo Finance data. The company is entering the AI age while raking in billions of dollars each day on the back of Jobs's creations.\nAs for the privately held DataStax, it has raised a solid $305 million in capital to support its growth plans. The company's last reported valuation stood at $1.6 billion following a $115 million capital raise in 2022.\nThree times each week, Yahoo Finance Executive Editor Brian Sozzi fields insight-filled conversations and chats with the biggest names in business and markets on Opening Bid. Find more episodes on our video hub or watch on your preferred streaming service.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-08-28T03:15:06.000Z",
        "Title": "Apple cuts about 100 digital services jobs, Bloomberg News reports",
        "Author": "Reuters ",
        "Text": "(Reuters) -Apple Inc has eliminated about 100 jobs in its digital services group, with the biggest cuts affecting the team responsible for its Apple Books app and Apple Bookstore, Bloomberg News reported on Tuesday.\nThe layoffs include some engineering roles and other services teams like the one that runs Apple News, the report said, citing people familiar with the matter.\nApple declined to comment on the Bloomberg News report.\nIt was not immediately clear how many employees Apple had in its services division. The company had approximately 161,000 full-time equivalent employees as of Sept.30, 2023, according to its latest annual report.\nApple has been reorganizing teams amid shifting priorities, including to artificial intelligence.\nIt has previously suspended work on its next high-end Vision headset and shuttered a project to design and develop its own smartwatch displays earlier this year, according to media reports.\nApple has been facing headwinds in China, its third-largest market, since last year, where sales declined 6.5% last quarter.\n(Reporting by Kanjyik Ghosh; Editing by Savio D'Souza and Nivedita Bhattacharjee)\n"
    }
]