[
    {
        "Date": "2024-10-11T14:29:18.000Z",
        "Title": "PPL partners with Microsoft for insurance trading hub",
        "Author": "  GlobalData ",
        "Text": "Placing Platform Limited (PPL) has entered into a multi-year agreement with Microsoft to enhance its specialty insurance trading platform.\nUnder the alliance, PPL will be integrating Microsoft's data and AI capabilities.\nThis collaboration is aimed at enhancing the way brokers and carriers trade and bind risks, transitioning PPL from a document-centric process to an intuitive trading platform and intelligent data hub.\nIt will see the creation of a suite of PPL productivity tools using Microsoft Teams, Microsoft 365 Copilot and Microsoft Power BI.\nThese tools are expected to be a catalyst in the shift towards data-driven trading, allowing brokers and carriers to be more responsive.\nEnhanced collaboration is a key goal of the initiative, with a PPL market directory curated on Microsoft Teams and managed across Microsoft 365 set to improve contact and response times.\nThis integration is also set to simplify the capture of trading activity, which is currently completed outside of the platform.\nIn addition to facilitating better communication, the collaboration promises to provide actionable insights for brokers and carriers through bespoke PPL Copilot prompts.\nThese prompts will enable users to compare, analyse and gain real-time insights to aid in decision making.\nMoreover, an intelligent Microsoft Fabric-powered data hub will house end-to-end trading data, providing PPL clients with access to structured, secure data to support business decisions.\nPPL CEO John Mason said: “In collaboration with Microsoft, PPL has the ability to create a step-change in how our clients interact with each other across the end-to-end trading cycle.\n“We have engaged some of our key clients early in this process, allowing PPL to test our theories and focus on how we can empower and strengthen digital connectivity between market participants. We have been delighted with their feedback and are now focused on detailed design and delivery.”\nMicrosoft corporate vice-president of worldwide financial services Bill Borden said: “This latest initiative between PPL and Microsoft is rooted in our shared vision of empowering the insurance industry with innovative tools that boost efficiency and unlock new avenues for growth.”\nLast month, insurance broker Howden launched the Howden Resilience Laboratory, a new platform that utilises Microsoft’s technology to assist clients in assessing and managing climate risks.\n\"PPL partners with Microsoft for insurance trading hub \" was originally created and published by Life Insurance International, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    },
    {
        "Date": "2024-10-07T11:00:00.000Z",
        "Title": "Enbridge Collaborates with Microsoft to Use AI for Enhanced Safety, Emissions Reduction, and Asset Optimization",
        "Author": "CNW Group ",
        "Text": "CALGARY, AB, Oct. 7, 2024 /CNW/ - Enbridge Inc. (TSX: ENB) (NYSE: ENB), in collaboration with Microsoft, is harnessing the power of artificial intelligence (AI) to drive significant advancements in safety, emissions reduction, and asset optimization across its operations.\nBuilding on a strong digital foundation, the company began implementing AI over five years ago and is now leveraging it to support operational and environmental excellence.\n\"Our long-term collaboration with Microsoft has enabled us to apply cutting edge technology, which is helping to solve critical business problems and deliver powerful outcomes,\" said Bhushan Ivaturi, Senior Vice President and Chief Information Officer at Enbridge. \"The investments we're making today will play a critical role in enabling technological solutions to the biggest challenges in the evolution of our energy systems as we transition to a lower-carbon future.\"\nEnbridge embarked on a digital transformation in 2020 to drive productivity and efficiency and empower employees with the tools and capabilities they need for personal productivity. At the core of this strategy was a secure and modern technology foundation enabled by Microsoft.\nThis led to an ambitious cloud migration and modernization program, with over 80 percent of workloads moved to Microsoft Azure cloud platform within two years. This initiative not only enhanced computing, network, and storage capabilities but also bolstered cybersecurity measures and reduced data centre emissions through server decommissioning and a smaller physical facility footprint. Today, that strong digital foundation has positioned Enbridge as a leader in AI. Earlier this year, Enbridge rolled out Microsoft 365 Copilot to nearly one third of all employees, while the entire workforce has access to Bing Enterprise and ChatENB, an internal chat bot using Azure OpenAI Service.\n\"The Enbridge leadership team drove a cloud-first strategy, a big bet that opened the door to broader opportunity that positions Enbridge today to take full advantage of AI,\" said Tom Kubik, Enterprise Commercial Multi-Industry Lead at Microsoft Canada. \"We are proud of the work we've done together and are working towards our common goals of supporting a more connected and collaborative workforce and increasing data and analytics capabilities.\"\nAI-Powered Initiatives\nEnbridge is leveraging AI across its operations to optimize assets, increase efficiencies, enhance safety, and contribute to its broader sustainability goals. Powered by Microsoft Azure Machine Learning, key examples include:\nEnergy Optimizer\nThe Energy Optimizer tool leverages AI to provide real-time operational insights, enabling Control Center operators to make decisions about how to move the energy Enbridge transports in the most efficient way possible. By managing the amount of power required, Enbridge can achieve cost savings and GHG reductions, while ensuring the safe, reliable and efficient operations of its liquid pipelines.\nRight of Way Monitoring\nEnbridge utilizes aerial surveillance to patrol its pipelines, detecting potentially damaging activities, conditions, or loss of containment. With AI, the company can now monitor the right of way more efficiently, reviewing data and detecting issues quicker and more accurately. This AI-driven approach has improved threat detection and response, significantly reducing the risk of third-party damage.\nIntegrity Engine\nEnbridge employs intelligent automation for pipeline integrity, using AI to identify potential maintenance needs. Through workflow automation, data controls, advanced analysis, and machine learning models, the company gains new insights for rapid and effective asset maintenance, enhancing safety and efficiency while reducing process complexity and maintaining the health of our assets.\n\"Looking forward, we see ongoing opportunities and benefits of AI, in terms of data analytics, asset and process optimization, security and cost and emissions savings,\" said Ivaturi. \"At Enbridge, we are enabling the accessibility, sustainability, and security of energy through applied technology and innovation, and our collaboration with Microsoft will continue to play a pivotal role in that.\"\nAbout Enbridge Inc. \nAt Enbridge, we safely connect millions of people to the energy they rely on every day, fueling quality of life through our North American natural gas, oil and renewable power networks and our growing European offshore wind portfolio. We're investing in modern energy delivery infrastructure to sustain access to secure, affordable energy and building on more than a century of operating conventional energy infrastructure and two decades of experience in renewable power to advance new technologies including hydrogen, renewable natural gas and carbon capture and storage. Headquartered in Calgary, Alberta, Enbridge's common shares trade under the symbol ENB on the Toronto (TSX) and New York (NYSE) stock exchanges. To learn more, visit us at enbridge.com.\nForward-Looking Statements\nForward-looking statements have been included in this news release to provide readers with information about Enbridge and its subsidiaries and affiliates, including management's assessment of Enbridge's and its subsidiaries' future plans and operations. This information may not be appropriate for other purposes. Forward-looking statements are typically identified by words such as ''anticipate'', ''expect'', ''project'', ''estimate'', ''forecast'', ''plan'', ''intend'', ''target'', ''believe'', \"likely\", and similar words suggesting future outcomes or statements regarding an outlook. Forward-looking information or statements included or incorporated by reference in this news release include, but are not limited to, statements with respect to the impact of Enbridge's collaboration with Microsoft and artificial intelligence (AI) powered initiatives and other technologies on Enbridge's business, as well as related matters.\nAlthough Enbridge believes these forward-looking statements are reasonable based on the information available on the date such statements are made and processes used to prepare the information, such statements are not guarantees of future performance and readers are cautioned against placing undue reliance on forward-looking statements. By their nature, these statements involve a variety of assumptions, known and unknown risks and uncertainties and other factors, which may cause actual results, levels of activity and achievements to differ materially from those expressed or implied by such statements. Assumptions regarding the expected impact of AI and other technologies on Enbridge's business are material to and underlie all forward-looking statements in this news release. Due to the interdependencies and correlation of macroeconomic factors, the impact of any one assumption on a forward-looking statement cannot be determined with certainty\nEnbridge's forward-looking statements are subject to risks and uncertainties pertaining to the realization of anticipated benefits and the impact of AI and other technologies on Enbridge's business and other risks and uncertainties, including, but not limited to, those risks and uncertainties discussed in this and in Enbridge's other filings with Canadian and U.S. securities regulators. The impact of any one assumption, risk, uncertainty, or factor on a particular forward-looking statement is not determinable with certainty as these are interdependent and Enbridge's future course of action depends on management's assessment of all information available at the relevant time. \nExcept to the extent required by applicable law, Enbridge assumes no obligation to publicly update or revise any forward-looking statements made in this news release or otherwise, whether as a result of new information, future events, or otherwise. All forward-looking statements, whether written or oral, attributable to Enbridge or persons acting on Enbridge's behalf, are expressly qualified in their entirety by these cautionary statements.\nFOR FURTHER INFORMATION PLEASE CONTACT:\nMedia\nToll Free: (888) 992-0997\nEmail: media@enbridge.com\nInvestment Community\nToll Free: (800) 481-2804\nEmail: investor.relations@enbridge.com \n \nView original content:https://www.prnewswire.com/news-releases/enbridge-collaborates-with-microsoft-to-use-ai-for-enhanced-safety-emissions-reduction-and-asset-optimization-302268376.html\nSOURCE Enbridge Inc.\nView original content: http://www.newswire.ca/en/releases/archive/October2024/07/c0452.html\n"
    },
    {
        "Date": "2024-10-01T14:00:12.000Z",
        "Title": "Microsoft (NASDAQ:MSFT) Is Achieving High Returns On Its Capital",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "If we want to find a stock that could multiply over the long term, what are the underlying trends we should look for? Firstly, we'll want to see a proven return on capital employed (ROCE) that is increasing, and secondly, an expanding base of capital employed. If you see this, it typically means it's a company with a great business model and plenty of profitable reinvestment opportunities. And in light of that, the trends we're seeing at Microsoft's (NASDAQ:MSFT) look very promising so lets take a look.\nIf you haven't worked with ROCE before, it measures the 'return' (pre-tax profit) a company generates from capital employed in its business. The formula for this calculation on Microsoft is:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.28 = US$109b ÷ (US$512b - US$125b) (Based on the trailing twelve months to June 2024).\nThus, Microsoft has an ROCE of 28%.  That's a fantastic return and not only that, it outpaces the average of 8.4% earned by companies in a similar industry.\n View our latest analysis for Microsoft \nIn the above chart we have measured Microsoft's prior ROCE against its prior performance, but the future is arguably more important. If you'd like to see what analysts are forecasting going forward, you should check out our free analyst report for Microsoft .\nInvestors would be pleased with what's happening at Microsoft. The numbers show that in the last five years, the returns generated on capital employed have grown considerably to 28%. The amount of capital employed has increased too, by 78%. So we're very much inspired by what we're seeing at Microsoft thanks to its ability to profitably reinvest capital.\nIn summary, it's great to see that Microsoft can compound returns by consistently reinvesting capital at increasing rates of return, because these are some of the key ingredients of those highly sought after multi-baggers. And a remarkable 232% total return over the last five years tells us that investors are expecting more good things to come in the future. With that being said, we still think the promising fundamentals mean the company deserves some further due diligence.\nLike most companies, Microsoft does come with some risks, and we've found 1 warning sign  that you should be aware of.\nIf you want to search for more stocks that have been earning high returns, check out this free list of stocks with solid balance sheets that are also earning high returns on equity.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-10-07T20:54:15.000Z",
        "Title": "Is Microsoft Corporation (NASDAQ:MSFT) the Best AI Stock to Buy?",
        "Author": "  Attiya Zainib ",
        "Text": "We recently published a list of Top 10 Buzzing AI Stocks Now. Since Microsoft Corporation (NASDAQ:MSFT) ranks 2nd on the list, it deserves a deeper look.\nFollowing the aggressive rate cut by the Federal Reserve, the market roared to new highs but quickly lost enthusiasm as investors look for clues on what might be ailing the economy that pushed the Fed to go more dovish than expected. However, others think the bull market is going to continue.\nBMO Capital’s Brian Belsk has raised the S&P 500 target for 2024 to 6,100 from 5,600. Talking to CNBC in a latest program, Belsk said the “resiliency” of this bull market is “undoubted.”\nThe analyst said that the stock market is going higher through the end of this year.\n“We do believe that the Fed is doing a great job. We believe the Fed that we are not hitting into a recession. We believe the Fed that we are heading into more of a soft landing,” the analyst said.\nBelsk thinks we are in the “1995-1996 environment” where we can “handle” the 24x earnings multiple.\nThe analyst added that the Mag. 7 stocks underperformed the market in the third quarter and yet the broader market grew, which shows the market rally is broad.\nFor this article we chose 10 AI stocks trending on the back of latest news, earnings and analyst ratings. With each stock we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nmanaemedia / Shutterstock.com\nNumber of Hedge Fund Investors: 279\nAnkur Crawford, Alger executive VP, while talking to CNBC in a latest program said that in about 3 to 5 years AI is going to provide us with superhuman intelligence.\n“All of the CapEx being spent today is whole-heartedly justifiable because the opportunity to monetize that AI by that time is beyond what anyone has contemplated in the market so far.”\nMicrosoft Corp (NASDAQ:MSFT) is one of the top AI picks of Ankur Crawford.\nMicrosoft Corp (NASDAQ:MSFT) shares fell following its quarterly results which showed the company’s Cloud business growth was lower than expected. For the ongoing quarter, Microsoft Corp (NASDAQ:MSFT) expects revenue in the range of $63.8B and $64.8B, compared to the $65.07B estimate. Microsoft Corp (NASDAQ:MSFT) Azure revenue is expected to grow by 28% and 29% year over year.\nBut what about AI? While Microsoft does not mention specific AI numbers, analysts believe Copilot is already playing a key role in growth at several segments of the company. Microsoft Corp (NASDAQ:MSFT) Office’s commercial customer sales soared to $48 billion, significantly up from last year’s 10% growth, likely driven by Copilot Pro subscriptions. Office for individual users also saw a boost, with sales reaching $6.2 billion, a 4% increase compared to last year’s 2% growth, indicating accelerating growth from Copilot integration. Dynamics ERP and CRM software sales hit $6.3 billion, up 19%, surpassing last year’s 16% growth. This uptick is likely due to customers switching to Dynamics for the Copilot integration in the Dynamics Contact Center platform, which provides automated customer service chatbots and significant cost reductions. Bing sales jumped 3% year over year as more users switched to the search engine from Google Search, thanks to AI features.\nWhile Microsoft Corp (NASDAQ:MSFT) expenses are expected to remain elevated, its investments are working and would bear fruit in the long term. The stock is down about 11% over the past month. It trades 26x next fiscal year’s earnings. MSFT could be an attractive buy on the dip for long-term investors.\nAlger Spectra Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its Q2 2024 investor letter:\n“Microsoft Corporation (NASDAQ:MSFT) is a beneficiary of corporate America’s transformative digitization. The company operates through three segments: Productivity and Business Processes (Office, LinkedIn, and Dynamics), Intelligent Cloud (Server Products and Cloud Services, Azure, and Enterprise Services), and More Personal Computing (Windows, Devices, Gaming, and Search). During the quarter, shares contributed to performance after the company reported strong fiscal third quarter results, underscoring its leadership position in the cloud and highlighted its role as a primary facilitator and beneficiary of AI adoption. Company revenue growth, operating margin, and earnings growth surpassed consensus expectations. The utility scale Azure cloud business grew 31% in constant currency of which 7% was AI related versus 3% two quarters ago. Further, management noted most of the AI revenue continues to stem from inference rather than training indicating high quality AI applications by Microsoft’s clients. Management also indicated that the significant cost-cutting programs in corporate America are done, suggesting that the cost optimization headwinds previously impacting Azure’s growth are over. Separately, management provided color on their new AI-productivity tool, Copilot, noting that approximately 60% of Fortune 500 companies are already using Copilot, and that the quarter witnessed a 50% increase in Copilot assistance integration within Teams. We continue to believe that Microsoft has the potential to hold a leading position in AI, given its innovative approach and demonstrated high unit volume growth opportunity.”\nOverall, Microsoft Corporation (NASDAQ:MSFT) ranks 2nd on Insider Monkey’s list titled Top 10 Buzzing AI Stocks Now. While we acknowledge the potential of Microsoft Corporation (NASDAQ:MSFT), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than MSFT but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-07T21:45:21.000Z",
        "Title": "Microsoft (MSFT) Falls More Steeply Than Broader Market: What Investors Need to Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Microsoft (MSFT) closed at $409.54 in the latest trading session, marking a -1.57% move from the prior day. The stock fell short of the S&P 500, which registered a loss of 0.96% for the day. Meanwhile, the Dow experienced a drop of 0.94%, and the technology-dominated Nasdaq saw a decrease of 1.18%.\nPrior to today's trading, shares of the software maker had gained 3.57% over the past month. This has lagged the Computer and Technology sector's gain of 7.35% and the S&P 500's gain of 4.3% in that time.\nThe upcoming earnings release of Microsoft will be of great interest to investors. It is anticipated that the company will report an EPS of $3.08, marking a 3.01% rise compared to the same quarter of the previous year. Meanwhile, the latest consensus estimate predicts the revenue to be $64.42 billion, indicating a 13.98% increase compared to the same quarter of the previous year.\nFor the full year, the Zacks Consensus Estimates project earnings of $13.04 per share and a revenue of $277.36 billion, demonstrating changes of +10.51% and +13.15%, respectively, from the preceding year.\nInvestors should also take note of any recent adjustments to analyst estimates for Microsoft. These recent revisions tend to reflect the evolving nature of short-term business trends. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. The Zacks Consensus EPS estimate has moved 0.01% lower within the past month. At present, Microsoft boasts a Zacks Rank of #4 (Sell).\nIn terms of valuation, Microsoft is presently being traded at a Forward P/E ratio of 31.92. This signifies a premium in comparison to the average Forward P/E of 29.31 for its industry.\nOne should further note that MSFT currently holds a PEG ratio of 2.21. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. The Computer - Software industry had an average PEG ratio of 2.38 as trading concluded yesterday.\nThe Computer - Software industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 62, this industry ranks in the top 25% of all industries, numbering over 250.\nThe Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]