[
    {
        "Date": "2024-01-03T15:29:29.000Z",
        "Title": "Microsoft Copilot is now available on iOS and Android",
        "Author": "  Aisha Malik ",
        "Text": "Over the holiday season, Microsoft quietly launched its Copilot app on Android and iOS, along with iPadOS. The app gives users access to Copilot, formerly known as Bing Chat, which operates similarly to OpenAI's ChatGPT.\nLike other AI chatbot, you can type in a question or a prompt and receive responses generated by artificial intelligence. Users can leverage the AI assistant to draft emails, compose stories or scripts, summarize complex texts, create personalized travel itineraries, write and update job resumes and more. Plus, You can use the app's Image Creator feature, which is powered by DALL·E 3, to explore new styles and ideas, curate social media content, develop brand motifs, generate logo designs, create custom backgrounds, build a portfolio, visualize film and video storyboards and more.\nImage Credits: Microsoft\n\"By combining the power of GPT-4 with the imaginative capabilities of DALL·E 3, Copilot not only enhances your design workflow, but can also bring your creativity to inspiring new heights,\" the app's description reads.\nSince the app's launch over the holidays, Copilot been downloaded more than 1.5 million times so far worldwide across both Android and iOS, according to data provided to TechCrunch by mobile intelligence provider, data.ai.\nWith Copilot, you're getting access to OpenAI's GPT-4 technology for free, which is pretty significant because OpenAI's GPT app runs on GPT-3.5 technology and charges for access to GPT-4.\nThe launch of Copilot on mobile comes as Microsoft rebranded Bing Chat to Copilot back in November. It's worth noting that prior to the launch of Copilot on mobile, you could access similar functionality via the Bing Chat feature on the Bing app. It's possible that Microsoft may plan to replace the Bing app with the Copilot app, but the tech giant hasn't shared anything on that front so far.\nThe mobile launch also comes as Copilot has already been available on the web for some time now. With this latest launch, Microsoft is looking to offer Copilot as a standalone service and expand its reach even more.\nMicrosoft brings Copilot to Windows 10\nThis article originally appeared on TechCrunch at https://techcrunch.com/2024/01/03/microsoft-copilot-is-now-available-on-ios-and-android/\n"
    },
    {
        "Date": null,
        "Title": "Microsoft closes in on Apple's 'most valuable company' title",
        "Author": " Rachelle Akuffo    · Host",
        "Text": "The fight is on in 2024's first trading week as Microsoft (MSFT) dukes it out with Apple for the title of most valuable US company. The tech giants' market caps are neck following two analyst downgrades to the iPhone maker's stock this week.\nYahoo Finance Senior Reporter Jared Blikre observes the two tech companies, also discussing Apple's prior history of annual sales growth.\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\nEditor's note: This article was written by Luke Carberry Mogan.\nRACHELLE AKUFFO: Well, Microsoft is about $100 billion away from overtaking Apple as the most valuable company in the US. This comes after two analysts downgraded Apple this week. \"Yahoo Finance's\" own Jared Blikre is here to break it down for us. The battle of the tech giants, Jared.\nJARED BLIKRE: Yes. And Thank. You for the introduction there. Here is a market cap over the last five years of these two giant companies. And by the way, they're very different companies. But we can compare them. Apple is in purple here. It's currently on top. And here is its $3 trillion plus peak. And here is Microsoft in cyan, just a little bit lower right now. But you can see Microsoft, at times, over the last five years has led Apple for brief periods of time, including coming out of those pandemic lows.\nBut really you go back 10, 20, 30, 40 years and you can really see the difference between those two companies. I'm going to compare now the stock prices of these two companies over the last 10 years. You can see Apple's up 842%. Microsoft is up 904%. So neck and neck right there with Microsoft a slight edge.\nYou look at the 20-year chart. What happened? Apple's up 45,000%. Microsoft up 1,200%. I think a lot of investors would take that. But essentially, if you had to buy 2008 to 2010 to reach any comparable number with Apple, and if you got in between 2000 and 2008, that was dead money. That was a losing trade. And that's because in the wake of the tech bubble, and also the antitrust suit that Microsoft was facing 20 years ago, it just became dead money for about a decade.\nLet me now show you the story in terms of sales growth. This is Apple sales growth going back into the late '90s. This is when Steve Jobs took over. And let's not forget, Apple was left for dead, almost went bankrupt. How about that? But this incredible years-- these years of sales growth here, a lot of them topping 75%. That's the iPod. And then that's the iPhone. And you can see things have trailed off. The services side of the equation has gotten a lot of play here, but it doesn't always live up to expectations.\nRight now, four quarters of declining revenue growth. That is a negative situation for Apple. Expectations are for that to be broken. But we'll have to see how this plays out in earnings season. Give it another month.\nRACHELLE AKUFFO: Looking forward to that. Our very own Jared Blikre. Thank you so much.\n"
    },
    {
        "Date": null,
        "Title": "Microsoft, Apple, Nokia: Morning Movers",
        "Author": " Seana Smith    and Brad Smith    ",
        "Text": "According to a report from The Verge, Microsoft (MSFT) is laying off 1,900 employees from its Activision Blizzard and Xbox divisions, which represents about 8% of its total gaming workers.\nAn International Data Corporation (IDC) report revealed Apple (AAPL) iPhone shipments to China fell 2.1% in the fourth quarter, which add to concerns waning demand for iPhones in the region.\nShares of Nokia (NOK) are spiking on Thursday morning as investors remain optimistic about Nokia's plans to turn the business around, despite the company reporting a decline in sales and drop in profit for the fourth quarter.\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\nEditor's note: This article was written by Nicholas Jacobino\nSEANA SMITH: All right. Let's take a look at some of those individual movers here. Microsoft cutting 1,900 workers in its video gaming divisions. That includes Activision, Blizzard, according to a report by the Verge. Now, the cuts represent about 8% of Microsoft's 22,000 gaming workers. And this comes just three months after the tech giant finalized its buyout of Activision.\nBRAD SMITH: And another big tech company in the news, Apple. IDC reporting iPhone shipments fell 2.1% in China last quarter adding to demand concerns right now. The shares flat just barely to the upside right now.\nSEANA SMITH: All right. Nokia shares jumping this morning, despite reporting a double-digit decline in sales. Also, a drop in profit in the fourth quarter. Investors, though, they seem optimistic about their planned turnaround-- their expected recovery, I should say, and also, future cost controls. JP Morgan writing in a note that quote, \"overall, we see results as strong in a difficult environment.\"\n"
    },
    {
        "Date": null,
        "Title": "Microsoft, Paramount latest to unveil lay off intentions",
        "Author": " Josh Lipton    and Julie Hyman    ",
        "Text": "Microsoft (MSFT) and Paramount (PARA) are the latest companies announcing 2024 layoffs in memos to employees. Yahoo Finance's Josh Lipton and Julie Hyman talk about the balance in the job market as more corporations seek to implement job cuts.\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\nEditor's note: This article was written by Luke Carberry Mogan.\nJOSH LIPTON: Microsoft reportedly telling employees it will cut nearly 2,000 2 roles across Activision Blizzard and Xbox just months after it closed its merger with the video game company. And Paramount CEO Bob Bakish indicated layoffs would be coming in a memo to employees. So this is certainly a trend, Julie, we've seen making headlines, this trend of layoffs, for sure in tech, specifically.\nAnd actually, The Journal has kind of this running list of companies that have already announced layoffs this year within tech. And already this year, Google, eBay, Rent the Runway, Wayfair, Xerox have announced thousands of layoffs, collectively at least. We actually spoke recently to LinkedIn economist kind of about this trend, specifically just in tech. And he told us what he's seeing in terms of his platform. Take a listen to that.\nKORY KANTENGA: Like a lot of things in the US economy, layoffs are seasonal. They primarily happen in January. The second thing to keep in mind is that overall, when we look at the data both at LinkedIn and at the Bureau of Labor Statistics, the labor market seems pretty steady and stable.\nJOSH LIPTON: So it was interesting, at least his take. And again, he's looking at his platform and across the economy. He was not sounding the alarm. At least when it comes to tech, he was kind of arguing that seasonality was playing a real variable when it comes to the layoffs we were seeing in this sector. And I think there's probably some other trends, too. You can talk about the post-pandemic adjustments these companies are making. The boom of AI I'm sure has a lot of them kind of reconsidering who they hire, when they hire, where to commit resources. But it's a trend, and we keep watching it.\nJULIE HYMAN: Yeah. And, you know, reallocation of resources to your point, I think, is a big part of this. You had IBM as one of the companies saying over the past 24 hours that it's going to cut some percentage of jobs this year in the low single digits. But that it actually because of other additions is going to have the same number of employees at year's end as they do now.\nSo you have to look at the net numbers, obviously, when you're talking about layoffs. You can't just look at the numbers that are being cut without the numbers that are also being hired. And if you look kind of zoom out and look at what we have seen in the job market, first of all, we also got weekly jobless claims today. We are seeing those tick higher on the week-over-week basis and on the four-week rolling basis.\nBut if you look at the bigger tally of layoffs from the JOLTS report that comes out, you've definitely seen that we're not back to levels where we were. Yes, there was a spike during the pandemic in layoffs. There was also sort of not a spike but a surge during the financial crisis. But we're not near those levels at this point in terms of those layoffs.\nJOSH LIPTON: Yeah. I know with tech, too, you know, you do hear people asking the question, could it be kind of foreshadowing what's coming? Is it kind of maybe a canary in the coal mine? But to your point, right now, I mean, broadly, this labor market is still sturdy. I mean, it's sub-4-- sub-4% unemployment, wage is growing.\nJULIE HYMAN: Yeah. So it doesn't feel that way yet.\n"
    },
    {
        "Date": "2024-01-19T14:30:03.000Z",
        "Title": "Why Microsoft (MSFT) is a Top Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "If you're a beginner investor, the idea of creating a portfolio from the ground up can feel like an impossible goal to achieve. That's why you should start by looking at stocks that are set to beat the market over the next 12 months, a strategy that's been proven to generate strong returns.\nNow, let's break down why adding this one exceptional stock, highlighted below, to your portfolio could be a recipe for success.\nWhy You Should Pay Attention to Microsoft (MSFT)\nMicrosoft Corporation is one of the largest broad-based technology providers in the world. The company dominates the PC software market with more than 73% of the market share for desktop operating systems.\nOn February 1, 2016, MSFT was added to the Zacks Focus List at $55.09 per share. Shares have increased 614.96% to $393.87 since then.\nOne analyst revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $0.01 to $11.14. MSFT boasts an average earnings surprise of 7.8%.\nAdditionally, Microsoft's earnings are expected to grow 13.6% for the current fiscal year.\nSince stock prices respond to earnings estimate revisions, it can be very profitable to buy stocks with an increased earnings outlook. By buying a Focus List stock like MSFT, then, you're likely getting into a company whose future earnings estimates will be raised, potentially leading to price momentum.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]