[
    {
        "Date": null,
        "Title": "Microsoft, OpenAI report identifies hacker groups using AI",
        "Author": " Josh Lipton    · Host",
        "Text": "Microsoft (MSFT) and OpenAI — which Microsoft owns a 49% stake in — have identified hacker groups from several countries that are using artificial intelligence models in their cyberattacks, drawing on colossal amounts of text to generate human-like responses. In a report released by Microsoft, the hackers came from China, Iran, North Korea, and Russia, among others.\nYahoo Finance Tech Editor Dan Howley joins the Live show to break down the report.\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\nEditor's note: This article was written by Nicholas Jacobino\nJOSH LIPTON: Microsoft and OpenAI identifying groups using artificial intelligence in conjunction with their hacking efforts. For more on how the tech giant is navigating cyber threats in the era of AI, let's get to our very own Dan Howley. Dan.\nDAN HOWLEY: That's right, Microsoft, OpenAI, basically saying that there are groups that are using different forms of large language models and AI, even ChatGPT, to help them kind of hack into enemy nations, the nations that they see as enemies, as well as other groups, NGOs, organizations, Microsoft, probably.\nAnd so, some of the ways in which they're doing this is by using these chat bots, again, ChatGPT being one of them, to look up things like satellite capabilities, radar technologies, reconnaissance information, ways of scripting tasks, improving social engineering for phishing and spear phishing emails.\nAnd you can see here we have China, Iran, North Korea, and Russia, those are the countries that were named in this report. And they have different groups with fun little names like Charcoal Typhoon and Salmon Typhoon. And I think one is Emerald Sheet, that's out of North Korea. So the names sound really cool. But I think it's interesting to point out that we constantly talk about how AI is going to help when it comes to things like business practices or even some consumer applications. But any time there's new technology, hackers are obviously going to look at it as well. And so, that's what's happening here.\nAnd regardless of how much we see an advance of technology in the positive for companies that are defending themselves, cybersecurity specialists, the attackers are always going to be one step ahead. That's just the nature of this game. And so, it's the same way here. There's potential that maybe I can help level that playing field a little bit, but in all likelihood, hackers are going to figure out a way to get around that and continue to stay ahead.\nALEXANDRA CANAL: Yeah, so that's one of the negatives of AI. And this headline caught my attention too. SEC Gary Gensler was saying that investors should be aware of AI washing because we've seen a lot of activity in those stocks that even mentioned AI on their earnings calls. I wanted to get your take on that because I know you cover the space closely. Obviously, AI seems to be the buzzword right now. What do you make of the SEC now saying, look, you got to be careful?\nDAN HOWLEY: I mean, look, it's real, right? I mean, you could talk to-- I mean, I got COVID, so I couldn't go to CES. But our own Akiko Fujita did. And she was saying that everything there was basically AI, right? It's the gluten-free now of the tech world, where you would just slap it on. I don't know what vodka has gluten in it, but apparently Tito's has to tell you that it's gluten-free. And so, regardless, it's the same idea, right? You're slapping a name on something so that people go, oh, that's got AI on it, I might as well jump on board. And so you're going to see companies do that. We saw that with the Metaverse, we saw it with NFTs. Any company that even thinks about dabbling into it is going to call that out.\nAnd, I mean, obviously, the Metaverse is somewhere at this point. I just did a piece on how Epic is basically eating Meta's lunch when it comes to getting the Metaverse going. But NFTs, that's really not around, is it? So. I mean, obviously, AI has far more practical implications than a script saying that I own a digital version of a cat eating a hot dog that you can also copy and gives me absolutely nothing but empties my bank account. But I do think that it's going to be one of those things where you continue to see AI just labeled on anything to get attention.\nJOSH LIPTON: Yeah.\nALEXANDRA CANAL: The AI bubble not bursting anytime soon. So, Yahoo Finance's Dan Howley, thank you so much for those insights.\n"
    },
    {
        "Date": "2024-02-09T13:30:04.000Z",
        "Title": "If You Invested $1000 in Microsoft a Decade Ago, This is How Much It'd Be Worth Now",
        "Author": "  Zacks Equity Research ",
        "Text": "For most investors, how much a stock's price changes over time is important. This factor can impact your investment portfolio as well as help you compare investment results across sectors and industries.\nAnother thing that can drive investing is the fear of missing out, or FOMO. This particularly applies to tech giants and popular consumer-facing stocks.\nWhat if you'd invested in Microsoft (MSFT) ten years ago? It may not have been easy to hold on to MSFT for all that time, but if you did, how much would your investment be worth today?\nMicrosoft's Business In-Depth\nWith that in mind, let's take a look at Microsoft's main business drivers.\nMicrosoft Corporation is one of the largest broad-based technology providers in the world. The company dominates the PC software market with more than 73% of the market share for desktop operating systems.The company’s Microsoft 365 application suite is one of the most popular productivity software globally. It is also one of the prominent public cloud providers that can deliver a wide variety of infrastructure-as-a-service (IaaS) and platform-as-a-service (PaaS) solutions at scale.Redmond, WA-based Microsoft’s products include operating systems, cross-device productivity applications, server applications, business solution applications, desktop and server management tools, software development tools and video games. Its software solutions and hardware devices are playing an important role in developing the metaverse.The company designs and sells PCs, tablets, gaming and entertainment consoles, other intelligent devices, and related accessories. Through Azure, it offers cloud-based solutions that provide customers with software, services, platforms and content.Microsoft reported revenues of $211.9 billion in fiscal 2023. The company reports operations under three segments: Productivity & Business Processes, Intelligent Cloud and More Personal Computing.Productivity & Business Processes accounted for 32.6% of fiscal 2023 revenues. The segment offers productivity and collaboration tools and services including Office 365, Dynamics business solutions, Teams, Relationship Sales solution, Power Platform and LinkedIn.Intelligent Cloud, which include Azure cloud services, contributed to 41.4% of fiscal 2023 revenues.In Jan, 2022, the company entered into a definitive agreement to acquire Activision Blizzard. The acquisition will accelerate the growth in Microsoft’s gaming business across mobile, PC, console, and cloud gaming. Microsoft and Activision Blizzard have jointly agreed to extend the merger agreement through Oct 18, 2023 to allow for additional time to resolve remaining regulatory concerns.More Personal Computing represented 25.8% of fiscal 2023 revenues. The segment comprises mainly the Windows, Gaming (Xbox hardware and Xbox software and services), Devices (Surface, PC accessories, and other intelligent devices) and Search (Bing and Microsoft Advertising) businesses.\nBottom Line\nAnyone can invest, but building a successful investment portfolio takes a combination of a few things: research, patience, and a little bit of risk. So, if you had invested in Microsoft a decade ago, you're probably feeling pretty good about your investment today.\nA $1000 investment made in February 2014 would be worth $11,326.86, or a gain of 1,032.69%, as of February 9, 2024, according to our calculations. This return excludes dividends but includes price appreciation.\nCompare this to the S&P 500's rally of 178.12% and gold's return of 54.15% over the same time frame.\nLooking ahead, analysts are expecting more upside for MSFT.\nMicrosoft’s second-quarter results gained from strong Intelligent Cloud and Productivity and Business Processes revenues. Productivity and Business Processes revenues rose due to a strong adoption of Office 365 Commercial solutions. Microsoft 365 Consumer subscribers grew to 78.4 million. Continued momentum in the small and medium businesses, frontline worker offerings and a gain in revenue per user drove the top line. Intelligent Cloud revenues were driven by growth in Azure and other cloud services. Solid adoption of Azure AI, which now has a clientele of more than 53,000 customers holds promise. However, Office's declining commercial licensing has been a headwind due to the continued customer shift to cloud offerings. Higher operating expenses and spend on Azure enhancements amid stiff competition in the cloud space remains a concern.\nShares have gained 7.66% over the past four weeks and there have been 15 higher earnings estimate revisions for fiscal 2024 compared to none lower. The consensus estimate has moved up as well.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": null,
        "Title": "S&P 500 tops 5,000, Microsoft on track to become most valuable company ever: Yahoo Finance Live",
        "Author": "Yahoo Finance Video ",
        "Text": "The S&P 500 (^GSPC) is trading above 5,000. It briefly touched the benchmark on Thursday just before the close, but good inflation news led to the index moving firmly into positive territory on Friday. One of the stocks to watch in today’s trading is Microsoft (MSFT). If the tech giant holds on to its gains, it will surpass Apple’s (APPL) $3.09 trillion to become the company with the highest market cap ever. Other trending tickers on Yahoo Finance include Nvidia (NVDA), Cloudflare (NET), and Expedia Group (EXPE).\nTop guests on Yahoo Finance Live today include:3:05 p.m. ET - Ben Kirby, Thornburg Investment Management Co-Head of Investments3:35 p.m. ET - Paul Golding, Macquarie Senior US Lifestyle & Payments Analyst4:05 p.m. ET - Nathan Sheets, Citi Chief Global Economist4:20 p.m. ET - Amanda Frasier, Forbes Travel Guide President of Ratings\n"
    },
    {
        "Date": "2024-02-15T20:00:13.000Z",
        "Title": "Microsoft Is Taking Four Xbox Exclusives to PlayStation, Nintendo Switch",
        "Author": "  Dina Bass ",
        "Text": "(Bloomberg) -- Microsoft Corp. will make four exclusive Xbox games available for Nintendo Co.’s Switch and Sony Group Corp.’s PlayStation, sharing homegrown titles with rivals in the first significant way as the company looks to boost revenue in a stagnant gaming market.\nMost Read from Bloomberg\nYour 401(k) Will Be Gone Within a Decade\nCapital One to Buy Discover for $35 Billion in Year's Biggest Deal \nLargest Covid Vaccine Study Yet Finds Links to Health Conditions\nStocks Fall Before Nvidia’s Must-Watch Earnings: Markets Wrap\nUS Tells Allies Russia May Launch Anti-Satellite Nuclear Weapon Into Space This Year\nHaving more outlets to increase games sales will give Microsoft the resources to move forward with some “early plans” for future consoles, as well as new devices, Gaming Chief Executive Officer Phil Spencer said Wednesday in an interview ahead of a press event.\n“We're going to be able to do more innovative things in hardware, the more the game side of the business is having success,” he said. “I get excited about different form factors that allow people to play in different places.”\nNot all four games will be available on both rival consoles, Spencer said. He declined to name the titles.\nSubscribe to Game On, and dive deep inside the video game business with Jason Schreier’s weekly newsletter.\nAfter a nearly two-year process, Microsoft completed its $69 billion acquisition of Activision Blizzard in October, giving Xbox a vast array of new content but also an imperative to reap financial returns.\nMicrosoft now faces choices about when to give Xbox an advantage with exclusive games. Exclusives can drive purchases of Xbox hardware. But sharing titles with Nintendo and Sony means more copies of games will be sold.\nOver the past decade, Microsoft has sweetened the appeal of owning an Xbox by making three large game acquisitions and several smaller ones, giving the tech giant access to more exclusive content. But Microsoft also has to tread carefully in making titles exclusive, since that was a major sticking point in the antitrust review of its purchase of Activision Blizzard. As a concession, Microsoft agreed to continue selling Activision’s highly lucrative Call of Duty on rival platforms.\nWhen Microsoft buys a company that supplies games for Sony, for example, and then makes those games exclusively for Xbox, it’s losing a revenue stream. The company has kept MineCraft, the first big acquisition under Spencer, on rival platforms and delivered on games promised exclusively to Sony after acquiring ZeniMax Inc. and its storied Bethesda Softworks in 2020. And in documents filed with Brazilian regulators in 2022, the company said it simply wouldn’t be profitable for Microsoft to keep Call of Duty games off PlayStation.\nMicrosoft said Thursday the first Activision Blizzard game coming to its Game Pass subscription service will be Diablo IV on March 28. Game Pass will remain Xbox and PC-only.\n“If you're a PlayStation customer, you should not think that there's some plan that this is the beginning of all of the games coming to PlayStation or Nintendo,” Spencer said. “We don't have that plan today.”\nFor now, there is no intention to make the role-playing game Starfield and a new Indiana Jones game, from Microsoft’s Bethesda studio, available on other consoles, Spencer said, despite speculation to the contrary.\n“We want to learn, to see what's going to happen,” Spencer said. “I don't know if these games are going to be considered Xbox games when they hit those other platforms, and maybe they don't find an audience for some reason.”\nBy not identifying the four games that will be available on Switch and PlayStation, Microsoft risks continuing to anger Xbox players, who have taken to social media to protest the move. Without exclusive games, they say, it makes no sense to buy an Xbox. Game developers, they worry, will come to the same conclusion and make their titles for PlayStation or Nintendo, which have more market share, further eroding the value of owning an Xbox and ultimately killing the possibility of any future Xbox hardware.\nBut Spencer has said in the past that the idea of games made exclusively for one device “is something we’re just going to see less and less of.”\nMost Read from Bloomberg Businessweek\nGene Therapy Makers Struggle to Find Patients for Miracle Cures\nPursuing ‘American Dynamism,’ Andreessen Horowitz Ups Its Game in DC\nThe Rise of Starlink as a Geopolitical Force\nHow Paramount Became a Cautionary Tale of the Streaming Wars\nHow Uber Beat the Skeptics and Became Profitable\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-02-07T19:33:00.000Z",
        "Title": "Time to Buy Microsoft's (MSFT) Stock for More Upside",
        "Author": "  Shaun Pruitt ",
        "Text": "It’s been just over a week since Microsoft MSFT reported its fiscal second quarter results with Q2 earnings of $2.93 a share topping the Zacks Consensus by 6% and sales of $62.02 billion beating estimates by over 1%.\nAlthough Microsoft’s stock performance has been virtually flat since eclipsing its Q2 top and bottom-line expectations brokers are high on the software giant's outlook. \nGrowth & Recent Performance \nIt may have been easier to miss Microsoft’s Q2 report with many of its Magnificent Seven peers reporting their quarterly results last week as well including the likes of Amazon (AMZN), Apple (AAPL), and Meta Platforms (META).\nWith that being said, Microsoft’s Q2 earnings did jump 26% year over year with quarterly sales rising 17%. Microsoft’s growth has been fueled by its cloud services and annual earnings are now projected to rise 18% in fiscal 2024 to $11.60 per share with total sales forecasted to climb 15% to $243.38 billion.\nImage Source: Zacks Investment Research\nMicrosoft’s stock is still up +54% over the last year and anticipation of double-digit EPS and sales growth in FY25 as well should keep investors engaged.  \nImage Source: Zacks Investment Research\nEarnings Estimate Revisions & Broker Recommendations\nMaking a stronger case for buying Microsoft’s stock is that earning estimates for FY24 and FY25 are nicely up over the last 30 days and have risen 3% in the last week respectively.\nImage Source: Zacks Investment Research\nMicrosoft currently has an average broker rating (ABR) of 1.14 on a scale of 1 to 5 (Strong Buy to Strong Sell). To that point, 33 out of the 37 brokers covering Microsoft's stock and providing data to Zacks have strong buy ratings with three having buy ratings and only one at a hold.\nImage Source: Zacks Investment Research\nBottom Line\nThere does appear to be more room to run for Microsoft’s stock with the Average Zacks Price Target of $438.97 a share suggesting 8% upside. Notably, Microsoft’s stock currently sports a Zacks Rank #2 (Buy) in correlation with the trend of positive earnings estimate revisions following the company’s favorable Q2 results.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]