[
    {
        "Date": "2024-03-09T12:00:22.000Z",
        "Title": "Microsoft (NASDAQ:MSFT) shareholders have earned a 30% CAGR over the last five years",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose your money. But on a lighter note, a good company can see its share price rise well over 100%. For example, the Microsoft Corporation (NASDAQ:MSFT) share price has soared 250% in the last half decade. Most would be very happy with that. The last week saw the share price soften some 2.2%.\nLet's take a look at the underlying fundamentals over the longer term, and see if they've been consistent with shareholders returns.\n Check out our latest analysis for Microsoft \nThere is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. One flawed but reasonable way to assess how sentiment around a company has changed is to compare the earnings per share (EPS) with the share price.\nDuring five years of share price growth, Microsoft achieved compound earnings per share (EPS) growth of 21% per year. This EPS growth is lower than the 29% average annual increase in the share price. This suggests that market participants hold the company in higher regard, these days. And that's hardly shocking given the track record of growth.\nThe image below shows how EPS has tracked over time (if you click on the image you can see greater detail).\nWe know that Microsoft has improved its bottom line lately, but is it going to grow revenue? If you're interested, you could check this free report showing consensus revenue forecasts.\nWhen looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. In the case of Microsoft, it has a TSR of 268% for the last 5 years. That exceeds its share price return that we previously mentioned. The dividends paid by the company have thusly boosted the total shareholder return.\nIt's nice to see that Microsoft shareholders have received a total shareholder return of 65% over the last year. Of course, that includes the dividend. Since the one-year TSR is better than the five-year TSR (the latter coming in at 30% per year), it would seem that the stock's performance has improved in recent times. Given the share price momentum remains strong, it might be worth taking a closer look at the stock, lest you miss an opportunity. It's always interesting to track share price performance over the longer term. But to understand Microsoft better, we need to consider many other factors. Take risks, for example - Microsoft has   1 warning sign   we think you should be aware of.\nWe will like Microsoft better if we see some big insider buys. While we wait, check out this free list of growing companies with considerable, recent, insider buying.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-10T13:00:00.000Z",
        "Title": "Better Artificial Intelligence (AI) Stock: Nvidia vs. Microsoft",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Nvidia (NASDAQ: NVDA) and Microsoft (NASDAQ: MSFT) are two of the market's hottest artificial intelligence (AI) stocks. Nvidia's high-end GPUs are used to process complex AI tasks in data centers, while Microsoft is a leading investor in OpenAI. Microsoft has also been integrating OpenAI's generative AI tools directly into its cloud, search, and productivity tools.\nOver the past three years, Nvidia's stock has soared more than 600% while Microsoft's stock has rallied just over 70%. Nvidia was clearly the better play on the booming AI market, but will it continue to outperform Microsoft over the next few years?\nIn fiscal 2024, which ended this January, Nvidia's revenue surged 126% to $60.9 billion as its adjusted earnings per share (EPS) soared 288%. That marked a dizzying acceleration from its flat revenue growth and 25% decline in adjusted EPS in fiscal 2023.\nThe company struggled in fiscal 2023 as the PC market's post-pandemic slowdown throttled its sales of gaming GPUs. The crypto market's meltdown exacerbated that pressure as disillusioned miners flooded the market with secondhand GPUs.\nThe macro headwinds also drove some companies to rein in their purchases of new data center GPUs.\nBut in fiscal 2024, the soaring popularity of ChatGPT and other generative AI platforms sparked a buying frenzy in its data center GPUs. Its sales of gaming GPUs also stabilized in the second half of the year as the PC and crypto markets recovered.\nNvidia generated 78% of its revenue from its data center GPUs in fiscal 2024, and the market's demand is still outstripping its supply by a wide margin. From fiscal 2024 to fiscal 2027, analysts expect its revenue to have a compound annual growth rate (CAGR) of 35% as its EPS increases at a CAGR of 39%. Those growth rates are astonishing, but its stock still doesn't look terribly expensive at 39 times forward earnings.\nNvidia seems like a simple way to profit from the growth of the generative AI market, which Fortune Business Insights estimates will have a CAGR of 47.5% from 2023 to 2030. But investors shouldn't overlook its longer-term challenges.\nAMD is rolling out cheaper data center GPUs, its top cloud customers are developing their own first-party chips, and start-ups like Groq are creating faster dedicated chips to process natural language queries. Chinese chipmakers could also launch alternative AI chips to counter the export curbs on Nvidia's top-tier chips.\nMicrosoft is more diversified. Its sprawling ecosystem houses its Windows operating system, Office productivity software, Azure cloud infrastructure platform, Bing search engine, Xbox gaming business, and Surface hardware devices.\nIn fiscal 2023 (which ended last June), Microsoft's revenue and adjusted EPS both rose 7% as the expansion of its cloud business -- which includes Azure, Microsoft 365, and Dynamics 365 -- offset the slower growth of its Windows, Surface, and Xbox divisions, which all faced fierce headwinds as the PC and gaming markets cooled off in a post-pandemic world.\nBut for fiscal 2024, analysts expect Microsoft's revenue and adjusted EPS to increase 15% and 19%, respectively, as the growth of its cloud business accelerates again. That acceleration was driven by the integration of OpenAI's generative AI tools directly into Microsoft's cloud-based services.\nAs result, Microsoft's Azure -- the world's second-largest cloud infrastructure platform -- has been growing faster than the market leader Amazon Web Services (AWS), as well as its third-place competitor, Alphabet's Google Cloud.\nFrom fiscal 2024 to fiscal 2026, analysts expect Microsoft's revenue to have a CAGR of 14% as its EPS increases at a CAGR of 16%. Those estimates assume its cloud business will continue to expand, the PC market will recover, and its acquisition of Activision Blizzard will significantly strengthen its Xbox gaming division.\nThose growth rates suggest Microsoft is still a sound way to profit from the expansion of the cloud, AI, and gaming markets -- but its stock isn't cheap at 30 times next year's earnings. If Microsoft's cloud business loses its momentum or antitrust regulators challenge its investments in OpenAI, its valuations could decline and drive its stock lower.\nNvidia and Microsoft are both promising plays on the AI market, but Nvidia's simpler business model, higher growth rates, and more reasonable valuations make it the better buy. Nvidia's investors should keep an eye on the competitive and regulatory headwinds, but it could be years before any of those challenges limit its growth.\nUntil then, Nvidia will continue to sell the market's best shovels for the AI gold rush -- and it could even eclipse Microsoft's market cap in just a few years.\nShould you invest $1,000 in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 8, 2024\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nBetter Artificial Intelligence (AI) Stock: Nvidia vs. Microsoft was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-22T15:00:49.000Z",
        "Title": "Which Stock Is the Better Investment in 2024: Apple or Microsoft?",
        "Author": "  James Holbach ",
        "Text": "There are just five U.S. companies with a market capitalization of $1 trillion or more: Alphabet, Amazon, Apple, Microsoft and Nvidia. These five companies, along with Tesla and Meta, make up the group known as the Magnificent Seven. To give you a sense of their scale, the Magnificent Seven’s total market cap is larger than the entire Chinese stock market, and over four times the size of the total U.K. market.\nCheck Out: 10 Valuable Stocks That Could Be the Next Apple or AmazonRead Next: One Smart Way To Grow Your Retirement Savings in 2024\nApple (AAPL) and Microsoft (MSFT) are competitors, although perhaps not as directly as they once were — remember the ‘I’m a PC’ commercials? Investors that have held either, or both, stocks over the years have been richly rewarded. There’s no doubt that these two are among the most successful companies ever, but which one is the better investment in 2024?\nSponsored: Protect Your Wealth With A Gold IRA. Take advantage of the timeless appeal of gold in a Gold IRA recommended by Sean Hannity.\nTejas Dessai, AVP and research analyst at GlobalX ETFs, said that both stocks are very well positioned this year, but also acknowledged that there are some risks.\n“Apple clearly has a growth problem,” Dessai said. “The iPhone business is pretty mature, China presents major headwinds and the company is viewed as a late entrant to artificial intelligence. But valuation is quite attractive, and the services and wearables business could continue to cut deeper. Meanwhile Microsoft is in a remarkable position to grow utilizing AI as a tailwind, but we think valuation is quite rich at this point and the immediate upside could be limited.”\nSee More: Warren Buffett Sold His Apple Stock – Here’s Why\nWinner: Microsoft\nA company’s ability to grow its earnings over time is an important factor in its suitability as an investment, so knowing whether Apple or Microsoft is likely to grow faster will be a key consideration. Dessai isn’t the only one concerned with Apple’s growth prospects. The analyst consensus growth rate over the next five years for Apple is 11% per year, the lowest five-year growth rate of any Magnificent Seven stock. Compare that to Microsoft’s consensus growth rate of 16.3% and it’s clear which company is better positioned to grow in the near to mid term.\nWinner: Apple\nWhile growth potential is important when evaluating a potential investment, valuation is equally if not more important. At the end of the day, price is what determines your return on investment, meaning even the very best companies can be a bad investment if you overpay.\nOne of the most common ratios used to measure valuation of publicly traded stocks is the price to earnings (P/E) ratio. The higher the ratio, the more richly a stock is being valued. As Dessai noted, Microsoft is trading at a higher multiple. Its trailing 12-month P/E ratio is 36.76, while Apple is trading at a ratio of 26.51, significantly lower. In simple terms what this means is that Microsoft must grow earnings much faster than Apple to achieve a similar return on investment.\nWinner: Apple\nUnderstanding a company’s financial strength is a good way to help you know how risky of an investment the stock will be. While both Apple and Microsoft are massive companies and enjoy the financial stability that comes with size, that doesn’t mean they’re on equal footing. There are a million ways to measure financial strength, so it can be helpful to pick a measure that incorporates multiple factors. One such measure is the Piotroski F-score, named after its creator, Stanford accounting professor Joseph Piotroski.\nThe F-score looks at nine different metrics to assign a score between zero and nine. Scores of eight and nine are considered strong. Microsoft currently rates an F-score of seven, which is solid if not spectacular. Apple, however, receives an eight, indicating better overall fundamentals as a business.\nObviously, as members of the Magnificent Seven, both Apple and Microsoft are outstanding businesses, and investors are unlikely to have a bad result investing in either. Right now, though, Apple appears to be the top choice to invest in based on the underlying fundamentals and cheaper valuation.\nHowever, things can change quickly in the stock market, so be sure to review your investments on a regular basis to make sure you feel good about continuing to hold them.\nIt may also be worth your while to consider other investment options. Given the incredible run that the Magnificent Seven have been on over the last few years, there is a legitimate question of how long they can continue to outperform on that level. The tide may already be going out — Tesla, for example, is trading around $175, well below its 2023 high of almost $300 per share.\n“Both [Microsoft and Apple] remain remarkable bets in the long run as we witness a moment of mass disruption unfold with AI,” Dessai noted. “But chances are most investors are also significantly exposed to both the names through their core S&P 500 or Nasdaq 100 exposure. We think growth in 2024 is going to favor companies benefiting from investments going into artificial intelligence, and we’d suggest investors look at non-Magnificent Seven stocks to capture maximum upside.”\nMore From GOBankingRates\nDownsizing for Retirement? Avoid These 6 Mistakes\n5 Rare Coins That Sold for At Least $600,000\nThese 10 Aldi Brand Products Are Worth Every Penny\nThe Biggest Mistake People Make With Their Tax Refund -- And How to Avoid It\nThis article originally appeared on GOBankingRates.com: Which Stock Is the Better Investment in 2024: Apple or Microsoft?\n"
    },
    {
        "Date": null,
        "Title": "OpenAI turned Microsoft 'subsidiary': Elon Musk sues Sam Altman",
        "Author": " Seana Smith    and Brad Smith    ",
        "Text": "Tesla (TSLA) CEO Elon Musk has moved to sue OpenAI and CEO Sam Altman over what he alleges is a breach of contract. Musk claims the company is no longer following its original goal of helping humanity, instead focused on profits. \"OpenAI has been transformed into a closed-source de facto subsidiary of the largest technology company in the world: Microsoft,\" the lawsuit states.\nYahoo Finance Anchors Brad Smith and Seana Smith break down this latest development in the relationship between Musk and Altman.\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\nEditor's note: This article was written by Nicholas Jacobino\nBRAD SMITH: Elon Musk is suing OpenAI and its CEO Sam Altman, saying, the company is no longer following its original goal to create AI to benefit humanity. And instead, has opted to focus on profit.\nNow, Musk is claiming in the lawsuit that this pivot breaches their contract here. Musk had also brought up that he was originally presented with this idea of an open source type of AI platform and language learning model capability by Altman here.\nLarger question, as we've seen some of these suits or allegations come forward, where this will net out, especially among some of the big investors that OpenAI has been able to take on billions of dollars from at this point.\nSEANA SMITH: Yeah. I think the question is what the outcome is going to potentially look like, what some of those changes could result and end up being as a result of this lawsuit. But really, this is just the latest in this ongoing strained relationship, to say the least, between Elon Musk and Sam Altman.\nSo Elon Musk here filing this lawsuit saying that the company is really just strayed from that original nonprofit mission. And we know that Musk was an early investor within the SpaceX co-founded OpenAI in 2015. Stepped down from its board in 2018. But within this lawsuit bringing up the issue that he's saying that their deal here with Microsoft for more than $10 billion, that really represents the fact that it has strayed from their initial mission.\nAnd he went on to say that OpenAI has been transformed into a closed source de facto subsidiary of the largest technology company, Microsoft. So I think the question here is just where this ends up, how this ends up, and what changes could, in fact, be implemented as a result of this.\n"
    },
    {
        "Date": "2024-03-18T12:45:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Microsoft, Coca-Cola, Accenture, Applied Materials and Pfizer",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – March 18, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Microsoft Corp. MSFT, The Coca-Cola Co. KO, Accenture plc ACN, Applied Materials, Inc. AMAT and Pfizer Inc. PFE.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corp., The Coca-Cola Co. and Accenture plc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Microsoft has modestly outperformed the Zacks Tech sector over the past year (+55.9% vs. +51.3%) and done far better than the broader market over the same time period (+55.9% vs. +32.4% for the S&P 500 index). The company’s last quarterly results benefited from strong Intelligent Cloud and Productivity and Business Processes revenues. Productivity and Business Processes revenues rose due to a strong adoption of Office 365 Commercial solutions.Microsoft 365 Consumer subscribers grew to 78.4 million. Continued momentum in the small and medium businesses, frontline worker offerings and a gain in revenue per user drove the top line. Intelligent Cloud revenues were driven by growth in Azure and other cloud services. Solid adoption of Azure AI, which now has a clientele of more than 53,000 customers holds promise.However, Office's declining commercial licensing has been a headwind due to the continued customer shift to cloud offerings. Higher operating expenses and spend on Azure enhancements amid stiff competition in the cloud space remains a concern.(You can read the full research report on Microsoft here >>>)Shares of Coca-Cola have gained +3.5% over the past year against the Zacks Beverages - Soft drinks industry’s gain of +7.9%. The company continues to witness positive business trends as reflected by its robust surprise history. KO’s sales and earnings beat estimates for the third consecutive quarter in third-quarter 2023.Earnings and sales also improved year over year. Strong revenue growth across most of its operating segments aided by improved price/mix and increased concentrate sales boosted the results. It is poised to gain from innovations and accelerating digital investments. It provided an upbeat guidance for 2023.However, shares of Coca-Cola lagged the industry in the past year. KO continues witness inflationary cost pressures, related to higher commodity and material costs, as well as higher marketing investments.(You can read the full research report on Coca-Cola here >>>)Accenture shares have outperformed the Zacks Consulting Services industry over the past year (+51.8% vs. +48.1%). Technological prowess, contribution from acquisitions, strong growth prospects and dividend payouts make the shares attractive.The company continues to witness strong demand for application modernization and maintenance, cloud enablement and cybersecurity-as-a-service. These trends are boosting its managed services business across the world. A disciplined acquisition strategy helps Accenture to channelize business in high-growth areas.On the flip side, pricing pressure due to significant competition from strong companies like Genpact, Cognizant and Infosys, remains a concern. Global presence exposes the company to foreign currency exchange rate fluctuations.(You can read the full research report on Accenture here >>>)Other noteworthy reports we are featuring today include Applied Materials, Inc. and Pfizer Inc.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nAccenture PLC (ACN) : Free Stock Analysis Report\nCocaCola Company (The) (KO) : Free Stock Analysis Report\nPfizer Inc. (PFE) : Free Stock Analysis Report\nApplied Materials, Inc. (AMAT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]