[
    {
        "Date": "2024-04-16T17:07:09.000Z",
        "Title": "Call of Duty League Billionaire Owners Get Break from Microsoft",
        "Author": "  Cecilia D'Anastasio ",
        "Text": "(Bloomberg) -- Microsoft Corp.’s Activision unit is offering teams competing in its professional Call of Duty League financial relief as the esports industry faces broad challenges generating profit.\nMost Read from Bloomberg\nTikTok to Remove Executive Tasked With Fending Off US Claims\nTesla Spends Weekend Cutting Prices of Cars and FSD Software\nThe Fed’s Forecasting Method Looks Increasingly Outdated as Bernanke Pitches an Alternative\nElon Musk’s Robotaxi Dreams Plunge Tesla Into Chaos\nThe teams, including ones owned by sports-business billionaires Robert Kraft and Stan Kroenke, will no longer be required to pay the league’s entry fees, according to a blog post on Tuesday. Previously collected fees will be returned. A lawsuit this year from a former owner identified the fees as $27.5 million per franchise.\nOwners will also receive a higher share of sales from in-game items, like team-branded digital costumes, and get subsidies for organizing live events. Activision is also offering the teams two-year minimum revenue guarantees.\nActivision launched a city-based league for competitions based on its popular Call of Duty video game in 2020. But esports organizations have struggled as turnout for live events proved less than anticipated and sponsors pulled away.\nBloomberg previously reported that Activision was in talks to boost the teams’ revenue split.\nMost Read from Bloomberg Businessweek\nWhat Really Happens When You Trade In an iPhone at the Apple Store\nRents Are the Fed’s ‘Biggest Stumbling Block’ in Taming US Inflation\nChina’s Bubble Tea Boom Creates a Half-Dozen Billionaires\nThe Pentagon Wants to Give Defense Startups a Chance \nAging Copper Mines Are Turning Into Money Pits Despite Demand\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-04-26T13:45:23.000Z",
        "Title": "Microsoft beats Q3 top and bottom lines on cloud strength",
        "Author": " Daniel Howley    · Technology Editor",
        "Text": "Microsoft (MSFT) shares rose on Friday after it reported its fiscal third quarter earnings, beating analysts' estimates on the top and bottom lines on the strength of its cloud computing business.\n“Microsoft Copilot and Copilot stack are orchestrating a new era of AI transformation, driving better business outcomes across every role and industry,\" Microsoft CEO Satya Nadella said in a statement.\nMicrosoft said on Thursday that its AI services contributed 7 percentage points of growth to its Azure and other cloud services revenue. That's up from 6 percentage points in Q2, and 3 points in Q1. Microsoft first broke out its AI percentage contributions to Azure in Q4 last year, saying it added 1 percentage point to Azure revenue at the time.\nThe company also said it anticipates Q4 revenue of between $63.5 billion and $64.5 billion, just a head of analysts' expectations of $64.7 billion.\nMicrosoft CFO Amy Hood said during the company's earnings call that the tech giant is seeing near term AI demand outstrip available capacity.\nShares of Microsoft were up about 2% on Friday.\nMicrosoft reported earnings per share (EPS) of $2.94 on revenue of $61.9 billion. Wall Street was anticipating EPS of $2.83 on revenue of $60.88 billion, according to analysts’ estimates compiled by Bloomberg.\nMicrosoft's overall commercial cloud revenue came in at $35.1 billion, ahead of Wall Street estimates of $33.93 billion. On a segment bases, Microsoft saw Productivity and Business Processes revenue of $19.57 billion, beating expectations of $19.54 billion. Intelligent Cloud and More Personal Computing revenue came in at $26.71 billion and $15.58 billion, respectively. That was better than the $26.25 billion and $15.07 billion analysts expected, respectively.\nThe revenue beat in More Personal Computing was driven by 11% growth in Windows OEM sales to PC manufacturers and 62% growth in Xbox content and services sales, with 61% attributable to the net impact of Microsoft's acquisition of Activision Blizzard.\nShares of Microsoft are up more than 10% year to date, behind rivals such as Google parent Alphabet (GOOG, GOOGL) and Amazon (AMZN), which are up 15% and 22%, respectively. Over the last 12 months, Microsoft’s shares have climbed 32%, though Amazon has jumped 67%, while Google is up 47%.\nThe three companies are battling it out to see which can offer the most comprehensive AI solutions to enterprise customers and customers, whether that means making heavy investments in third-party firms like OpenAI and Anthropic or reorganizing their internal teams like Google.\nMicrosoft’s AI ambitions got a healthy boost on Tuesday when it announced that Coca-Cola (KO) signed a five-year, $1.1 billion agreement to use the software giant’s Azure cloud services and AI technology.\n“Through our long-term partnership, we have made significant progress to accelerate system-wide AI transformation across The Coca-Cola Company and its network of independent bottlers worldwide,” Microsoft executive vice president and chief commercial officer Judson Althoff said in a statement.\nMicrosoft has unleashed a torrent of new AI features and services for its enterprise and productivity apps and consumer platforms ever since it first debuted its revamped version of Bing and its AI chatbot in February 2023.\nIn March, Microsoft announced that it hired DeepMind AI and Inflection AI co-founder Mustafa Suleyman, fellow Inflection AI co-founder Karén Simonyan, as well as a number of the company’s staff members. Suleyman is taking up a new post at Microsoft as CEO of the Microsoft AI division.\nIn February, Microsoft announced a multiyear partnership with French AI startup Mistral that would allow Microsoft to offer the company’s models on its Azure platform.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": null,
        "Title": "Microsoft is 'the highest quality company one can own': Analyst",
        "Author": " Julie Hyman    · Host",
        "Text": "With Wall Street at the center of a busy tech earnings cycle, investors may seek to identify tech stocks worth adding to their portfolios. Washington Crossing Advisors Senior Portfolio Manager and Co-Founder Chad Morganlander joins Market Domination for the latest edition of Good Buy or Goodbye, providing insight on the hottest tech plays.\nMorganlander names Microsoft (MSFT) his \"good buy,\" claiming it is the \"highest quality company one can own,\" with its rising dividend payment to investors. He also cites its highly diversified AI strategy and subscription models, which lower earnings volatility.\nThe senior portfolio manager calls IBM (IBM) his \"goodbye,\" claiming it is a lower-quality company with a high valuation for its debt. The infrastructure and consulting units of the company are also lagging, he adds.\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Nicholas Jacobino\n"
    },
    {
        "Date": "2024-04-30T13:30:00.000Z",
        "Title": "Franklin Templeton Collaborates with Microsoft on Personalized Financial AI Platform",
        "Author": "Business Wire ",
        "Text": "Creating efficiency at scale across the enterprise\nSAN MATEO, Calif., April 30, 2024--(BUSINESS WIRE)--Franklin Templeton is working with Microsoft to build an advanced financial AI platform marking a significant step toward transforming the financial services industry. The platform will use composable business applications to help Franklin Templeton rapidly embed AI in its processes and enable digital transformation at scale. The two firms – leaders in their respective industries – are aligning capabilities to facilitate continuous innovation within financial services.\nThis new AI platform will be built using Microsoft Azure AI services including Azure OpenAI Service (GPT-4 model), Azure AI Search, and Azure AI Document Intelligence. A first potential benefit will be to improve the productivity of sales and marketing teams and to create more personalized support for their clients.\n\"The platform will use a multi-layer intelligence approach, where individual AI capabilities can be synchronized to create an advanced level of intelligence for our business,\" said Deep Srivastav, Head of AI for Franklin Templeton. \"As we went through our early work on this, we realized how cutting edge this can be and decided to build this together.\"\nPersonalized experiences are key to delivering differentiated value to financial services clients. It is, however, challenging to merge structured data with contextual financial information, which means they are usually kept separate, with many AI initiatives thus focusing on limited capabilities such as summarization and basic conversations. Combining the two in a single, powerful capability is exactly what this collaboration aims to achieve.\n\"The future of how we work with clients to best meet their desired investment outcomes will require strong technological resources,\" said Jenny Johnson, President and CEO of Franklin Templeton. \"The newly introduced platform we are building with Microsoft marks a pivotal moment in Franklin Templeton’s journey, empowering sales and marketing teams to deliver unparalleled service while simplifying information consumption for clients. We are excited to collaborate with Microsoft to bring this innovative solution to the marketplace.\"\n\"We’re pleased to see the successful co-innovation between Franklin Templeton and Microsoft come to life,\" said Bill Borden, Corporate Vice President, Worldwide Financial Services for Microsoft. \"Bringing together the financial services and technology expertise and shared vision of our teams, Franklin Templeton’s financial AI platform ushers in a new realm of capabilities for the industry, helping drive the personalization that today’s clients expect.\"\nFranklin Templeton has been on the leading edge of innovation across multiple areas ranging from digital assets and digital wealth to the firm’s proprietary Goals Optimization Engine (GOE) and Custom Indexing capability offered through Canvas.\nAbout Franklin Templeton\nFranklin Resources, Inc. [NYSE:BEN] is a global investment management organization with subsidiaries operating as Franklin Templeton and serving clients in over 150 countries. Franklin Templeton’s mission is to help clients achieve better outcomes through investment management expertise, wealth management and technology solutions. Through its specialist investment managers, the company offers specialization on a global scale, bringing extensive capabilities in fixed income, equity, alternatives and multi-asset solutions. With more than 1,500 investment professionals, and offices in major financial markets around the world, the California-based company has over 75 years of investment experience and over $1.6 trillion in assets under management as of March 31, 2024. For more information, please visit franklintempleton.com and follow us on LinkedIn, Twitter and Facebook.\nCopyright © 2024. Franklin Distributors, LLC. Member FINRA/SIPC. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240430285217/en/\nContacts\nFranklin Templeton Corporate Communications:Jeaneen Terrio, (212) 632-4005, jeaneen.terrio@franklintempleton.com\n"
    },
    {
        "Date": "2024-04-01T12:00:16.000Z",
        "Title": "Microsoft Corp: An Exploration into Its Intrinsic Value",
        "Author": "  GuruFocus Research ",
        "Text": "In this article, we will take a look into Microsoft Corp's (NASDAQ:MSFT) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 5 Warning Sign with MSFT.\nAs of 2024-04-01, Microsoft Corp's intrinsic value as calculated by the Discounted Earnings model is $292.58. It's currently trading at a price of $420.72. Therefore, the margin of safety based on the DCF model is -43.8%. The company is modestly overvalued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Microsoft Corp's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$11.07\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.21%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 17.50% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n153.46\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n139.12\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n292.58\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $175.45. This valuation indicates that the Microsoft Corp is significantly overvalued, accompanied by a margin of safety of -139.79%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    }
]