[
    {
        "Date": "2024-06-26T14:33:00.000Z",
        "Title": "Microsoft (MSFT) Faces Charges by EU for Bundling Teams, Office",
        "Author": "  Zacks Equity Research ",
        "Text": "Microsoft MSFT has been accused of breaching antitrust rules with the “abusive” bundling of its Teams and Office products by the European Union (EU) regulators.In a preliminary finding, EU officials stated that Microsoft has breached the bloc's competition rules by bundling Teams with its popular Office 365 and Microsoft 365 productivity suites for businesses.The potential consequences for Microsoft are significant, with the company facing a possible fine of up to 10% of its global annual revenues, a staggering amount of $211.9 billion in revenues reported for fiscal 2023.The investigation, initiated nearly a year ago, stems from a 2020 complaint by Slack, now owned by Salesforce CRM. Slack alleged that Microsoft's practice of automatically including Teams with its Office software suite gave the communication tool an unfair advantage, stifling competition in the market for remote communication and collaboration tools.The European Commission's preliminary findings suggest that Microsoft's practices may have restricted customer choice and hindered innovation. Specifically, the EU body is concerned that Microsoft has been forcing customers to acquire Teams by automatically bundling it with Office 365 and Microsoft 365 suites since at least April 2019. Furthermore, the Commission believes that interoperability limitations between Teams' competitors and Microsoft's offerings may have exacerbated the situation.In response to earlier concerns, Microsoft had already taken steps to unbundle Teams from its productivity suites in Europe and globally. (Read More: Microsoft Splits Teams and Office to Counter EU Scrutiny)However, the Commission deemed these changes insufficient, stating that \"more changes to Microsoft's conduct are necessary to restore competition.\" As the investigation proceeds, the outcome could have far-reaching implications for how software suites are packaged and sold in Europe, potentially affecting millions of users and reshaping the competitive landscape in the business productivity software market.\nMicrosoft Corporation price-consensus-chart | Microsoft Corporation Quote\nThis case highlights the EU's ongoing efforts to regulate major technology companies, with recent actions against Microsoft, Apple AAPL and Alphabet GOOGL-owned Google, highlighting the bloc's determination to ensure fair competition in the digital marketplace.Shares of Microsoft have gained 19% year to date compared with the Zacks Computer and Technology sector, Apple and Alphabet’s growth of 22.4%, 28.4% and 8.1%, respectively. These cases underscore the growing tension between the EU's regulatory ambitions and the business practices of dominant platform providers.Simultaneously, Apple finds itself grappling with multiple regulatory challenges in the EU. The company faces its first charges under the bloc's new Digital Markets Act (DMA), accused of preventing app developers from directing users to cheaper options outside the App Store. This action strikes at the heart of Apple's tightly controlled ecosystem and could have far-reaching implications for its business model.Google is also facing increased scrutiny from EU regulators. The company is under investigation for potentially non-compliant measures related to the DMA's provisions against self-preferencing. The European Commission has expressed concerns that Google's current practices may not treat third-party services fairly in search results, a core issue in the ongoing debate about the power of dominant search engines.Furthermore, the European Commission has launched a new investigation into Apple's support for alternative iOS marketplaces, including the company's controversial core technology fee for developers. In response to these regulatory pressures, AAPL has taken the drastic step of announcing the blockage of certain features, including Apple Intelligence, iPhone Mirroring and SharePlay Screen Sharing, for EU users, citing security concerns related to DMA compliance.For Microsoft, the outcome of this investigation could have far-reaching consequences. If found in violation of EU antitrust rules, the company not only faces potential financial penalties but may also be forced to make significant changes to its product strategy and distribution model in Europe.Looking ahead, this Zacks Rank #3 (Hold) company will need to carefully navigate its product development and marketing strategies to align with evolving regulatory expectations, not just in Europe but potentially worldwide. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nSalesforce Inc. (CRM) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-04T13:05:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Advanced Micro Devices, NVIDIA, Microsoft and Alphabet",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – June 4, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Advanced Micro Devices AMD, NVIDIA NVDA, Microsoft MSFT and Alphabet GOOGL.\nHere are highlights from Monday’s Analyst Blog:\nThe fight for AI supremacy between Advanced Micro Devices and NVIDIA is escalating, with both launching new chips at Computex 2024.\nAMD is playing catch-up to NVIDIA's dominance in the AI space, which has been riding on strong spending as the digital transformation (DX) of enterprises continues. Per IDC estimates, worldwide spending on DX is forecast to reach roughly $4 trillion in 2027, witnessing a CAGR of 16.2% between 2022 and 2027.\nGartner estimates spending on AI software to witness a CAGR of 19.1% between 2022 and 2027 to hit $297 billion in 2027. Generative AI (GenAI) software spending is expected to surge from 8% in 2023 to 35% by 2027. Deloitte expects enterprise spending on GenAI to increase 30% in 2024 from $16 billion in 2023.\nThis massive splurge by enterprises presents significant growth opportunities for both chipmakers.\nBoth AMD and NVIDIA are now focusing on the faster launch of AI-enabled chips to stay ahead of the competition.\nAt Computex 2024, AMD unveiled its Instinct accelerator roadmap that includes the new Instinct MI325X accelerator, which is planned to be available in fourth-quarter 2024. Instinct MI325X accelerator features 288GB of ultra-fast HBM3E memory that extends AMD's GenAI performance footprint.\nThe next-generation CDNA 4 architecture, expected in 2025, will power the AMD Instinct MI350 Series. It is expected to drive up to 35X better AI inference performance compared to the AMD Instinct MI300 Series with AMD CDNA 3. The CDNA \"Next\" architecture will power MI400 series accelerators planned for 2026.\nAMD unveiled the fifth generation of EPYC server processors (Turin) that leverage the Zen 5 core. It further expanded its portfolio with the launch of the Ryzen AI 300 Series, the third generation of AMD AI-enabled mobile processors, and Ryzen 9000 Series processors for laptop and desktop PCs.\nAt Computex, Microsoft, HP, Lenovo and Asus unveiled new PCs powered by third-gen AMD Ryzen AI 300 Series processors and AMD Ryzen 9000 Series desktop processors.\nNVIDIA recently expanded its portfolio with the announcement of the next-generation AI chip architecture, Rubin, which will leverage HBM4. This follows the March announcement of Blackwell, which is currently in production and is expected to ship to customers later this year.\nThe most valuable chip company now plans to release new AI chip models annually instead of its previous two-year update timeline. NVIDIA also announced a plethora of new tools and software models at Computex 2024.\nNVIDIA's yearly launch decision reflects the ongoing competitive frenzy in the AI chip market and its urgency to maintain its dominant position, which is not only threatened by AMD and Intel but also by initiatives taken by Microsoft, Alphabet and Meta Platforms.\nMicrosoft's Maia 100 is designed for AI purposes. The Maia 100 AI accelerator is capable of running cloud AI workloads like large language model training and inference. It is powered by a 5-nanometer TSMC process and has 105 billion transistors.\nAlphabet's Google has introduced the Axion central processing unit (CPU) to support its AI work in data centers. Axion processors are its first tailored Arm-based CPUs designed to deliver robust performance and energy efficiency. These CPUs deliver instances with up to 30% better performance than the fastest general-purpose Arm-based instances.\nMeta followed Google to introduce the next generation of the Meta Training and Inference Accelerator (MTIA), which is a family of customized chips designed for Meta's AI workloads. MTIA will support new generative AI products and services, recommendation systems, and advanced AI research. The accelerator comes with an 8x8 grid of processing elements, which deliver increased dense compute performance (3.5x over MTIA v1) and a sparse compute performance.\nNVIDIA has returned a whopping 121.4% year to date, outperforming AMD, Microsoft and Alphabet's growth of 13.2%, 10.4% and 23.5%, respectively.\nNVDA is enjoying dominance in the AI-space thanks to its next-generation chips with high computing power that have been the top choice for enterprises. However, AMD, with its latest products, seems well-equipped to challenge NVDA not only in the data center market but also in the growing AI-enabled consumer PC market over the long haul.\nNVIDIA currently sports a Zacks Rank #1 (Strong Buy) with a Growth Score of A, a combination that offers a good investment opportunity, per the Zacks proprietary methodology. A Momentum Score of B makes NVDA an attractive pick for investors. You can see the complete list of today's Zacks #1 Rank stocks here.\nHowever, investors should wait for a better entry point for AMD, which currently has a Zacks Rank #3 (Hold), given the modest growth prospect in the near term. Moreover, AMD is trading at a premium with a forward 12-month P/E of 40.11X compared with the Zacks Electronics - Semiconductors industry's 32.92X and NVIDIA's 38.12X, reflecting a stretched valuation.\nWhy Haven't You Looked at Zacks' Top Stocks? \nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com                        \nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": null,
        "Title": "Microsoft to initiate layoffs, Google reportedly to follow suit",
        "Author": " Madison Mills    · Host and Reporter",
        "Text": "The tech industry is undergoing a round of layoffs. Microsoft (MSFT) has confirmed it will be introducing a workforce reduction, and Alphabet's Google (GOOG, GOOGL) is reportedly looking to follow suit.\nYahoo Finance's Dan Howley explains the motive for the job cuts despite strong balance sheets.\nFor more expert insight and the latest market action, click here to watch this full episode of Catalysts.\nThis post was written by Angel Smith\n"
    },
    {
        "Date": "2024-06-18T21:07:57.000Z",
        "Title": "Nvidia eclipses Microsoft as world's most valuable company",
        "Author": "  Noel Randewich and Ankika Biswas ",
        "Text": "By Noel Randewich and Ankika Biswas\n(Reuters) - Nvidia became the world's most valuable company on Tuesday, dethroning tech heavyweight Microsoft as its high-end processors play a central role in a scramble to dominate artificial intelligence technology.\nShares of the chipmaker climbed 3.5% to $135.58, lifting its market capitalization to $3.335 trillion, just days after overtaking iPhone maker Apple to become the second most valuable company.\nMicrosoft's stock market value was $3.317 trillion as its shares dipped 0.45%.\nApple's stock slipped over 1%, leaving its value at $3.286 trillion.\nNvidia's stunning surge in market value over the past year has become emblematic of a Wall Street frenzy driven by optimism about emerging AI technology.\nWhile Nvidia's rally has lifted the S&P 500 and Nasdaq to record highs, some investors worry that unbridled optimism about AI could evaporate if signs emerge of a slowdown in spending on the technology.\n\"It's Nvidia's market; we're all just trading in it,\" said Steve Sosnick, chief market strategist at Interactive Brokers.\nNvidia has also become by far the most traded company on Wall Street, with daily turnover recently averaging $50 billion, compared to around $10 billion each for Apple, Microsoft and Tesla, according to LSEG data. The chipmaker now accounts for about 16% of all trading in S&P 500 companies.\nNvidia's stock has nearly tripled so far this year, compared with a rise of about 19% in Microsoft shares, with demand for its top-of-the-line processors outpacing supply.\nTech giants Microsoft, Meta Platforms and Google-owner Alphabet are competing to build out their AI computing capabilities and add the technology to their products and services.\nAn insatiable appetite for Nvidia's AI processors, viewed as far superior to competitors' offerings, has left them in tight supply, and many investors view Nvidia as the greatest winner to date from surging AI development.\n\"Nvidia has been getting a lot of positive attention and has been doing a lot of things very correctly, but a small misstep is likely to cause a major correction in the stock, and investors should be careful,\" said Oliver Pursche, senior vice president at Wealthspire Advisors in New York.\nTuesday's gain lifted Nvidia's stock to a record high and added over $110 billion to its market capitalization, equivalent to the entire value of Lockheed Martin .\nThe company's market value expanded from $1 trillion to $2 trillion in just nine months in February, while taking just over three months to hit $3 trillion in June.\nSince its blowout forecast about a year ago, the company has consistently breezed past Wall Street's lofty expectations for revenue and profit, with demand for its graphics processors far outstripping supply as companies rush to embed AI applications.\nNvidia executives said in May that demand for its Blackwell AI chips could exceed supply \"well into next year.\"\nSharp increases in analysts' expectations for Nvidia's future earnings have outpaced its stellar stock gains, resulting in a fall in the stock's earnings valuation.\nNvidia recently traded at 44 times expected earnings, down from over 84 about a year ago, LSEG data showed.\nIncreasing the appeal for its highly valued stock among individual investors, Nvidia last week split its stock 10-for-one.\n(Reporting by Shristi Achar, Medha Singh and Ankika Biswas in Bengaluru, and by Noel Randewich in San Francisco; Additional reporting by Suzanne McGee and Stephen Culp in New York; Editing by Anil D'Silva, Shounak Dasgupta and Lisa Shumaker)\n"
    },
    {
        "Date": "2024-06-23T09:36:00.000Z",
        "Title": "Nvidia and Microsoft Will Make Up Over 40% of This Popular ETF. Here's Why This Alternative ETF Could Be a Better Option.",
        "Author": "  Geoffrey Seiler, The Motley Fool ",
        "Text": "The three largest tech companies right now (as measured by market cap) are 1. Nvidia (NASDAQ: NVDA), 2. Microsoft (NASDAQ: MSFT), and 3. Apple (NASDAQ: AAPL), with each valued relatively close to the other, and all three valued over $3.25 trillion. Not surprisingly, these stocks are the top three holdings of the popular State Street Technology Select Sector SPDR Fund (NYSEMKT: XLK), which tracks the S&P Technology Select Sector index.\nThe holdings in the fund are rebalanced quarterly to account for changing valuations, and that has created a situation. In an unusual quirk, the top two holdings in this exchange-traded fund (ETF) (Microsoft and Apple) now account for the bulk of its portfolio, far outstripping its third-largest holding (Nvidia). The reason why is that the index has a rule that caps holdings with over 5% allocations so that the top two cannot exceed 50% of the index's combined portfolio. There is another rule in effect saying that once the 50% allocation is breached, no other stock in the portfolio (including No. 3) can exceed 4.5% of the index. It sounds complicated because these investing rules often are. Suffice it to say the rules exist for some useful reason, but they are creating an unforeseen situation because of some unusually strong stock performance by these three stocks.\nThese rules have resulted in Microsoft and Apple each representing over 20% of the index at the moment, while the No. 3 holding (Nvidia) represents less than 6%. However, Nvidia's market cap exceeded Apple's on the day chosen to determine the index's next quarterly rebalancing, So the chipmaker will jump up to represent over 20% of the index when the rebalancing happens while Apple's weighting is expected to drop to around 4.5%.\nThis will cause the $71 billion ETF to buy a lot of Nvidia shares (at elevated prices) while subsequently dumping a bunch of Apple shares (also at elevated prices). That's not necessarily a smart investing move to make right now, but rules are rules.\nAn ETF dominated by Microsoft and Nvidia, two of the companies most benefiting from artificial intelligence (AI), doesn't seem like a bad idea on the surface.\nNvidia has been the biggest AI winner thus far with its graphic processing units (GPUs) being the choice for the infrastructure needed for AI model training and inference. The company isn't the only producer of GPUs, but programmers have long been trained on Nvidia's Cuda software platform, which has led it to become the de facto GPU leader in the space, with a wide moat. As a result, its first-quarter revenue surged 262% to $26 billion.\nMicrosoft, meanwhile, has been an early adopter of AI through its large investment and partnership with OpenAI. The company's Azure cloud computing business has been the biggest beneficiary so far, as customers build their own AI solutions using its Azure platform. Microsoft has also benefited from AI in other areas, including the adoption of its AI assistant Copilot. Its developer platform GitHub grew revenue by 45% year over year last quarter with more companies embracing its GitHub Copilot. And Microsoft 365 saw revenue jump 14% helped by the early success of Copilot in that platform.\nAs Nvidia and Microsoft stocks perform, so will the ETF given the large weighting in these names.\nHowever, the dramatic weighting shift between Nvidia and Apple shows the risk associated with the ETF. It also missed out on some of Nvidia's earlier gains because of its allocation rules. Meanwhile, one poor quarterly showing from Nvidia could dramatically knock down its weighting. It seems these rules intended to benefit shareholders might actually be hurting them.\nGiven these issues, I think there is a better alternative for investors who like the idea of an ETF with very large positions in Nvidia and Microsoft. It could be a better choice in the long run than the State Street Technology Select Sector SPDR Fund ETF.\nOne great option for investors is the Vanguard Information Technology ETF (NYSEMKT: VGT). Like the Technology Select Sector SPDR Fund ETF, it has large positions in Nvidia and Microsoft. But its top three positions are more balanced.\nAt the end of May, Microsoft was its largest position at 16.7%, followed by Apple at 15.9%, and Nvidia at 14%. Given Nvidia's strong June performance so far, it could very well be its top position currently.\nOther holdings have much smaller weightings, including Broadcom at 4.2%, Advanced Micro Devices at 1.9%, and Qualcomm at 1.6%.\nThe Vanguard ETF has been a strong performer, averaging a 20.3% annual return over the past decade. It has a comparable average return to the State Street fund. And because the Vanguard ETF does not have the same rebalancing quirk, I think it is the better option for investors looking for some nice tech exposure with heavy weightings toward AI leaders Nvidia and Microsoft without certain buying and selling rules that force some questionable stock transactions.\nBefore you buy stock in Select Sector SPDR Trust - The Technology Select Sector SPDR Fund, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Select Sector SPDR Trust - The Technology Select Sector SPDR Fund wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $775,568!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 10, 2024\nGeoffrey Seiler has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, Nvidia, and Qualcomm. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nNvidia and Microsoft Will Make Up Over 40% of This Popular ETF. Here's Why This Alternative ETF Could Be a Better Option. was originally published by The Motley Fool\n"
    }
]