[
    {
        "Date": "2024-07-31T09:06:32.000Z",
        "Title": "Microsoft stock drops after results fall short in latest AI disappointment",
        "Author": " Daniel Howley    · Technology Editor",
        "Text": "Microsoft (MSFT) released its fiscal fourth quarter earnings after the bell on Tuesday, beating on the top and bottom lines, but missing on cloud revenue expectations.\nFor the quarter, Microsoft reported earnings per share (EPS) of $2.95 on revenue of $64.7 billion. Wall Street was anticipating EPS of $2.94 on revenue of $64.5 billion, according to data compiled by Bloomberg. Microsoft reported EPS of $2.69 and revenue of $56.2 billion during the same period last year.\nMicrosoft's overall cloud revenue came in at $36.8 billion, in line with expectations of $36.8 billion, but the company's Intelligent Cloud revenue, which includes its Azure services, fell short, coming in at $28.5 billion versus expectations of $28.7 billion.\nShares of Microsoft were about 2% lower in pre-market trading on Wednesday, having fallen over 7% earlier in the wake of the results.\nWhile Microsoft's cloud business missed expectations, overall revenue still rose 21% year over year. Intelligent Cloud revenue, meanwhile, increased 19% year over year. What's more, Microsoft said AI services contributed 8 percentage points of growth to its Azure and other cloud services revenue, which increased by 29%.\nMicrosoft's AI miss sent shares of fellow AI-heavy companies like Meta lower in after-hours trading. The social media giant was off more than 3% on the news.\nThe report follows rival and Google parent Alphabet’s (GOOG, GOOGL) earnings announcement last week, during which the company said it is seeing an uptick in cloud revenue partially due to interest in AI products.\nStill, Google didn’t offer specific numbers on the impact of AI on the cloud business, leaving some analysts like UBS’s Stephen Ju to predict that revenue benefits from the company’s AI spending might not come until the first half of 2025 at the earliest.\nAccording to UBS analyst Karl Keirstead, Microsoft has also been grabbing more market share from Google and Amazon.\n“In terms of share shifts among AWS, Microsoft Azure, and Google Cloud, the most consistent theme in this round of checks was the number of customers and partners that cited share gains by Microsoft resulting from its early lead on the AI front,” Keirstead wrote in a recent note about the three major cloud players.\n“This has been a recurring theme from checks over the last 6-12 months and the commentary about Azure’s relative strength felt consistent with prior checks,” he added.\nDuring Alphabet’s earnings call, CFO Ruth Porat said the company spent $13 billion on capital expenditures, up from $12 billion in the prior quarter, adding that the vast majority of that spending is going toward AI.\nAmazon (AMZN) is set to report earnings on Aug. 1.\nShares of Google are up 22% year to date, while shares of Amazon are up 23%.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-07-10T17:05:11.000Z",
        "Title": "Microsoft in $22 million deal to settle cloud complaint, ward off regulators",
        "Author": "  Foo Yun Chee ",
        "Text": "By Foo Yun Chee\nBRUSSELS (Reuters) -Microsoft has clinched a 20-million-euro ($21.7 million) deal to settle an antitrust complaint about its cloud computing licensing practices, averting an EU antitrust investigation and potential hefty fine.\nCloud services organisation CISPE, whose members include Amazon and a score of small EU cloud providers, complained to the European Commission in late 2022 alleging that contractual terms imposed by Microsoft on Oct. 1 were harming Europe's cloud computing ecosystem.\nMicrosoft ranks behind market leader Amazon in the multibillion-dollar cloud computing sector but ahead of Alphabet's Google. The industry has drawn antitrust scrutiny on both sides of the Atlantic.\n\"After working with CISPE and its European members for more than a year, I am pleased that we've not only resolved their concerns of the past, but also worked together to define a path forward that brings even more competition to the cloud computing market in Europe and beyond,\" Microsoft President Brad Smith said.\nMicrosoft will develop a product allowing CISPE's members to run Microsoft software on their platforms on the U.S. tech giant's Azure cloud infrastructure with prices equivalent to Microsoft's prices, CISPE said. It has nine months to deliver.\nMicrosoft will also compensate CISPE members for lost revenues related to their licensing costs over the last two years, the group said. It did not disclose financial figures.\nMicrosoft has offered about 20 million euros in total, two people with direct knowledge of the matter told Reuters.\nThe settlement does not include Amazon Web Services (AWS), Google Cloud Platform and AliCloud, prompting criticism from the first two companies.\n\"We continue to stand with the growing number of customers, providers, and regulators globally who are calling on Microsoft to end its discriminatory practices for all customers,\" an AWS spokesperson said.\nThe head of Google Cloud said he hoped regulators elsewhere would continue to look into Microsoft's licensing practices\n\"Many regulatory bodies have opened inquiries into Microsoft's licensing practices, and we are hopeful there will be remedies to protect the cloud market from Microsoft's anti-competitive behavior,\" Amit Zavery said.\n\"We are exploring our options to continue to fight against Microsoft’s anti-competitive licensing in order to promote choice, innovation, and the growth of the digital economy in Europe.\"\nCISPE said it would now withdraw its EU complaint and would not start or support complaints on these issues in Europe and elsewhere.\n\"This agreement will provide a level playing field for European cloud infrastructure service providers and their customers,\" CISPE Secretary General Francisco Mingorance said.\n($1 = 0.9240 euros)\n(Reporting by Foo Yun Chee; Editing by Christina Fincher and Mark Potter)\n"
    },
    {
        "Date": null,
        "Title": "AI stocks like Nvidia and Microsoft are nowhere near a bubble",
        "Author": " Brian Sozzi    · Executive Editor",
        "Text": "Two things in markets have held true in 2024. One, the stock market opens and closes at the same time each day. And two, investors — large and small — love the AI trade. What’s not to like about companies at the leading edge of this exciting technology? Companies such as Nvidia (NVDA) are unable to keep pace with demand for their products, driving higher prices and profits. Even a legacy player like Intel (INTC) is getting in big to all things AI. The stock prices of AI-centric names have remained virtually bulletproof as investors await the next big upward lift to guidance. But really, how long can this all last — especially in front of a pivotal presidential election?\nOn this episode of Opening Bid, Yahoo Finance Executive Editor Brian Sozzi goes on the search for the next hot tech stock trade with EMJ Capital founder Eric Jackson. Is Nvidia the best place to stay in terms of AI? Or should investors warm back up to Apple (AAPL) ahead of the debut of its Apple Intelligence suite? Jackson and Sozzi discuss these top Wall Street tech trades and many others in this high-octane episode.\n"
    },
    {
        "Date": "2024-07-22T10:16:03.000Z",
        "Title": "Global healthcare systems face disruptions caused by Microsoft outage",
        "Author": "  GlobalData ",
        "Text": "A flawed software update from CrowdStrike Holdings has led to a Microsoft global outage, causing significant disruptions in health systems across the globe.\nHospitals have been forced to cancel medical appointments that are not urgent and delay procedures, highlighting the critical reliance on digital infrastructure in healthcare.\nThe cyber incident, which originated from a defective CrowdStrike software update, incapacitated Microsoft systems globally.\nThis disruption had a domino effect, affecting airports, financial networks, and healthcare facilities.\nA Bloomberg report highlighted that Epic Systems, known for its electronic health record system, reported that while its software was not directly impacted, the outage caused technical difficulties that prevented healthcare providers from accessing the systems.\nIn Paris, Saint-Joseph hospital had to resort to manual patient check-ins as the self-service kiosks were rendered inoperative, the report added.\nMeanwhile, the NHS in the UK also turned to manual processes to maintain operations.\nIn a media statement, an NHS spokesperson said: “The NHS is aware of a global IT outage and an issue with EMIS, an appointment and patient record system, which is causing disruption in the majority of GP practices.\n“The NHS has long-standing measures in place to manage disruption, including using paper patient records and handwritten prescriptions, and usual phone systems to contact your GP. There is currently no known impact on 999 so people should use these services as they usually would in emergency situations.”\nIn the US, Kaiser Permanente, with its network of hospitals and medical offices, activated its national command centre to manage widespread effects, The New York Times reported citing spokesperson Steve Shivinsky.\nBanner Health, operating in six states, closed several outpatient facilities, although hospitals remained open for inpatient care.\nProvidence Health, with 52 hospitals and 1,000 clinics, also experienced significant disruptions.\nWhile patient records were still accessible via mobile devices, critical applications, including those used in surgeries, were down, leading to numerous cancellations, stated Providence chief information officer BJ Moore.\nThe system's 15,000 servers were offline, and approximately 40,000 out of 150,000 computers experienced failures.\nMore than 1,000 personnel, including some in India, are working to resolve the outage at Providence Health, with full restoration expected to take weeks, Moore estimated.\n\"Global healthcare systems face disruptions caused by Microsoft outage\" was originally created and published by Hospital Management, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    },
    {
        "Date": "2024-07-09T19:03:26.000Z",
        "Title": "How Much Microsoft Stock Does Bill Gates Own?",
        "Author": "  Scott Levine, The Motley Fool ",
        "Text": "Helping to found Microsoft (NASDAQ: MSFT) nearly 50 years ago, Bill Gates is widely recognized as one of the wealthiest individuals in the world. Forbes, for example, estimates Gates's net worth at about $135 billion. He's also one of the most philanthropic. Valued at $46 billion at the end of the first quarter of 2024, the Bill & Melinda Gates Foundation performs charitable work in more than 130 countries -- from assisting with agricultural development to improving financial resources for low-income communities.\nBut how much exactly does Microsoft represent in the Bill & Melinda Gates Foundation Trust's portfolio? Let's take a look.\nWhile some smaller companies represent nominal positions in the Bill & Melinda Gates Foundation Trust, most of the holdings are well-recognized names. Trash pickup and disposal specialist Waste Management, Berkshire Hathaway, and Canadian National Railway each account for about 16% of the trust's portfolio as of the end of Q1 2024. And then there's Microsoft, which holds a commanding position among tech stocks with a market capitalization of $3.4 trillion, dwarfing its closest peer, Oracle, which has a market cap of $398 billion.\nOf the 24 holdings in the Bill & Melinda Gates Foundation Trust's portfolio, Microsoft is the largest holding, making up about 34% of the portfolio and valued at about $15.4 billion. It's not only the sizable standing, however, that's worth noting. The 36,499,597 shares also generate a considerable amount of dividend income -- more than $27 million in Q2 2024.\nAlthough Microsoft provides the Bill & Melinda Gates Foundation Trust with a prodigious amount of passive income, it's unlikely that the forward-yielding dividend of 0.64% is going to excite most income investors. Those looking for artificial intelligence (AI) exposure, however, should consider Microsoft as its generative AI chatbot Copilot grows in popularity. On Microsoft's recent Q3 2024 conference call, management noted that \"Thirty thousand organizations across every industry have used Copilot studio to customize Copilot for Microsoft 365 or build their own, up 175% quarter over quarter.\"\nBefore you buy stock in Microsoft, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Microsoft wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $785,556!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nScott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway, Microsoft, and Oracle. The Motley Fool recommends Canadian National Railway and Waste Management and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nHow Much Microsoft Stock Does Bill Gates Own? was originally published by The Motley Fool\n"
    }
]