[
    {
        "Date": "2024-08-15T23:30:04.000Z",
        "Title": "Is Microsoft Corp (NASDAQ:MSFT) the Best Stock to Buy According to Cathie Wood?",
        "Author": "  Fahad Saleem ",
        "Text": "We recently published a list of Cathie Wood’s 11 Favorite AI Stocks. Since Microsoft Corp (NASDAQ:MSFT) ranks 11th on the list, it deserves a deeper look.\nCathie Wood’s flagship fund is continuing to face steep losses amid a broader pullback in technology stocks. Wood’s flagship fund ARK Innovation ETF (NYSEARCA:ARKK) is down about 18% so far this year and has lost about 75% of its value since hitting its peak in 2021. However, the latest data shows that the innovation-focused investor bought the dip on tech stocks after the latest selloff that shook financial markets globally.\nInvestors have pulled about $2.2 billion from ARK funds in 2024. The fund is on track to post its worst year of investor exodus since 2014. But Cathie Wood is doubling down on her innovation bets and is hopeful the upcoming rate cuts will be positive for the stock market.\nCathie Wood Says “Something Is Changing” and the Fed is Now on “High Alert”\nTalking about the market situation, Cathie Wood said in a latest video on her YouTube channel that the recent selloff shows the market is going through a “cathartic” phase and “something is changing.”\n“I do believe that the Fed now is on high alert because the stock market seemed to be encouraging the Fed to hold tight, higher for longer, make sure that the inflation was out of the system.”\nCathie Wood said that corporations are now in a weaker position amid high rates and they will initiate layoffs to cut costs and increase productivity. This weak employment situation could encourage the Federal Reserve to start cutting rates, according to Wood.\n“Interest rates coming down should be very positive for the equity markets, but they will not arrest a recession very quickly. In fact, if consumers and businesses know that interest rates and maybe prices will be coming down, what will they do? They will wait.”\nCathie Wood’s ARK has posted its latest stock holdings data as of the end of the June quarter. For this article we scanned the fund’s latest portfolio and picked 11 AI stocks it has positions in. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nCathie Wood’s Latest Stake Value: $15,279,433\nMicrosoft Corp (NASDAQ:MSFT) shares recently fell following its latest quarterly results which showed the company’s Cloud business growth was lower than expected. For the ongoing quarter, Microsoft Corp (NASDAQ:MSFT) expects revenue in the range of $63.8B and $64.8B, compared to the $65.07B estimate. Microsoft Corp (NASDAQ:MSFT) Azure revenue is expected to grow by 28% and 29% year over year.\nBut what about AI? While Microsoft does not mention specific AI numbers, analysts believe Copilot is already playing a key role in growth at several segments of the company. Microsoft Corp (NASDAQ:MSFT) Office’s commercial customer sales soared to $48 billion, significantly up from last year’s 10% growth, likely driven by Copilot Pro subscriptions. Office for individual users also saw a boost, with sales reaching $6.2 billion, a 4% increase compared to last year’s 2% growth, indicating accelerating growth from Copilot integration. Dynamics ERP and CRM software sales hit $6.3 billion, up 19%, surpassing last year’s 16% growth. This uptick is likely due to customers switching to Dynamics for the Copilot integration in the Dynamics Contact Center platform, which provides automated customer service chatbots and significant cost reductions. Bing sales jumped 3% year over year as more users switched to the search engine from Google Search, thanks to AI features.\nWhile Microsoft Corp (NASDAQ:MSFT) expenses are expected to remain elevated, its investments are working and would bear fruit in the long term. The stock is down about 11% over the past month. It trades 26x next fiscal year’s earnings. MSFT could be an attractive buy on the dip for long-term investors.\nPolen Focus Growth Strategy stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its Q2 2024 investor letter:\n“The top absolute contributors were Alphabet, Microsoft Corporation (NASDAQ:MSFT), and Amazon. Microsoft was another top absolute contributor in the quarter, speaking to a growing appreciation for all the ways the company has an opportunity to monetize GenAI, be it in its Office suite or Azure cloud business. In the latter case, it contributed 7% to Azure’s revenue growth in the most recent quarter. We believe Microsoft remains a highly advantaged business with many secular tailwinds driving durable growth for the foreseeable future, even at its immense scale.”\nOverall, Microsoft Corp (NASDAQ:MSFT) ranks 11th on Insider Monkey’s list titled Cathie Wood’s 11 Favorite AI Stocks. While we acknowledge the potential of Microsoft Corp (NASDAQ:MSFT), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than MSFT but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-08-05T09:30:00.000Z",
        "Title": "Should Investors Buy Microsoft Stock on the Dip After Azure Revenue Disappoints?",
        "Author": "  Geoffrey Seiler, The Motley Fool ",
        "Text": "Microsoft (NASDAQ: MSFT) has been helping lead the charge in artificial intelligence (AI), so when fiscal fourth-quarter revenue for its Azure cloud computing business came up short of analyst expectations, investors were a bit disappointed. After a strong run through early July, the stock dropped a bit and is now up only about 10% on the year.\nLet's take a closer look a Microsoft's latest results and whether the stock is a buy after the 10% pullback from its recent July highs.\nFor its fiscal fourth quarter, Microsoft reported a 15% year-over-year increase in revenue to $64.7 billion while its earnings per share (EPS) rose 10% to $2.95. That came in just ahead of analyst expectations for revenue of $64.5 billion and EPS of $2.94.\nAzure once again helped lead the way with year-over-year revenue growth of 29% (30% in constant currency). However, that was at the low end of the 30% to 31% constant currency revenue growth that Microsoft forecast earlier. Overall Intelligent Cloud revenue, the segment where Azure resides, rose 19% to $28.5 billion.\nAzure AI customers grew by 60% in the quarter, while its subscription and usage rates have seen a significant increase. It also introduced new AI accelerators and models.\nMicrosoft said capacity constraints impacted Azure's growth and that these constraints will likely last into the first half of fiscal year 2025. In response, it has partnered with companies like Oracle and Cohere to expand Azure AI's capacity. Microsoft will make infrastructure investments to meet demand, while also focusing on managing expenses to take a disciplined approach to growth.\nThe Productivity and Business Processes segment, home to Office and LinkedIn, saw its revenue increase 11% year over year to $20.3 billion. Dynamics 365 revenue led the way with 19% growth, while Office 365 Commercial revenue rose 13%. Revenue for More Personal Computing, home to Windows and Xbox, climbed 14% to $15.9 billion. The increase was powered by Microsoft's recent acquisition of video game maker Activision.\nLooking ahead, Microsoft forecasts double-digit revenue and operating income growth for fiscal year 2025. It also expects capital expenditures (capex) to be higher than in fiscal year 2024.\nFor the first quarter, Microsoft expects revenue to be between $63.8 billion and $64.8 billion. The company is looking for its Intelligent Cloud segment to grow between 18% and 20% to $28.6 billion and $28.9 billion, with Azure growth of between 28% and 29% in constant currency. The Productivity and Business Processes segment is expected to grow between 10% and 11% in constant currency, while More Personal Computing is forecast to grow between 9% and 12% in constant currency.\nThe slightly lower-than-expected revenue growth from Azure appears to be largely related to capacity constraints and some non-AI business in Europe as opposed to any AI demand issues. Ultimately, the Azure business is strong and still leading the way for the company.\nNow Microsoft will have to invest in infrastructure to continue to build out the business, which is something investors have become a bit more sensitive about recently. However, this is something that all companies in the cloud computing space need to do in order to keep up with demand, and I think it would be worse if these companies weren't planning to increase capex to take advantage of the AI opportunities in front of them.\nAzure has been taking market share in the cloud computing space, so the company should get a good return on its capex investment. Meanwhile, Microsoft continues to see solid low-double-digit growth in its other two business segments, helped by Copilot and other AI features it has introduced.\nFrom a valuation standpoint, the stock now trades at a forward price-to-earnings (P/E) ratio of under 32 with a price/earnings-to-growth (PEG) of under 0.9. While that doesn't put the stock in the bargain bin, it is still an attractive valuation considering its AI opportunities.\nGiven the growth opportunities still ahead of Microsoft, especially with Azure, I would be a buyer of the stock on this dip. However, I would consider taking a starter position and then dollar-cost averaging on any further price dips.\nThis can be a good investment strategy when buying a stock that has been seeing some near-term selling pressure. Over the long term, though, Microsoft still appears poised to be an AI winner.\nBefore you buy stock in Microsoft, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Microsoft wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $657,306!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 29, 2024\nGeoffrey Seiler has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft and Oracle. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nShould Investors Buy Microsoft Stock on the Dip After Azure Revenue Disappoints? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-08-12T08:55:25.000Z",
        "Title": "Asos, Microsoft announce three-year collaboration on AI tool",
        "Author": "  Rachel Lawler ",
        "Text": "Under the new deal Asos will use Microsoft’s generative AI tools to remove ‘busy work’ and free up time for creativity.\nAsos’ director of technology Victoria Arden explained: “A core part of our business strategy is driving operational excellence within ASOS: making sure we’re as fast, efficient, and effective as we can be, and investing our time and resources in the projects that matter.”\nThe two companies have been working together for several years, with Asos making use of Microsoft’s AI capabilities to support its digital platforms and decision-making.\nAsos has been using Microsoft’s Azure software and its AI capabilities to support its data-driven decision-making, speed and efficiency since 2022.\nOlaf Akkerman, general manager, retail and consumer goods industry at Microsoft UK said: \"It's fantastic to further extend our relationship with Asos after many years of collaboration. Asos has been an early adopter of AI and is using it in many innovative ways, such as delivering personalised shopping experiences through AI fashion stylists.\n“This renewed commitment will bring huge productivity gains, freeing up time so that Asos employees can focus on new, data-driven ways to better serve customers.\"\nEarlier this year, Asos launched customer testing for its AI Stylist – an OpenAI-powered experience helping customers discover new outfits. The software was built using early access to Microsoft’s generative AI tools to reflect Asos’ brand and tone of voice.\nPapinder Dosanjh, director of AI and machine learning at Asos added: “AI and machine learning are already transforming how we work at Asos, whether it’s supporting better demand forecasting, helping with data-driven decision-making, or powering our recommendation system – delivering billions of product recommendations to our customers per day.”\nLast month (July) the Laboratory for AI in Design at the Hong Kong Polytechnic University announced it had created AI-based Textile Material Inspection Technology that should be ready for the fashion industry to use within the next four years.\n\"Asos, Microsoft announce three-year collaboration on AI tool\" was originally created and published by Just Style, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    },
    {
        "Date": "2024-08-07T13:00:00.000Z",
        "Title": "Varonis Announces Integrations with SentinelOne and Microsoft Defender for Endpoint",
        "Author": "  Varonis Systems, Inc. ",
        "Text": "Integrating the Varonis platform with leading EDRs enables end-to-end threat detection and response\nNEW YORK and LAS VEGAS, Aug. 07, 2024 (GLOBE NEWSWIRE) -- Black Hat USA 2024 Booth #1250 – Varonis Systems, Inc. (Nasdaq: VRNS), a leader in data security, today announced new integrations with SentinelOne and Microsoft Defender for Endpoint. Now, Varonis' Managed Data Detection and Response (MDDR) analysts can stop attacks faster and conduct more conclusive investigations.\nBy integrating with leading EDR providers, Varonis expands its visibility to customers' endpoints. The new integrations provide customers with:\nEarlier threat detection: MDDR analysts use EDR alerts to identify and stop threats earlier in the kill chain.\nSwifter and more conclusive investigations: Varonis consolidates telemetry from multiple detection surfaces — data, cloud, identity, network, and endpoint — into a single view for fast and conclusive forensics.\nMaximized EDR tool investment: By correlating EDR alerts with Varonis' unique data-centric alerts, MDDR analysts spot threats that would go unnoticed in isolation.\n\"Threat actors take advantage of visibility and coverage gaps to evade detection and steal data,\" said Brian Vecci, Varonis Field CTO. \"By including telemetry from leading EDRs — starting with SentinelOne and Microsoft Defender for Endpoint — Varonis can see and stop threats to data sooner, significantly increasing the value of our MDDR offering.\"\nThe EDR integrations are available now. Contact Varonis to learn more about MDDR, Varonis' managed service for monitoring and protecting critical data 24x7x365.\nAdditional Resources\nLearn more on the Varonis blog.\nRead more about Varonis MDDR.\nSee Varonis in action: schedule a 30-minute demo.\nCheck out these Varonis integrations.\nFor more information on Varonis' solution portfolio, please visit www.varonis.com.\nVisit our blog and join the conversation on X (Twitter), LinkedIn, and YouTube.\nAbout VaronisVaronis (Nasdaq: VRNS) is a leader in data security, fighting a different battle than conventional cybersecurity companies. Our cloud-native Data Security Platform continuously discovers and classifies critical data, removes exposures, and detects advanced threats with AI-powered automation.\nThousands of organizations worldwide trust Varonis to defend their data wherever it lives — across SaaS, IaaS, and hybrid cloud environments. Customers use Varonis to automate a wide range of security outcomes, including data security posture management (DSPM), data classification, data access governance (DAG), data detection and response (DDR), data loss prevention (DLP), and insider risk management.\nVaronis protects data first, not last. Learn more at www.varonis.com.\nInvestor Relations Contact:Tim PerzVaronis Systems, Inc.646-640-2112investors@varonis.com\nNews Media Contact:Rachel HuntVaronis Systems, Inc.877-292-8767 (ext. 1598)pr@varonis.com\n\n"
    },
    {
        "Date": "2024-08-27T06:40:24.000Z",
        "Title": "Reasons for the Performance of Microsoft Corporation (MSFT) in Q2",
        "Author": "  Soumya Eswaran ",
        "Text": "Mar Vista Investment Partners, LLC, an investment management company, released the “Mar Vista Focus strategy” second quarter 2024 investor letter. A copy of the letter can be downloaded here. In the second quarter, the strategy returned +3.74% net of fees compared to +8.34% and +4.28% returns for The Russell 1000 Growth Index and the S&P 500 Index. The strategy's performance was negatively impacted by the stock selection within the information technology, communication services, and consumer discretionary. Following a robust performance in the first six months, it appears that stocks are poised to enter the second half of the year with strong momentum. The picture is still favorable because of robust corporate profitability, decreasing inflation, and high enterprise spending. Kindly check the top 5 stocks of the strategy to know its best picks in 2024.\nMar Vista Focus strategy highlighted stocks like Microsoft Corporation (NASDAQ:MSFT), in the second quarter 2024 investor letter. Microsoft Corporation (NASDAQ:MSFT) is a multinational software company that develops and supports software, services, devices, and solutions. The one-month return of Microsoft Corporation (NASDAQ:MSFT) was -2.23%, and its shares gained 25.91% of their value over the last three months. On August 26, 2024, Microsoft Corporation (NASDAQ:MSFT) stock closed at $413.49 per share with a market capitalization of $3.073 trillion.\nMar Vista Focus strategy stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its Q2 2024 investor letter:\n\"Microsoft Corporation (NASDAQ:MSFT) continues to occupy a strong position, poised to capture market share as businesses, both large and small, navigate the transition to a digital-first landscape and embrace generative AI-driven solutions. The company’s commanding presence in the enterprise arena, combined with its comprehensive product portfolio encompassing Infrastructure-as-a-Service (IaaS), Platform-as-a-Service (PaaS), and Software-as-a-Service (SaaS), establishes it as a crucial provider of IT solutions for companies of all scales. Microsoft is effectively executing its strategy in a sizable market by offering a roadmap for digital transformation and adoption of innovative, AI-driven solutions, such as ChatGPT, while enhancing productivity and reducing costs. Consequently, we anticipate that Microsoft's solutions should exhibit resilience even in a more challenging macroeconomic environment, supporting low-double-digit growth in intrinsic value within our investment horizon.\"\nImage by Tawanda Razika from Pixabay\nMicrosoft Corporation (NASDAQ:MSFT) is in second position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 279 hedge fund portfolios held Microsoft Corporation (NASDAQ:MSFT) at the end of the second quarter which was 293 in the previous quarter. In the quarter, Microsoft Corporation's (NASDAQ:MSFT) revenue was $64.7 billion, up 15% in reported currency and 16% in constant currency and earnings per share was $2.95, representing a 10% increase in reported currency and an 11% increase in constant currency. While we acknowledge the potential of Microsoft Corporation (NASDAQ:MSFT) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Microsoft Corporation (NASDAQ:MSFT) and shared the list of best beginner stocks to buy. In Q2 2024, Microsoft Corporation (NASDAQ:MSFT) was listed as one of the top contributors to Baron Opportunity Fund. In addition, please check out our hedge fund investor letters Q2 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    }
]