[
    {
        "Date": "2024-09-10T13:00:00.000Z",
        "Title": "Apex Systems Now Available in the Microsoft Azure Marketplace with Consulting Services Offering",
        "Author": "Business Wire ",
        "Text": "Microsoft Azure customers worldwide now gain access to Apex Systems’ Consulting Services Offering to take advantage of the scalability, reliability, and agility of Azure to drive application development and shape business strategies\nRICHMOND, Va., September 10, 2024--(BUSINESS WIRE)--Apex Systems, a leading global technology services firm, and ASGN brand (NYSE: ASGN), today announced its availability in the Microsoft Azure Marketplace, an online store providing applications and services for use on Azure. Apex customers can now take advantage of the productive and trusted Azure cloud platform, with streamlined deployment and management.\nApex’s debut offering in the Marketplace was created specifically for developers and other IT professionals and offers the Company a unique opportunity to accelerate growth, increase brand awareness, and build new client relationships across the commercial consulting marketplace.\nAlthough technology-agnostic, many of Apex’s growing consulting client base use Microsoft solutions to simplify and streamline their enterprise workloads. One of these solutions is Microsoft Fabric, an AI-powered analytics platform that Apex has been testing in its Innovation Lab across a diverse team of cloud, data, and AI professionals for the past twelve months.\nUpon completion of this testing, Apex is excited to officially offer a workshop on Microsoft Fabric in the Azure Marketplace. This workshop is led by the Company’s Chief Solutions Director of Data and AI, Zac Guidone, along with practice architects. As a certified Microsoft Data and AI Solutions Partner, Apex is proud to offer this workshop to explore Fabric’s capabilities, value, and architecture.\n\"Microsoft Fabric is the next step forward in enabling business-driven and domain-owned enterprise data analytics capabilities,\" Guidone explained. \"By offering our services in the Microsoft Azure Marketplace, we are making it easier for current and prospective clients to access our solutions and integrate them into their existing Azure environments.\"\nApex’s Innovation Lab assessed multiple platforms using commonly requested data science proof-of-concept use cases – including image recognition and forecasting. The solutions were compared using 30 different feature categories, encompassing more than 100 functions that support enterprise data and AI workloads from data management and enterprise analytics to data science, machine learning, and platform monitoring and operations. The results displayed that not only is Fabric an ideal AI-analytics platform for its client base, but that there are many other interesting offerings available today that can serve as content for future online workshops.\nJeff Schmalbach, Chief Consulting Officer of Apex Systems, expressed his excitement about the Company’s debut in the Marketplace. \"As we continue to grow our commercial IT consulting practice, our entrance into the Microsoft Azure Marketplace signals steps in providing clients with innovative data, AI, and cloud solutions. Apex Systems partners with leading technology companies across the globe, who trust and rely upon our solutions expertise to accelerate digital transformation. This current listing is just the beginning, and we look forward to introducing additional Azure Marketplace offerings, including PowerApps, Data Security, and more, in the near future.\"\nJake Zborowski, General Manager, Microsoft Azure Platform at Microsoft Corp. said, \"We’re pleased to welcome Apex Systems to the Microsoft Azure Marketplace, which gives our partners great exposure to cloud customers around the globe. Azure Marketplace offers world-class quality experiences from global trusted partners with solutions tested to work seamlessly with Azure.\"\nThe Azure Marketplace is an online market for buying and selling cloud solutions certified to run on Azure. The Azure Marketplace helps connect companies seeking innovative, cloud-based solutions with partners who have developed solutions that are ready to use.\nAbout Apex Systems\nApex Systems is a leading global technology services firm that incorporates industry insights and experience to deliver solutions that fulfill our clients’ digital visions. We provide a continuum of services, including strategy and enablement, innovation and productivity, and technology foundations to drive better results and bring more value to our clients. Apex transforms our customers with modern enterprise solutions tailored to the industries we serve. Apex has a presence in over 70 markets across North America, Europe, and India. Apex is a part of the Commercial Segment of ASGN Incorporated (NYSE: ASGN). To learn more, visit apexsystems.com.\nAbout ASGN Incorporated\nASGN Incorporated (NYSE: ASGN) is a leading provider of IT services and solutions across the commercial and government sectors. ASGN helps corporate enterprises and government organizations develop, implement, and operate critical IT and business solutions through its integrated offerings. For more information, please visit asgn.com.\nSafe Harbor\nCertain statements made in this news release are \"forward-looking statements\" within the meaning of Section 27A of the Securities Exchange Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and involve a high degree of risk and uncertainty. Forward-looking statements include statements regarding our anticipated financial and operating performance. All statements in this news release, other than those setting forth strictly historical information, are forward-looking statements. Forward-looking statements are not guarantees of future performance and actual results might differ materially. For a full list of risks and discussion of forward-looking statements, please see our Annual Report on Form 10-K for the year ended December 31, 2023, as filed with the SEC on February 23, 2024. We specifically disclaim any intention or duty to update any forward-looking statements contained in this news release.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240910419686/en/\nContacts\nApex Systems Logan O’DellCorporate Communications Managerlhippeard@apexsystems.com\nASGN Incorporated Kimberly EsterkinVP, Investor RelationsKimberly.esterkin@asgn.com\n"
    },
    {
        "Date": "2024-09-26T15:48:45.000Z",
        "Title": "Microsoft to make $2.7 billion cloud, AI investments in Brazil",
        "Author": "Reuters ",
        "Text": "SAO PAULO (Reuters) - Microsoft (MSFT)on Thursday pledged to invest 14.7 billion reais ($2.70 billion) in Brazil over three years to enhance its cloud infrastructure and artificial intelligence (AI) in Latin America's largest economy.\nWHY IT'S IMPORTANT\nThe amount is the largest-ever investment to be announced at once in Brazil by Microsoft, which said massive adoption of AI could add as much as 4.2 percentage points to Brazil's economic growth by the end of the decade.\nADDITIONAL CONTEXT\nThe investments are part of the broader \"Microsoft Mais Brasil\" program disclosed by the U.S. tech giant in 2020 to reinforce its long-term commitment to the South American nation.\nThe company said it will expand its cloud and AI infrastructure in several datacenters in Sao Paulo state and offer AI training to some 5 million people over the next three years.\nKEY QUOTES\n\"We are committed to supporting the AI ​​transformation in Brazil and ensuring it benefits everyone,\" Microsoft Chief Executive Satya Nadella said.\nBrazilian Vice President Geraldo Alckmin said the investment proves the country can be a global AI protagonist, and emphasized the renewable energy supply available in Brazil to power datacenters.\n($1 = 5.4376 reais)\n(Reporting by Patricia Vilas Boas; Editing by Richard Chang)\n"
    },
    {
        "Date": null,
        "Title": "Constellation Energy stock could double on Microsoft deal: Analyst",
        "Author": " Seana Smith    and Madison Mills    ",
        "Text": "Constellation Energy (CEG) has signed a new deal with Microsoft (MSFT) to provide it with clean energy to satisfy the tech giant's electricity needs for its cloud computing and AI data centers. This deal could see the reopening of the Three Mile Island nuclear plant, and according to Jefferies, Microsoft could be paying $112 per megawatt hour, one of the higher estimates across the Street.\nJefferies analyst Paul Zimbardo joins Catalysts to discuss the deal between Constellation Energy and Microsoft, and whether the presidential election could weigh on its completion.\n\"It was a very positive update for Constellation. The struggle on the stock is it's pricing in a lot. When we go through plant by plant, the fundamentals, the market is assuming that roughly 50% are a little bit more than 50% of their portfolio will contract at these very high prices... the $100+ per megawatt hour. So expectations are very high,\" Zimbardo says of the news.\nDespite regulatory hurdles ahead, if the plan goes through, Zimbardo explains it could be a \"game changer\" for both Constellation and the broader energy sector. \"Microsoft is paying roughly double what market power costs, around $55 a megawatt hour. So this was a significant update, paying a much larger premium than even the prior transaction with Amazon (AMZN) and a different nuclear reactor, Susquehanna, owned by Talen (TLN),\" he explains.\nZimbardo adds, \"So the way we frame it, if, as we call it, Constellation runs the table and is able to secure all their capacity, our upside case, the stock can easily double from here. But there's a lot of questions and execution that has to go in it.\"\nAs the presidential election lies just over a month away, he does not expect the outcome to weigh too much on the deal. He notes that Constellation is the largest US nuclear owner-operator and they have a good track record both operationally and financially. \"They've been working on this project for over a year, so we feel pretty comfortable that they will be able to execute on this,\" he adds.\nZimbaro concludes, \"Nuclear has become increasingly bipartisan, clean energy as well as the strong union jobs. So we think that the strong narrative towards nuclear will hold even regardless of the election outcome.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Catalysts.\nThis post was written by Melanie Riehl\n"
    },
    {
        "Date": "2024-09-21T16:58:50.000Z",
        "Title": "Microsoft deal propels Three Mile Island restart, with key permits still needed",
        "Author": "Reuters ",
        "Text": "(Refiles to fix typo in 'companies' in paragraph three)\n(Reuters) -Constellation Energy and Microsoft have signed a power deal to help resurrect a unit of the Three Mile Island nuclear plant in Pennsylvania in what would be the first-ever restart of its kind, the companies said on Friday.\nKey regulatory permits for the plant's new life, however, haven't been filed, regulators say.\nBig tech has led to a sudden surge in U.S. electricity demand for data centers needed to expand technologies like artificial intelligence and cloud computing. Nuclear energy, which is nearly carbon-free and broadly considered more reliable than energy sources like solar and wind, has become a popular option for technology companies with uninterrupted power needs and climate pledges.\n\"Nuclear plants are the only energy sources that can consistently deliver on that promise,\" Constellation Chief Executive Officer Joe Dominguez said in a statement.\nConstellation's shares were up more than 20% by early afternoon to $251.42 and have risen more than 100% so far this year.\nPower from the plant would be used to offset Microsoft's data center electricity use, the companies said.\nA relaunch of Three Mile Island, which had a separate unit suffer a partial-meltdown in 1979 in one of the biggest industrial accidents in the country's history, still requires federal, state and local approvals.\nConstellation has yet to file an application with federal nuclear regulators to restart the plant.\n\"It’s up to Constellation to lay out its rationale for justifying restart, so we’re prepared to engage with the company on next steps,\" said Nuclear Regulatory Commission (NRC) spokesperson Scott Burnell.\nConstellation said it expected the NRC review process to be completed in 2027.\nBILLION DOLLAR BET\nThe deal would help enable a revival of Unit 1 of the five-decades-old facility in Pennsylvania that was retired in 2019 due to economic reasons. Unit 2, which had the meltdown, will not be restarted.\nConstellation plans to spend about $1.6 billion to revive the plant, which it expects to come online by 2028.\nReuters first reported on the potential restart in July.\nSources told Reuters at the time that Constellation hoped it would receive federal support for Three Mile Island that was similar to what was given to the Palisades Nuclear Generating Station, which received a $1.5 billion conditional loan for a relaunch from the Biden administration.\nUnder the Constellation-Microsoft deal, Microsoft will purchase energy from the restarted plant for a period of 20 years. The Three Mile Island unit will provide 835 megawatts of electricity, or enough to power about 700,000 homes.\nA restart is expected to be challenging, but as power demand spikes, the virtually carbon-free electricity source is seeing renewed support from tech companies.\n\"This agreement is a major milestone in Microsoft's efforts to help decarbonize the grid in support of our commitment to become carbon negative,\" Bobby Hollis, vice president of energy at Microsoft, said in a statement.\nMicrosoft has also signed a power purchase agreement with Washington-state fusion company Helion, which says the plant will be online by 2028, far earlier than many scientists say fusion will become commercial.\nMajor tech executives, including ChatGPT developer OpenAI CEO Sam Altman and Microsoft co-founder Bill Gates, have touted nuclear energy as a solution to the growing power needs of data centers.\nAltman has backed and is the chairman of nuclear power startup Oklo, which went public through a blank-check merger in May, while TerraPower - a startup Gates co-founded - broke ground on a nuclear facility in June.\nNuclear plants generated about 18.6% of the total electricity in the U.S. last year, according to Energy Information Administration data.\nThe power supply deals with A.I. data centers are also facing increased scrutiny. A similar deal between Talen Energy and Amazon signed earlier this year has been challenged by a group of electric utilities alleging it could spike costs for customers or hamper grid reliability.\nFinancial details of the Microsoft-Constellation deal were not disclosed. The companies declined to give more details on the agreement.\n(Reporting by Laila Kearney in New York, Mrinalika Roy and Sourasis Bose in Bengaluru, and Timothy Gardner in Washington; Editing by Janane Venkatraman, Sriraj Kalluvila and Nick Zieminski)\n"
    },
    {
        "Date": null,
        "Title": "Google calls out Microsoft for cloud monopoly in EU complaint",
        "Author": " Seana Smith    and Brad Smith    ",
        "Text": "Alphabet's Google (GOOG, GOOGL) has filed a complaint with the European Commission against Microsoft (MSFT), accusing the software giant of using anticompetitive practices to attract customers to its Azure cloud platform. Adam Kovacevich, Founder & CEO of Chamber of Progress, joins Morning Brief to discuss the growing tension within Big Tech.\nKovacevich notes that Google is expanding in the cloud computing space, aiming to compete with industry leaders like Amazon (AMZN) and Microsoft. He explains that Google's focus on Microsoft stems from contractual terms that \"lock in customers and make it difficult for competitors to gain traction.\" However, he points out that this is \"not a new issue\" for Microsoft, nor is it the first time such concerns have been raised in the EU.\n\"This is a cold war that's gone hot between Google and Microsoft,\" Kovacevich told Yahoo Finance, noting that Microsoft has taken similar action against Google in the United States. He adds, \"I think one of the things you see here is Google punching back and saying 'look, Microsoft's contracts lock in cloud customers in the same way.'\"\nHowever, cloud computing does not have the same regulatory standards as other tech areas. \"This will be an interesting test of whether antitrust enforcers feel inclined to roll up their sleeves and take a closer look at the cloud computing market, which they haven't done to date,\" Kovacevich states.\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Angel Smith\n"
    }
]