[
    {
        "Date": "2024-10-19T01:00:55.000Z",
        "Title": "Berkshire Hathaway Lifts Stake in Sirius XM After Malone Deal",
        "Author": "  Alexandre Rajbhandari ",
        "Text": "(Bloomberg) -- Warren Buffett is amplifying his bet on Sirius XM Holdings Inc., as Berkshire Hathaway Inc. keeps adding more shares of the radio broadcasting firm to its portfolio.\nMost Read from Bloomberg\nA Broken Oil Pipeline Plunges South Sudan’s Capital Into Chaos\nDrug Decriminalization Spawns a Political Debacle for Progressives\nCities Look to AI to Flag Residents’ Trash and Recycling Mistakes\nInside the ‘Utopias’ of Mexico City\nOne City’s Plan to Re-Link a Neighborhood That Robert Moses Divided\nThe conglomerate has acquired $42 million worth of shares in the three days through Friday, regulatory filings show.\nBerkshire Hathaway now has a stake of about 32.5% in Sirius XM’s publicly traded stock, having become the top holder last month. That change came as billionaire John Malone’s Liberty Media split off its 83% stake and combined it with its separate tracking shares in the broadcaster.\nBershire added more of the stock to its holdings last week. The move provided some support for Sirius XM’s shares, which are down 50% this year amid expectations of lower sales.\nMost Read from Bloomberg Businessweek\nAI Detectors Falsely Accuse Students of Cheating—With Big Consequences\nBYD Is Winning the Global Race to Make Cheaper EVs\nNeuralink Co-Founder’s New Startup Sells a Brain Computer Toolkit\nA Fentanyl Vaccine Is a Long Shot That Just Might Work\nHow Starbucks Became a Sugary Teen Emporium\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-10-11T17:47:02.000Z",
        "Title": "Buffett's Berkshire cuts stake in BofA to below 10%",
        "Author": "Reuters ",
        "Text": "(This Oct. 10 story has been corrected to say that Berkshire has netted more than $10 billion since mid-July, not until mid-July, in paragraph 5)\n(Reuters) - Billionaire Warren Buffett's Berkshire Hathaway unloaded more Bank of America stock this week that takes its stake in the U.S. banking giant below 10%.\nBerkshire sold 9.5 million shares worth $382.4 million for this week, according to a regulatory filing on Thursday.\nThe U.S. Securities and Exchange Commission requires shareholders that own more than 10% of a company to disclose stock purchases and sales within two business days.\nNow investors at Bank of America must likely wait for Berkshire's quarterly financial reports or quarterly stock holdings disclosures to learn if the Omaha, Nebraska-based company sold more.\nIt started trimming the stake in mid-July when it sold about 33.9 million shares for around $1.48 billion. Since then, the investment giant has netted more than $10 billion.\nBofA, however, is not the only stock that Buffett has dumped recently. Earlier this year, Berkshire halved its stake in technology behemoth Apple.\nAt Berkshire Hathaway's annual meeting in May, Buffett said selling made sense as the federal tax rate on capital gains could grow depending on who wins the U.S. presidential election.\nBuffett, one of the world's most revered investors, first invested in Bank of America back in 2011 when he purchased $5 billion worth of its preferred stock.\nThe bank will report results next week, along with peer Citigroup, with investors keeping a close eye on the potential impact from higher deposit costs and tepid loan demand.\n(Reporting by Jaiveer Singh Shekhawat in Bengaluru; Editing by Shailesh Kuber)\n"
    },
    {
        "Date": "2024-10-11T08:57:00.000Z",
        "Title": "The Zacks Analyst Blog Berkshire Hathaway, Canadian Pacific Kansas City, American International and Steel Partners",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – October 11, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include Berkshire Hathaway Inc. (BRK.B), Canadian Pacific Kansas City Ltd. CP, American International Group, Inc. AIG and Steel Partners Holdings L.P. SPLP.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 12 major stocks, including Berkshire Hathaway Inc., Canadian Pacific Kansas City Ltd. and American International Group, Inc., as well as micro-cap stock Steel Partners Holdings L.P.The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the year-to-date period (+27.8% vs. +26.7%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels an increase in float, drives earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Canadian Pacific have outperformed the Zacks Transportation - Rail industry over the year-to-date period (+2.3% vs. -1.4%). Following the approval of the merger with Kansas City Southern, the company is known as Canadian Pacific Kansas City Ltd. The deal is anticipated to draw synergies (annually) of $1 billion within three years.The merged entity has started to offer a daily premium intermodal service between the U.S. Midwest and Mexico. We are impressed with Canadian Pacific Kansas City's efforts to reward its shareholders through dividends and share repurchases.On the flip side, high operating expenses continue to weigh on the company's bottom line. The positivity surrounding the stock is evident from the fact that the Zacks Consensus Estimate for current-year earnings has been revised upward over the past 60 days. In view of the positives surrounding the stock, investors would do well to bet on the same at current levels.(You can read the full research report on Canadian Pacific here >>>)American International’s shares have gained +13.3% over the year-to-date period against the Zacks Insurance - Multi line industry’s gain of +20.4%. The company’s cost-cutting efforts are driving operational efficiency, aiding the margins. It continues to make divestitures to streamline its operations, focus on the General Insurance unit and reduce portfolio volatility.American International’s robust cash generation abilities have enabled it to continue elevating shareholder value through share buybacks and dividend payouts. Its FCF increased 5.4% in the trailing 12-month period.However, deterioration in its North America Commercial Lines’ combined ratio is a headwind. Its net debt-to-capital is higher than the industry. Moreover, its ROE of 9.52% is lower than the industry’s average of 16.09%, reflecting inefficiency in utilizing shareholders’ funds. As such, the stock warrants a cautious stance.(You can read the full research report on American International here >>>)Shares of Steel Partners’ have gained +4.1% over the past six months against the Zacks Diversified Operations industry’s gain of +15.2%. This microcap company with market capitalization of $808.39 million reported strong financial results in second-quarter 2024, with revenues growing 6.4% year over year to $533.2 million and a 113.2% surge in net income to $124.9 million.Revenues for the six months ended Jun 30, 2024 also increased by 6.7% to $1 billion. This growth reflects the company's effective diversification across its industrial and financial services segments. SPLP's operational efficiency is highlighted by a 15.7% adjusted EBITDA margin, up from 14.7% in second-quarter 2023.The company's balance sheet is robust, with $256.4 million in cash and a $112-million debt reduction in the first half of 2024, enhancing financial stability. Investments in the Supply Chain segment, which saw 192% in revenues for the six months ended Jun 30, 2024, position SPLP for long-term growth, particularly as global supply chains evolve.(You can read the full research report on Steel Partners here >>>)\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmerican International Group, Inc. (AIG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nCanadian Pacific Kansas City Limited (CP) : Free Stock Analysis Report\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-15T11:00:00.000Z",
        "Title": "2 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Most investors know that Berkshire Hathaway (NYSE: BRK. A)(NYSE: BRK.B) has been one of the best-performing investments of all time. Its key to success has been to invest consistently, holding for years or even decades at a time.\nBut Berkshire's run is far from over. And right now, there are two exciting reasons nearly every investor should consider jumping into this legendary stock.\nWarren Buffett acquired Berkshire Hathaway back in 1965. Over the first few decades of operation, the company soared in value. In the 1980s, for example, Berkshire stock rose in value by at least 30% most years, with annual returns reaching as high as 90%.\nEven though Berkshire's biggest days of growth are behind it, the shares have still performed quite well over more recent decades. During the past 30 years, for instance, Berkshire's total return has greatly outperformed that of the S&P 500 index. Even over just the past three years, Berkshire stock has risen by roughly 60%, besting the S&P 500's return of just 38% over the same time period.\nBRK. B Total Return Level data by YCharts\nWhat has allowed Berkshire stock to beat the market again and again, even as its valuation has soared to nearly $1 trillion? The biggest key has been Buffett's investing prowess. Buffett and his investing team have repeatedly invested shareholder capital successfully, whether by buying shares of a publicly traded company, acquiring a private company, or simply buying back Berkshire's own stock.\nBut there's another advantage that Berkshire has that few other investments offer: the advantage of permanent capital. That is, Berkshire has a pool of capital that it can invest regardless of market conditions. During the 2008 financial crisis, for example, it was able to spend billions of dollars on blue chip companies at discounts simple because so many other competing pools of capital had already dried up.\nThis permanent capital is generated by Berkshire's insurance businesses -- an industry that doesn't necessarily see demand plummet during recessions or bear markets. While underwriting profits may not be very high during certain market cycles, insurers provide a steady stream of investable cash because premiums are paid up front while claims are paid out after the fact. Many other investment vehicles have copied this business model in recent years, but it has remained a durable competitive advantage for Berkshire, especially when paired with Buffett's investment acumen.\nDiverting more cash that could be used for lifestyle expenses into your investment account is not always fun, but it's a wise long-term decision. Investing in Berkshire can eliminate some of the friction involved in upping your savings rate.\nFirst, every time you buy more Berkshire stock, you know you're betting on one of the most successful investment vehicles in history. Putting more money to work in the market is significantly more fun when you have the confidence that these investments will match or even outpace the overall market's returns.\nSecond, by buying shares of Berkshire, you become a partner in one of America's most iconic businesses. You quite literally become an investing partner with Buffett and the rest of this team. Whenever they make a move, so are you. Except in this case, they're doing all of the groundwork for you, while you sit back and enjoy life. If they see opportunities in a certain industry or region of the world, Buffett and company are empowered to invest your money where it has the best chance of growing. Whereas with other investments, your capital may be limited to a certain industry or geography.\nIn a nutshell, investing in Berkshire can be more fun than nearly any other investment vehicle. Who wouldn't want to be investment partners with Warren Buffett? And any trick you can use to up your savings rate is nearly as important as choosing the right investment. With Berkshire, you can accomplish both, making it an attractive choice for nearly every investor.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 14, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\n2 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-16T14:50:17.000Z",
        "Title": "What Makes Berkshire Hathaway (BRK-B) a Lucrative Investment?",
        "Author": "  Soumya Eswaran ",
        "Text": "Fiduciary Management Inc. (FMI), an independent money management firm, released its third-quarter 2024 investor letter. A copy of the letter can be downloaded here. In the third quarter, domestic and international equity markets rose. FMI has typically lagged in more speculative-driven bull markets (similar to today’s) and outperformed in more challenging environments driven by valuation framework, focus on business quality, and balance sheet strength. The FMI Large Cap strategy trades at a ~30% and ~50% discount to the 493 stocks in S& P 500 and Magnificent Seven, the FMI Small Cap strategy trades at a ~37% discount to the Russell 2000 and the FMI International strategy continues to trade at a discount to the MSCI EAFE Index. In addition, please check the fund’s top five holdings to know its best picks in 2024.\nFiduciary Management Inc. highlighted stocks like Hathaway Inc. (NYSE:BRK-B), in the third quarter 2024 investor letter. Incorporated in 1998, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in insurance, freight rail transportation, and utility businesses. The one-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was 1.33%, and its shares gained 35.73% of their value over the last 52 weeks. On October 4, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $462.68 per share with a market capitalization of $996.872 billion.\nFiduciary Management Inc. stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B) in its Q3 2024 investor letter:\nBerkshire Hathaway Inc. (NYSE:BRK-B) is a diversified holding company that owns subsidiaries in insurance and reinsurance, freight rail transportation, utilities, energy, manufacturing, services, retail, and finance. Chairman, controlling shareholder, and famed investor Warren Buffett uses the permanent capital base of the large insurance assets – along with disciplined underwriting standards – to drive value-added investments that compound shareholder returns over time. From its inception in 1965 through 2023, Berkshire’s market value has increased at an annual growth rate of 19.8% vs. 10.2% for the S&P 500. Berkshire’s primary assets are its large insurance businesses, including GEICO, General Re, and National Indemnity, which we estimate at ~35% of the company’s value. The enduring competitive advantages of Berkshire’s insurance assets have allowed it to increase its float at a higher rate than its peers and provide low-cost funding for a strong collection of operating businesses, including BNSF Railroad, McLane Foodservice, Pilot Travel, Marmon Industries, Dairy Queen, and many others. On conservative estimates, we believe the company is trading at over a 20% discount on a sum[1]of-the-parts basis, and carries a mid-teens earnings multiple when factoring in a healthy net cash position and look-through EPS from its public equity portfolio. In an expensive market, we find the valuation to be significantly more appealing than the S&P 500. We expect a combination of strong operations and value-added acquisitions to increase the intrinsic value of the company at an above-average rate going forward.\nA team of insurance professionals in a boardroom overlooking a city skyline.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 14th position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 120 hedge fund portfolios held Berkshire Hathaway Inc. (NYSE:BRK-B) at the end of the second quarter which was 119 in the previous quarter. While we acknowledge the potential of Berkshire Hathaway Inc. (NYSE:BRK-B) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Berkshire Hathaway Inc. (NYSE:BRK-B) and shared the list of stocks that hedge funds and mutual funds are in love with and those that they hate according to Goldman Sachs. In addition, please check out our hedge fund investor letters Q3 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    }
]