[
    {
        "Date": "2024-03-01T12:59:00.000Z",
        "Title": "Berkshire Hathaway Is Hoarding $168 Billion in Cash -- Here's Why",
        "Author": "  Collin Brantmeyer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) recently released its annual report, revealing that the conglomerate holding company held a record high of $168 billion in cash and cash equivalents at the end of 2023. With that staggering amount of cash, many investors may question how Chairman and Chief Executive Officer Warren Buffett might put it to work. Lucky for us, Buffett outlined why he is hoarding the cash in his annual letter to shareholders.\nLet's look at how Berkshire built its unprecedented cash hoard, what the company currently does with its cash, and what it might take for Buffett to deploy it meaningfully.\nBuffett's preferred metric for Berkshire's success is operating earnings -- a measurement of a company's profit from its core operations after expenses. In 2023, Berkshire generated $37.4 billion in operating earnings, an increase of 21% from $30.9 billion in 2022.\nAs a result of Berkshire's strong business performance, and being a net seller of its stock holdings in 2023, the company's cash position soared from $128.5 billion to $167.8 billion, or an increase of 31%.\nIn the near term, Buffett appears content with holding the majority of Berkshire's cash in Treasury bills -- a short-term security backed by the U.S. Treasury Department with a maturity of one year or less.\nAs of Dec. 31, Berkshire held an astounding $133.4 billion in Treasury bills, with yields in the neighborhood of 5% to 5.4%. If yields remain on the low end of that range throughout 2024 and Berkshire maintains its current position, the company will generate about $7 billion from those investments.\nIn past annual shareholder letters, Buffett has emphasized that Treasury bills serve as Berkshire's \"default\" choice for the company's cash when compelling investment opportunities are scarce, owing to their liquidity and safety.\nAdditionally, Buffett once wrote: \"Over the long term, however, [Treasury bills] are riskier investments -- far riskier investments -- than widely diversified stock portfolios that are bought over time.\" The risk Buffett is referring to isn't that the U.S. government won't pay, but that Treasury bills often lose money to inflation. That isn't the case in the short term, with the current inflation rate in the U.S. at 3.1% during the past 12 months, according to the consumer price index.\nAnother way Buffett utilizes its mountain of cash is by repurchasing shares of Berkshire Hathaway. In 2023, Berkshire spent $9.2 billion on share repurchases, lowering its shares outstanding by 1.1%. During the past 10 years, Berkshire has lowered its shares outstanding by 12.2%. By reducing its share count, Berkshire rewards existing shareholders by increasing their ownership stake.\nBerkshire could return capital to its shareholders through dividends, but that route seems unlikely, considering the company has never paid one during Buffett's tenure.\nOtherwise, Berkshire could continue to make acquisitions -- it bought insurer Alleghany Corporation for about $11.6 billion in 2022, and it recently purchased the final 20% ownership interest in the travel center network Pilot Flying J for a total investment of roughly $13.6 billion.\nBerkshire also holds a portfolio of stocks estimated to be worth $372 billion, including a $165 billion stake in Apple, and can continue to add to it with its mountain of cash.\nOne downside Berkshire faces, given its market capitalization of nearly $900 billion, is that Buffett may struggle to find stocks worth buying that will make a meaningful return. Buffett touched on this point in his most recent annual shareholder letter: \"Given Berkshire's present size, building positions through open-market purchases takes a lot of patience and an extended period of \"friendly\" prices. The process is like turning a battleship. That is an important disadvantage which we did not face in our early days at Berkshire.\"\nDespite having a mountain of cash at his disposal, Warren Buffett is unlikely to deploy the majority of it any time soon. In part, that's because, as an insurance company, Berkshire will always need a cash reserve in the event of catastrophic losses. The company's float, or premiums that its insurance customers paid upfront, can be used for investments, but it is also needed to settle claims. To that effect, Buffett has frequently stated that Berkshire will never hold less than $30 billion in cash and cash equivalents.\nIn addition, Buffett does not want to see his beloved company fall victim to an economic crisis similar to the Great Recession in 2008. The Oracle of Omaha recently explained his stance on Berkshire's current cash position:\nExtreme fiscal conservatism is a corporate pledge we make to those who have joined us in ownership of Berkshire. In most years -- indeed in most decades -- our caution will likely prove to be unneeded behavior -- akin to an insurance policy on a fortress-like building thought to be fireproof. But Berkshire does not want to inflict permanent financial damage.\nBerkshire Hathaway has generated an incredible compound annual gain of 19.8% from 1965, when Buffett took control, to 2023, significantly outpacing the S&P 500's compound annual gain of 10.2%. While Berkshire's growth prospects may be limited in some regards, there is simply no other public company in the market as well-positioned for a market downturn. That alone makes Berkshire Hathaway a solid addition to any stock portfolio.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nCollin Brantmeyer has positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Is Hoarding $168 Billion in Cash -- Here's Why was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-27T13:00:01.000Z",
        "Title": "Berkshire Business Unit Focus: Pilot Flying J",
        "Author": "  Horse Poor Investor ",
        "Text": "On Jan. 16, Berkshire Hathaway Inc. (NYSE:BRK.A) (NYSE:BRK.B) announced the purchase of the remaining 20% of Pilot Travel Centers (PTC) from the Haslem family. A week and a half before the sale, the Delaware court lawsuit over accounting methods disputing the value of the balance of the company owned by the Haslems was settled by both parties. Both A and B shares had closed slightly below the previous day's price after the transaction was announced. Berkshire's 80% of the company before the purchase comprised 20.80% of Berkshire's revenues in the third quarter of 2023. This discussion aims to provide background information on this now wholly-owned subsidiary that makes up a large portion of the Berkshire Hathaway portfolio.\nWarning! GuruFocus has detected 6 Warning Signs with BRK.A.\nTruck stops, travel centers and travel plazas are part of the highly fragmented and competitive retail defensive industry. Most truck stops and travel centers are privately owned chains or single-location enterprises. Target customers are professional truck drivers and distance motorists who travel long distances and are looking for convenience, quick service and opportunities to rest and replenish both themselves and their fuel tanks. Most truck stops offer fuel rewards or loyalty programs to attract repeat customers.\nThe truck stops and travel industry began in the 1920s and was aligned with the development of the automotive industry. The first truck stops consisted mainly of simple rest stops and basic facilities such as gas stations, small buildings and diners. The industry grew rapidly during the 1950s and 1960s to include larger and more sophisticated facilities offering additional services and merchandise. In the late '80s and early '90s, truck stops combined fuel stations with convenience or travel stores and full-serve restaurants. The '90s began to attract more consumer travelers with RVs and automobiles. Truck stop operators noted that professional drivers and these new gasoline smaller vehicle customers preferred quick, convenient services and amenities, so sit-down restaurants were exchanged for quick, grab-and-go style eateries, otherwise known as quick-serve restaurants with less sit-down space. Truck stops began carrying a wider arrangement of merchandise including perfume, electronics and gift items displayed in convenient store layouts that appealed to their customer base. Some stops even feature hotels or cinemas.\nTypically truck stops are conveniently located near large interstate highways. The average truck stop occupies approximately 75 acres of land to provide plenty of parking for weary professional drivers who must comply with the hours-of-service rules mandated by the Federal Motor Carrier Safety Administration.\nTruck stops often engage in franchise partnerships to roll out their convenience stores and restaurant services. Warren Buffett (Trades, Portfolio) discussed the characteristics of strong economic franchise operations in his 1991 chairman's letter. Both Pilot Flying J and Travel Centers of America also offer franchise opportunities for truck stop site owners. Common FSR and QSRs franchise operations within large truck stops include Black Bear Diner, IHOP, Starbucks (NASDAQ:SBUX), Taco Bell, Dairy Queen, KFC, Subway, Pizza Hut, Dunkin' Donuts (DNKN) and many others.\nThe U.S. trucking market size is expected to grow at a 3% compound annual growth rate through 2027, according to Zippia.com, which leaves a modest opportunity for truck stop providers to capture additional shares of this modestly growing market.\nThe largest truck stop in the U.S., off Interstate 80 in Walcott, Iowa, is three times larger than the size of an average truck stop and has 5,000 visitors per day. It has been a Travel Centers of America franchised operation since 1992, after the death of then-owner Bill Moon (the site is still owned by the Moon family.)\nThe oldest truck stop in the U.S. is Dixie Travel Plaza, which was established in 1928 and is just off Interstate 55 in McLean, Illinois. Since 2012, Dixie Travel Plaza has been owned by Road Ranger, which was purchased by Chilean company Enex, a subsidiary of Quinenco SA (XSGO:QUINENCO), in 2018.\nThe charts below roughly depict the distribution of geographic footprint and 2022 revenue estimates for major truck stop players in the U.S. and Canada. These data from publicly available sources contain caveats in terms of accuracy as all these establishments are either privately owned or are subsidiaries of larger corporations, so do not comply with SEC filing guidelines. Also, chains often consist of both large truck stops that accommodate professional rigs and heavy traffic as well as smaller, traditional gas stations or related businesses, so comparisons between the number of locations and revenue estimates are not reflective of the differences in individual receipts and volume of traffic per each location. For example, Love's Truck Stop's geographical footprint also includes its Speedco subsidiary of oil change specialty shops acquired in 2017. The location map may also conceal an overlap in the number of sites for Pilot and Town Pump as the companies have a notable relationship in Montana. Pilot lists 36 Town Pump sites in its list of locations and Town Pump acquired three Montana Pilot Flying J locations, which it still operates under the Pilot brand as part of a Federal Trade Commission agreement designed to reduce competition in a 2010 merger between Pilot Travel Centers and Flying J Inc.\nNevertheless, Pilot appears to be the clear leader both in terms of its geographic footprint and estimated revenue. The most formidable competitor is Love's Truck Stops. Pilot Travel Centers LLC (doing business as Pilot Flying J) is now wholly owned by Berkshire Hathaway. Travel Centers of America operated as a publicly traded company until February of 2023, when BP (NYSE:BP) purchased the company. As stated above, Road Ranger is owned by the Enex subsidiary of Quinenco. Other players in this field are privately held.\nBerkshire started investing in Pilot Flying J when Buffett bought a 38.60% stake in the company in October 2017 for $3 billion and bought an additional 41.40% stake in January 2023 for an estimated value of roughly $8.20 billion, with the remaining 20% of the company bought for an estimated $11 billion in January of this year.\nBefore Berkshire's investment, Pilot Travel Centers had many of the large-moat business characteristics that attracted the Oracle of Omaha, including a long, family-centric operating history, market dominance and good brand recognition. Forbes ranked Pilot as the fifth-largest private U.S. company before Berkshire Hathaway's investment in 2017 and the large influx of the conglomerate's cash flow resources has improved the company's debt rating and expanded its geographical footprint.\nSince Berkshire's initial stake, Pilot Flying J has grown by nearly 15% in terms of its North American footprint. The company had an annual increase in revenues between 2021 and 2022 of nearly 58%. Thus, Berkshire Hathaway has paid approximately $22 billion for a company that generates as much as $42 billion annually and may generate more than $1 billion in cash flow this year. However, revenue and profits of the company have both decreased since 2022. In April 2023, Berkshire replaced the Haslem-selected CEO and chief financial officer positions with two well-entrenched Berkshire executives.\nPilot's contribution to Berkshire's profitability is a tall order considering the sheer size of its entire portfolio and operations. The company has admittedly struggled in recent years to find acquisitions that can solidly benefit its investment value position. As Pilot Travel Centers comprised a large percentage of Berkshire's revenues in the third quarter of 2023, one way to gauge the impact of this acquisition is by looking at its stock performance since the time of the company's initial investment and comparing it to the performance of the stock's performance before that time. Another way is to gauge Berkshire's total return since the acquisition against a larger market index.\nTo apply the first gauge, I compared various point-in-time metrics of third-quarter 2017 (a snapshot from a time before Berkshire's initial investment in Pilot) with its current metrics:\nPERFORMANCE\n3RD-QUARTER 2017\nCURRENT\nCHANGE (CAGR)\nSHARE PRICE TTM\n$270,430.00\n$610,086.00\n14.52%\nREVENUE TTM\n$235.14B\n$349.271B\n7.10%\nNET INCOME TTM\n$18.675B\n$76.813B\n22.00%\nFCF TTM\n$33.001B\n$26.723B\n3.90%\nTOTAL RETURN TTM\n21.05%\n30.56%\n6.41%\nVALUATION \n3RD-QUARTER 2017\nCURRENT\nCHANGE (CAGR)\nPE RATIO TTM\n20.44\n11.57\n6.41%\nPB RATIO TTM\n1.51\n1.68\n1.79%\nPFCF TTM\n14.15\n33.04\n15.18%\nEV/SALES\n2.08\n2.79\n5.02%\nEV/EBITA\n11.73\n16.92\n6.30%\nEARNINGS YIELD\n5.05%\n8.72%\n9.53%\nFCF YIELD\n7.40%\n3.03%\n16.05%\nCAPITAL ALLOCATION \n3RD-QUARTER 2017\nCURRENT\nCHANGE (CAGR)\nROA TTM\n2.87%\n7.81%\n18.16%\nROE TTM\n6.06%\n14.62%\n15.81%\nROIC TTM\n3.22%\n3.97%\n3.55%\nTo apply the second gauge, I compared the growth of shares and dividends (a proxy for total return) for Berkshire against the Vanguard S&P Value Index Fund ETF (VOOV) and the Vanguard 500 Index Fund (VOO) from Oct. 2, 2017 (a snapshot from a time before the initial investment in Pilot) until today.\nKeep in mind these results have been convoluted by changes and events that occurred to Berkshire Hathaway's greater portfolio during that time. Since 2017, the conglomerate has made sizable investments in Apple (NASDAQ:AAPL) and Bank of America (NYSE:BAC) in addition to those made in Pilot.\nDespite the Pilot acquisition, Berkshire Hathaway is currently not attractive as a value investment prospect. GuruFocus gives the Class A stock an overall score of 69 and a value rank of just 1 priced over 36% above its GF Value.\nPilot Travel Centers is a longtime market leader in the heavily competitive truck stop and travel center business. The company has all the aspects of a quality business that Buffett loves, was bought at a screaming deal and will likely positively affect Berkshire Hathaway's business in the coming years. Unfortunately, with its huge size and cash position, a lot is needed from an acquisition to move the needle of profitability and value upward, and Pilot's ability to do that may fall short.\nCurrently, Berkshire stock is not an attractive buy. However, if the company can find more diamonds like Pilot in the future, its prospects as a viable investment will be rosy.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-12T10:01:00.000Z",
        "Title": "Warren Buffett Just Added $246 Million to 1 of Berkshire Hathaway's Top Holdings",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "While Warren Buffett hasn't seen a whole lot to like in the stock market recently, there's one stock he seemingly can't get enough of.\nOver the last couple of years, he's built up a 28% stake in Occidental Petroleum (NYSE: OXY) for Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). That makes it one of Berkshire's top holdings, just behind fellow oil and gas company Chevron (NYSE: CVX).\nThe Oracle of Omaha has added to his Occidental position on three separate occasions since the start of December. His most recent purchase for Berkshire Hathaway's portfolio amounted to about $246 million. That follows purchases of about $589 million and $312 million in December. Meanwhile, Berkshire still owns about $8.5 billion worth of preferred shares in Occidental, which pay an 8% dividend.\nHere's why Occidental has become Buffett's favorite energy stock and could soon top Chevron as Berkshire's biggest investment in the industry.\nOccidental and Chevron are both integrated oil and gas companies. However, where Chevron makes most of its money from downstream operations like refineries and chemical plants, Occidental is heavily invested in drilling oil out of the ground. As a result, Occidental's business is much more closely tied to the price of oil.\nIts strong position in the Permian Basin gives it a cheap source of oil production. It strengthened that position with the acquisition of Anadarko, supported by Berkshire's $10 billion investment in the company. More recently, it added CrownRock last December, when Buffett started buying up shares again.\nOccidental's big investments in the Permian Basin have put pressure on its balance sheet. The company now holds a significant amount of debt. Management plans to divest non-core assets to accelerate the paydown of that debt. It did something similar following the Anadarko acquisition in 2019 and the subsequent drop in oil prices in 2020.\nThe moves to add more cheap sources of oil make sense in light of Occidental CEO Vicki Hollub's extreme bullishness on the price of the commodity. For one, she said the CrownRock acquisition will generate an additional $1 billion in cash flow in its first year as long as oil prices remain above $70. That was exactly the spot price of oil at the time of the acquisition, and it's only climbed to the mid-70s since.\nMore recently, Hollub has noted the potential for an oil supply shortage as soon as 2025. A production cut from OPEC combined with growing demand from China will push oil prices higher, she says. As a result, she sees oil climbing to $80 per barrel by the end of the year.\nBuffett has a lot of confidence in Hollub. He called her \"an extraordinary manager\" at Berkshire's 2023 Shareholder meeting in May. After managing the company through the depressed oil prices of 2020 right after acquiring Anadarko, she seems to be up for almost any task.\nShares of Occidental have gotten off to a poor start in 2024. While Chevron shares have climbed about 2% since the start of the year, Occidental is down about 3.5%.\nMoreover, the valuation for Occidental is extremely attractive. Shares currently trade for an enterprise value/earnings before interest, taxes, depreciation, and amortization (EV/EBITDA) multiple of just 5x. By comparison, Chevron trades for a 6.6x multiple.\nThat said, there's a lot more risk in buying Occidental than competing oil and gas companies. For one, it's heavily reliant on the price of oil. As explained, the bulk of its revenue comes from drilling, not downstream operations. Moreover, Occidental's balance sheet includes substantial levels of debt following the CrownRock acquisition. That leverage puts added pressure on management if oil prices decline in the future, making it less profitable to drill.\nIt's important to note that while Buffett is very confident in the future of Occidental, it's still less than 4% of Berkshire's equity portfolio and an even smaller percentage of the conglomerate's total holdings when you include its cash position and wholly owned subsidiaries. So, remaining diversified is key.\nShould you invest $1,000 in Occidental Petroleum right now?\nBefore you buy stock in Occidental Petroleum, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Occidental Petroleum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nAdam Levy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett Just Added $246 Million to 1 of Berkshire Hathaway's Top Holdings was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-26T18:25:49.000Z",
        "Title": "Pilot’s drop in profits led to lower valuation in final Berkshire purchase",
        "Author": "  John Kingston ",
        "Text": "The final tranche of Pilot Travel Centers purchased by Berkshire Hathaway appears to have put the enterprise value of the travel center chain significantly lower than it was just a year earlier.\nIn the company’s 10-K report filed with the Securities and Exchange Commission over the weekend, Berkshire Hathaway revealed that it had paid $2.6 billion for the final 20% of Pilot it did not already own. That would give Pilot an enterprise value of $13 billion.\nBut in the first quarter of 2023, Berkshire Hathaway paid $8.2 billion for a 41.4% stake in Pilot. That equates to an enterprise value of approximately $19.8 billion.\n\nWith the acquisition price earlier this year set as a multiple of earnings before interest and taxes, the data in the 10-K on Pilot’s performance suggests a weaker 2023 is the reason for the decline in the enterprise value paid for the final fifth compared to where it was a year earlier.\nPilot, having been a private company, did not need to publicly release financial data previously. But it does so now as a subsidiary of publicly traded Berkshire.\nWhile some of the 22% decline in 2023 revenue at Pilot from a year earlier can be attributed to lower diesel prices, with revenue dropping to $56.8 billion from $72.7 billion in 2022, pretax earnings at Pilot suffered a bigger decline, a drop of 54.7% to just over $1 billion from $2.33 billion a year earlier.\nIn its relatively brief comments about Pilot’s operations, Berkshire Hathaway management in the 10-K said Pilot last year sold about 16.2 billion gallons of diesel, gasoline and other fuel-related products in 2023. That was down from 18.4 billion gallons a year earlier.\nThe decline was not primarily a function of a drop in sales at the pump, Berkshire said, but “predominantly” in the wholesale fuel and fuel marketing businesses of Pilot.”\nIn filings last year and then repeated in this year’s 10-K, Berkshire Hathaway said it had changed the accounting of its stake in Pilot before it had control from the equity method of accounting to a standard known as “fair value.”\nAs a result of that change, Berkshire Hathaway took a one-time noncash gain of $3 billion, as the fair value method put the value of Pilot in excess of the equity method.\nThe accounting changes had a significant impact on depreciation and amortization. Moving to acquisition accounting from equity accounting was a major cause of depreciation and amortization costs rising to $832 million last year from $436 million a year earlier, according to the 10-K.\nAdditionally, interest costs nearly doubled, increasing $213 million, up to $437 million from $224 million.\nThe early 2023 purchase of a 41.4% stake in Pilot gave Berkshire Hathaway controlling interest when combined with the 38.6% share in Pilot that the conglomerate first acquired in 2017. That 2017 purchase for $2.76 billion gave Pilot an enterprise value of about $7.1 billion.\nBerkshire had not responded by publication time to a phone message about the difference in valuations.\nBerkshire and the Haslam family, which sold Pilot to Berkshire, squared off in the latter part of 2023 and into 2024 over the valuation of the final 20% before finally settling lawsuits against each other just before the dispute was to go to trial in January in Delaware Chancery Court.\nThe suit between the two sides began with the Haslam family criticizing changes in Berkshire’s accounting of its stake in Pilot after the 41.4% acquisition gave it controlling interest in Pilot.\nBerkshire implemented what the Haslams called the “pushdown” method for valuing its stake in Pilot. The founding family of Pilot was concerned that the practice was different from the formula the two sides had agreed upon for valuing that final 20%, which was to be a multiple of EBIT. The dispute ultimately was settled before the case went to trial, and the sale of the final stake in Pilot to Berkshire went ahead.\nThe two sides never said whether there were any changes in the formula between the 2023 acquisition of 41.4% and the 20% acquisition in early 2024 as a result of the settlement.\nIn the 10-K, Berkshire Hathaway said “the redemption price was to be based on a multiple of PTC’s earnings for the preceding year, with specific other adjustments, including the amount of PTC’s net debt.”\nIn its lawsuit, Pilot founder James Haslam said he had been told by Berkshire Hathaway CEO Warren Buffet that the 20% would be valued under provisions earlier agreed upon, though the Haslams were concerned that the pushdown accounting would hurt the valuation of Pilot as a multiple of EBIT.\nIn the brief summation of the Haslams vs. Berkshire lawsuits, all the Berkshire 10-K said was that “all litigation between Pilot Corp (the Haslams) and Berkshire was settled in January 2024.”\nMore articles by John Kingston\n1st peek at Pilot’s finances after Berkshire Hathaway ownership grows\nTruck stops in flux: Pilot CEO switch, TA sale cleared\nDebt ratings review: Pilot remains strong operator\nThe post Pilot’s drop in profits led to lower valuation in final Berkshire purchase appeared first on FreightWaves.\n"
    },
    {
        "Date": "2024-02-15T17:26:23.000Z",
        "Title": "Warren Buffett’s Berkshire Hathaway sells off some Apple stock",
        "Author": "  Nicole Goodkind, CNN ",
        "Text": "Warren Buffett’s Berkshire Hathaway sold off 10 million shares of Apple stock in the final three months of 2023, representing about 1% of its holdings in the company.\nThe tech titan has become a major holding for the Oracle of Omaha’s company and is known as one of the so-called “four giants” – alongside its insurance, railroad and energy operations – that Buffett says drives most of Berkshire’s value.\nBut the Omaha-based conglomerate announced on Wednesday it had slightly trimmed its position in Apple in a regulatory filing with the Securities and Exchange Commission.\nThe selloff is notable for Buffett, who is known to hold onto stocks for long periods of time. “If you aren’t willing to own a stock for 10 years, don’t even think about owning it for 10 minutes,” he’s said.\nBerkshire still owns more than 905 million shares of the company, worth about $174 billion. That represents 6% of all Apple shares and one-fifth of Berkshire’s entire portfolio.\nMany investors, hoping to duplicate the success of Berkshire’s portfolio, closely watch and often copy Buffett’s market moves.\nThis isn’t the first time Berkshire, which began investing in Apple in 2016, has pared back some of its holdings in the tech company.\nIn the second half of 2020, the company sold off about $11 billion worth of the stock, a move that Buffett, 93, later said was “probably a mistake,” in a shareholder meeting.\nBuffett went on to praise Apple CEO Tim Cook as “one of the best managers in the world” and last year said that the company “just happens to be a better business than any we own.”\nBerkshire Hathaway purchased an additional $31 billion in Apple shares in 2022.\nShares of Apple fell by about 1.2% in morning trading on Thursday. Shares of Berkshire Hathaway were 0.7% higher.\nApple reported earlier this month that sales grew year-on-year during the December quarter, following a streak of four consecutive quarters of revenue declines caused by slower device sales amid an uncertain economic environment. But while product sales have ticked up, revenue from the key China region slid, a sign of growing competition weighing on the iPhone maker.\nThe company’s stock is essentially flat from the start of this year.\nAs it works to right the ship, Apple has taken a bold bet and rolled out its first new product in nearly a decade: the Vision Pro mixed reality headset. The device, which cost Apple billions in research and development, is being touted by the company as the future of computing, but for now, it remains a costly and clunky piece of hardware with limited uses.\nFilings also showed that Berkshire sold 80 million shares of printer company HP in the fourth quarter of 2023, reducing its holdings by 78%. It also pared off 32% of its holdings in media company Paramount.\nBuffett’s annual letter to shareholders is due out on February 24. It will be the first letter since his long-time business partner, Charlie Munger, died last November.\nAdditional reporting by Clare Duffy\nFor more CNN news and newsletters create an account at CNN.com\n"
    }
]