[
    {
        "Date": "2024-04-04T10:18:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Berkshire Hathaway, Procter & Gamble, Adobe, Advanced Micro Devices and AstraZeneca",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – April 4, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Berkshire Hathaway Inc. (BRK.B), The Procter & Gamble Co. PG, Adobe Inc. ADBE, Advanced Micro Devices, Inc. AMD and AstraZeneca PLC AZN.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc., The Procter & Gamble Co. and Adobe Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway shares have outperformed the Zacks Finance sector over the past year (+36.2% vs. +25.1%) as well as the broader S&P 500 index (+36.2% vs. +24.9%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Procter & Gamble have outperformed the Zacks Soap and Cleaning Materials industry over the past year (+9.6% vs. +8.2%). The company has been gaining from robust pricing and a favorable mix, along with strength across segments.It has been focused on productivity and cost-saving plans to boost margins. This led to bottom line beating the consensus mark for the sixth consecutive quarter in the second quarter of fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view.However, the company has been witnessing supply-chain issues, higher SG&A costs, higher transportation costs and rising inflation. Its significant international presence exposes it to foreign currency risks, which acts as a headwind.(You can read the full research report on Procter & Gamble here >>>)Adobe shares have gained +29.6% over the past year against the Zacks Computer - Software industry’s gain of +43.8%. The company’s fiscal first-quarter 2024 results were driven by strong performance of Creative Cloud, Document Cloud and Adobe Experience Cloud segments.Further, rising subscription revenues and solid momentum across the mobile apps were positives. Growth in emerging markets, robust online video creation demand and solid adoption of Acrobat remain tailwinds. The company remains optimistic about its strong market position, compelling product lines, continued innovation, strategic acquisitions and solid adoption of cloud applications.Also, the company’s growing generative AI efforts are a major plus. However, the ongoing tensions between Russia and Ukraine remain headwinds for Digital Media segment. Also, high acquisition expenses do not bode well for its margin expansion.(You can read the full research report on Adobe here >>>)Other noteworthy reports we are featuring today include Advanced Micro Devices and AstraZeneca PLC.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAstraZeneca PLC (AZN) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAdobe Inc. (ADBE) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-18T11:50:00.000Z",
        "Title": "Here's How Much Stock Berkshire Hathaway Repurchased in the Past Year",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Warren Buffett has been very strategic when it comes to issuing or repurchasing Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock.\nIn 2010, for example, Berkshire issued billions of dollars in stock to fund the acquisition of railroad operator BNSF. It remains one of the only times Buffett decided to dilute shareholders. More recently, Berkshire has been buying back its own shares to the tune of billions of dollars each year. At times, the company has repurchased more than $7 billion in stock in a single quarter.\nDuring the past year, Berkshire has repurchased roughly $9 billion of its own stock. There are several reasons the company will likely repurchase even more shares in 2024 and beyond.\nWhy is Berkshire repurchasing so much stock? Part of its motivation is that the company has too much cash. The company currently sits on a record cash pile of nearly $168 billion. If it remains invested, that cash earns a relatively paltry return for shareholders. Repurchasing stock allows the company to put that cash to work in something it knows and understands extremely well.\nThe second reason Berkshire has been buying back stock -- and will likely continue to do so -- is that equity prices in general are relatively high. That's also likely the reason the company's cash balance is so high. There simply aren't many bargains left. The S&P 500, for example, currently has a price-to-earnings multiple of about 27.5, nearly 70% above its long-term average.\nThe final reason Berkshire will continue to repurchase shares is that its own stock isn't that expensive. It currently trades at a price-to-book ratio of 1.53, right in line with its long-term average. The company is sitting on huge sums of cash, and its own stock is a relative bargain compared to the market, so why not repurchase shares? That's exactly what the company has been doing; don't expect it to stop anytime soon.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $20,646!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $31,962!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $333,023!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of April 15, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nHere's How Much Stock Berkshire Hathaway Repurchased in the Past Year was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-30T22:58:02.000Z",
        "Title": "Charlie Munger Will Be Absent From Warren Buffett's Side Saturday: First Berkshire Hathaway Meeting Without The 'Architect'",
        "Author": "  Chris Katje ",
        "Text": "The annual Berkshire Hathaway (NYSE:BRK)(NYSE:BRK) shareholders meeting attracts thousands of people to Omaha annually to hear from legendary investor Warren Buffett.\nThe 2024 event will feel quite different for those in attendance, with Buffett missing his investing partner Charlie Munger.\nWhat Happened: Munger, the former Berkshire Hathaway vice chairman, passed away in November at the age of 99.\nFor the first time, the annual Berkshire Hathaway annual shareholders meeting held in Omaha, Nebraska won't feature Buffett with Munger by his side. The 2024 event takes place on Saturday, May 4.\nThe duo traditionally shared highlights of their portfolio and investment strategies and also provided valuable pieces of wisdom about finance and life to those in attendance.\nOne investor told The Wall Street Journal that things will be different Saturday for those in attendance.\n\"I feel like there's going to be a place in my heart missing when we don't see Charlie up there. Of course we'll adapt to it, but this first year especially it's going to be kind of like an empty-chair feeling,\" Lyle McIntosh said.\nBuffett has credited Munger with being the brains behind the company, and those in attendance will also remember the one-liners that the investor often had.\nMunger once said \"if you mix raisins with turds, they're still turds\" at the 2000 annual meeting when speaking about speculation in technology.\nWhile Munger won't be on stage with Buffett, other key Berkshire figures could play a more prominent role. Greg Abel, who runs the noninsurance operations for Berkshire, is next in line to Buffett's CEO role and will appear on stage. Insurance head Ajit Jain will also be featured at the event.\nRelated Link: Charlie Munger Shared A Three Word Piece Of Advice At A Dinner, How It Helped An Investor And Was Also Used By Warren Buffett\nWhy It's Important: Known as the \"Woodstock for Capitalists,\" the annual shareholders meeting has been attended by many investors for years and often attracts first timers who own shares of the popular conglomerate to the event in hopes of meeting and hearing from Buffett.\nMunger and Buffett worked together for decades and were often viewed as close friends or family by those who witnessed their interactions together. Buffett once said that he had never had an argument with Munger.\nIn February, Buffett shared a touching tribute to Munger in a letter to shareholders. Buffett called Munger the \"architect\" who worked behind the scenes of building up Berkshire Hathaway.\n\"In a way his relationship with me was part older brother, part loving father,\" Buffett said in the letter.\nBuffett praised Munger for his selfless advice during the early years of his leadership at Berkshire Hathaway.\n\"Charlie never sought to take credit for his role as creator but instead let me take the bows and receive the accolades.\"\nBRK-B Price Action: Berkshire Hathaway shares trade at $398.26 versus a 52-week trading range of $317.41 to $430.00. Shares of Berkshire Hathaway are up 20% in the last year.\nRead Next: Here’s How Much Warren Buffett Could Have Made Investing In Tesla\nPhoto: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Charlie Munger Will Be Absent From Warren Buffett's Side Saturday: First Berkshire Hathaway Meeting Without The 'Architect' originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-04-03T17:59:00.000Z",
        "Title": "Top Research Reports for Berkshire Hathaway, Procter & Gamble & Adobe",
        "Author": "  Sheraz Mian ",
        "Text": "Wednesday, April 3, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc. (BRK.B), The Procter & Gamble Company (PG) and Adobe Inc. (ADBE). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway shares have outperformed the Zacks Finance sector over the past year (+36.2% vs. +25.1%) as well as the broader S&P 500 index (+36.2% vs. +24.9%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Procter & Gamble have outperformed the Zacks Soap and Cleaning Materials industry over the past year (+9.6% vs. +8.2%). The company has been gaining from robust pricing and a favorable mix, along with strength across segments.It has been focused on productivity and cost-saving plans to boost margins. This led to bottom line beating the consensus mark for the sixth consecutive quarter in the second quarter of fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view.However, the company has been witnessing supply-chain issues, higher SG&A costs, higher transportation costs and rising inflation. Its significant international presence exposes it to foreign currency risks, which acts as a headwind.(You can read the full research report on Procter & Gamble here >>>)Adobe shares have gained +29.6% over the past year against the Zacks Computer - Software industry’s gain of +43.8%. The company’s fiscal first-quarter 2024 results were driven by strong performance of Creative Cloud, Document Cloud and Adobe Experience Cloud segments.Further, rising subscription revenues and solid momentum across the mobile apps were positives. Growth in emerging markets, robust online video creation demand and solid adoption of Acrobat remain tailwinds. The company remains optimistic about its strong market position, compelling product lines, continued innovation, strategic acquisitions and solid adoption of cloud applications.Also, the company’s growing generative AI efforts are a major plus. However, the ongoing tensions between Russia and Ukraine remain headwinds for Digital Media segment. Also, high acquisition expenses do not bode well for its margin expansion.(You can read the full research report on Adobe here >>>)Other noteworthy reports we are featuring today include Advanced Micro Devices, Inc. (AMD), AstraZeneca PLC (AZN) and QUALCOMM Incorporated (QCOM).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nSolid Insurance Business Aid Berkshire (BRK.B), Cat Loss Ail\nP&G's (PG) Productivity & Cost Savings Plan to Aid Margins\nAdobe (ADBE) Rides on Growing Adoption of Cloud Applications\nFeatured Reports\nRobust Product Portfolio & Partnerships Aid AMD's ProspectsPer the Zacks analyst, Advanced Micro Devices is benefiting from strong adoption of fourth gen EPYC processor. Moreover, alliances with Meta, Amazon and Oracle, bode well.\nKey Drugs Aid AstraZeneca (AZN) Sales; Pipeline StrongThe Zacks analyst says that AstraZeneca's key drugs like Lynparza, Tagrisso, Imfinzi, Ultomiris and Farxiga should drive sales. Its pipeline is strong with several phase III data readouts lined up.\nQualcomm (QCOM) Rides on 5G Traction, Healthy IoT MomentumPer the Zacks analyst, Qualcomm is likely to benefit from the seamless transition from a wireless communications firm for the mobile industry to a connected processor firm for the intelligent edge.\nAlibaba (BABA) Gains From International Commerce BusinessesPer the Zacks analyst, strength across AliExpress' Choice and cross-border-related value-added services is benefiting Alibaba's international commerce retail and wholesale businesses.\nStrategic Pacts Aids Walgreens (WBA) Amid Stiff RivalryThe Zacks analyst is impressed with Walgreens' partnership with TelePharm which expand its tele-pharmacy services and improve access to care. Yet, stiff rivalry remains a concern.\nSolid Lab Assets Demand Aid Healthpeak (DOC), High Rates AilPer the Zacks Analyst, solid demand for lab assets and rising healthcare expenditure by senior citizens bode well for Healthpeak. However, competition from peers and high interest rates are woes.\nH&R Block (HRB) Benefits From Block Horizons 2025 StrategyPer the Zacks analyst, Block Horizons is expected to help H&R Block deliver sustainable revenue and operating profit growth, improve return on investments, and maintain a strong liquidity position.\nNew Upgrades\nStrong Demand & Cost Optimization to Aid General Motors (GM)Per the Zacks analyst, General Motors' compelling EV and ICE portfolio, with strong demand for its quality full-size pickups and full-size SUVs, bodes well. A cost reduction program is also beneficial\nRobust Construction Activity & Acquisitions Aid EMCOR (EME)Per the Zacks analyst, EMCOR benefits from robust demand in key sectors like high-tech manufacturing, network & communications, industrial and healthcare. Also, focus on acquisitions bode well.\nMurphy USA (MUSA) Gains from Proximity to Walmart StoresThe Zacks analyst likes the proximity of Murphy USA's fuel stations to Walmart supercenters and the consistent traffic that these stores attract, thereby driving above-average fuel sales volume.\nNew Downgrades\nCompetition From Clean Fuel Sources Ail Arch Resources (ARCH)Per the Zacks analyst, Arch Resources' results are adversely impacted as emissions concerns push coal back in comparison with other clean fuel sources. Strict regulations also act as a headwind.\nADTRAN (ADTN) Plagued by Soft Demand in Network SolutionsPer the Zacks analyst, sluggish demand in the Network Solutions segment, macroeconomic challenges and fierce competition from other established players will likely strain ADTRAN's margin.\nElevated Expenses, High Leverage Concern First American (FAF)Per the Zacks analyst, First American's increase in higher personnel costs, operating expenses induces higher expenses that weigh on margin expansion. High leverage induces rise in interest expense.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAstraZeneca PLC (AZN) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAdobe Inc. (ADBE) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-17T10:15:00.000Z",
        "Title": "Billionaire Warren Buffett Recently Cut This Stock From Berkshire Hathaway's Portfolio. It Just Dropped 53% In 1 Day. Here's What Investors Need to Know.",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "Globe Life (NYSE: GL) stock plummeted by more than 53% in a single day last week after short-seller Fuzzy Panda Research accused the life insurance company of fraud. The claims piled onto the already struggling stock, which had previously been a longtime holding of Warren Buffett's conglomerate, Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B).\nIf you're thinking about buying the dip in the stock, there are some things you'll want to know.\nGlobe Life was one of Berkshire Hathaway's longest-held investments, having been part of the conglomerate's portfolio for more than two decades. Berkshire held Globe Life through several difficult economic periods, including the COVID-19 pandemic, which put tremendous pressure on life insurers by elevating claims costs.\nBuffett examines a management team's character and trustworthiness when investing. Buffett and his team have an excellent track record of evaluating management, which is a big reason for the conglomerate's long-term success. When Globe Life became the subject of several lawsuits accusing it of misconduct, Berkshire pulled the plug on its investment.\nLast year, two Globe Life subsidiaries, American Income Life Insurance Co. and Arias Agencies, faced a lawsuit accusing them of inappropriate workplace conduct; this included rampant drug use, sexual abuse, and degradation of agents who didn't hit sales targets.\nGlobe Life's struggles continued when a former executive claimed he was fired for blowing the whistle on \"potentially illegal\" sales practices at the subsidiary. It appears that the accusations were why Berkshire sold its stake in the insurer last year.\nFast-forward to this year, and Globe Life's troubles have gone from bad to worse. On March 6, the U.S. Department of Justice issued subpoenas to Globe Life and American Income Life. The subpoena is part of an investigation into allegations of fraud and misconduct at the (renamed) Arias Organization, now one of American Income Life's agencies.\nLast week, the dam broke after short-seller Fuzzy Panda Research accused Globe Life of \"extensive\" insurance fraud that was ignored by management. According to Breakout Point and reported by Bloomberg, Fuzzy Panda Research was the best-performing active short-seller in 2023. Although short-sellers -- investors who try to profit from falling share prices -- suffered deep losses during the long bull market of the 2010s, they can help expose harmful or downright fraudulent business practices.\nFuzzy Panda reviewed hundreds of court documents and interviewed former executives and agents \"who showed us where the fraud was hidden.\" According to the short-seller, the fraud was ignored by management despite being \"obvious and reported hundreds of times.\" After the short report was released, Globe Life's stock plummeted 53% in a single day.\nFollowing the serious accusations from Fuzzy Panda, Globe Life responded by saying:\nWe reviewed the report and found it to be wildly misleading, mixing anonymous allegations with recycled points pushed by plaintiff law firms to coerce Globe Life into settlements ... The short seller analysis by Fuzzy Panda Research mischaracterizes facts and uses unsubstantiated claims and conjecture to present an overall picture of Globe Life that is deliberately false, misleading and defamatory.\nAccording to The Fly, analysts believe the stock sell-off is overdone, but big question marks remain. Investment bank and investment firm Piper Sandler said that Globe Life's response \"serves to assuage concerns but does not completely remove the vacuum that remains absent a broader communication about this matter with the investment community.\"\nAnother investment firm, Evercore, meanwhile, sees limited downside from here but says there is still \"significant uncertainty for the shares.\"\nGlobe Life faces serious allegations, and the stock price reflects this. After its significant sell-off, aggressive investors may find the stock ripe for the picking. If you're willing to tolerate this risk, though, don't bet more than you're willing to lose.\nHowever, given the uncertainty around the situation and the Department of Justice's investigation, most investors are better off waiting to see how things shake out; they should avoid the stock for now.\nBefore you buy stock in Globe Life, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Globe Life wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of April 15, 2024\nCourtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBillionaire Warren Buffett Recently Cut This Stock From Berkshire Hathaway's Portfolio. It Just Dropped 53% In 1 Day. Here's What Investors Need to Know. was originally published by The Motley Fool\n"
    }
]