[
    {
        "Date": "2024-06-06T09:44:00.000Z",
        "Title": "4 Incredible Stocks Berkshire Hathaway Has Held for 13 Years or More",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "Warren Buffett is a legend on Wall Street. Since becoming CEO of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) in 1965, Buffett turned a failing textile business into one of the largest companies in the world today. His company has averaged 20% annualized returns since then, crushing the S&P 500's performance over the same period.\nOne key to Buffett's long-term success is his buy-and-hold approach to investing. He focuses on buying and holding high-quality businesses for a long time, ignoring short-term market fluctuations and allowing winning investments to compound over time. Here are four incredible stocks that Berkshire Hathaway has continuously held for 13 years or more.\nCompanies with strong brands tend to have good customer loyalty and the advantage of name recognition as compared to peers. American Express (NYSE: AXP) has one of the strongest brands, and when current CEO Stephen Squeri took over, Buffett told him, \"The most important thing about American Express is the brand and the customers that aspire to be associated with the brand.\"\nAmerican Express attracts many customers, but its focus on high-earning, high-spending customers makes it stand out.\nThe coveted Black Card is American Express' luxury spending card and reportedly requires between $500,000 to $1 million in annual spending to be invited. Meanwhile, its Platinum Card commands a $695 annual fee and appeals to high-spending consumers with expensive tastes. It offers perks and rewards from high-end travel providers, luxury hotels, airlines, and high-end clothing lines.\nAmerican Express' strong brand is why it can command higher processing fees than competitors. The company also earns fees from interest income for credit card loans its customers take out. In the first quarter, the company raked in $3.8 billion in net interest income, up 26% from the year before.\nMoody's (NYSE: MCO) is one of the largest credit rating agencies in the world, with a distinct competitive advantage of its own. It's the second-largest credit-rating agency in the U.S., holding a sizable 32% share of the total market. Only S&P Global's 50% share is larger.\nIt's difficult for new competitors to enter the credit-rating space. It takes companies time to build up a reputation as a trusted resource for assessing the creditworthiness of bonds and other instruments. Despite credit-rating agencies' role in the 2007-08 financial crisis, they've maintained their stronghold on the market as investors and large institutions are hesitant to trust newcomers.\nMoody's is a play on the U.S. economy and, more specifically, corporate debt issuance. In recent years, the company has struggled with low issuance volumes, especially from corporate borrowers. As a result, its adjusted operating revenue from its Moody's Investors Servies (MIS) segment fell 33% over two years.\nThis slowdown over the past few years has led to pent-up demand for debt issuance. The first quarter showed green shoots of potential new growth as issuance volumes rose and its MIS segment operating income grew 51%.\nVisa (NYSE: V) and Mastercard (NYSE: MA) are two businesses with incredible network effects, giving them a robust competitive advantage in the payments space. A couple of years ago, the two companies combined for $22.2 trillion in total volume through their networks, trouncing the next closest competitor, American Express, which had $1.5 trillion in total volume.\nTheir pivotal roles in the payments industry make Visa and Mastercard compelling investments. The two companies essentially hold a duopoly over competitors as the de facto card issuers that banks turn to.\nAs a result, they have incredible profit margins and cash flow. In the last year, Visa's free cash flow was $19.7 billion, with a profit margin of 54%, while Mastercard's free cash flow was $10.6 billion, with a profit margin of 46%.\nAccording to Allied Market Research, the global credit card payments market is projected to grow 8.8% annually through 2032. With their outsized role in the payments industry, Visa's and Mastercard's robust payment networks have them well-positioned for future growth.\nBefore you buy stock in American Express, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and American Express wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $713,416!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Courtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway, Mastercard, Moody's, S&P Global, and Visa. The Motley Fool recommends the following options: long January 2025 $370 calls on Mastercard and short January 2025 $380 calls on Mastercard. The Motley Fool has a disclosure policy.\n4 Incredible Stocks Berkshire Hathaway Has Held for 13 Years or More was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-06T10:11:00.000Z",
        "Title": "If You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today",
        "Author": "  Matt Frankel, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) is well-known for delivering incredible returns for investors in the 60 years since Warren Buffett took control of the company -- and for good reason. Since Buffett took over in 1964, Berkshire has delivered an unbelievable 4,384,748% total return for investors.\nThink about that for a minute. This means that a $10,000 investment in Berkshire at that time would be worth $438 million today. For comparison, a $10,000 investment in the S&P 500 over the same period would be worth $3.1 million -- still a respectable return, but not in the same ballpark.\nThat massive total-return figure makes an excellent statistic for writers like me to use. But the reality is that even most of the long-term investors reading this don't have a 60-year time horizon in mind. And let's face it -- very few people would have been interested in Berkshire Hathaway at the time (it was little more than a struggling textile company).\nWith that in mind, let's look at a more conceivable long-term investment time horizon -- 30 years. Let's say that you invested $1,000 in Berkshire Hathaway 30 years ago. At that point (1994), Warren Buffett had been in charge for four decades and Berkshire was already a massive success story.\nHowever, Berkshire has continued to deliver market-beating performance. A $10,000 investment 30 years ago in Berkshire Hathaway would be worth $377,000 today. That's a 12.8% annualized return -- still well above the long-term average of the S&P 500.\nThe point is that thinking you're \"late\" to an investment that has been a winner for decades is a faulty mindset. In simple terms, winners keep on winning. And Berkshire Hathaway is a great example of that.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $713,416!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nMatt Frankel has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIf You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-17T12:31:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Berkshire Hathaway, Eli Lilly, PepsiCo, Hovnanian and IDT",
        "Author": "  Zacks Equity Research ",
        "Text": "For Immediate Release\nChicago, IL – June 17, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Berkshire Hathaway Inc. (BRK.B), Eli Lilly Co. LLY and PepsiCo, Inc. PEP, Hovnanian Enterprises, Inc. HOV and IDT Corporation IDT.\nHere are highlights from Friday’s Analyst Blog:\nTop Stock Reports for Berkshire Hathaway, Eli Lilly and PepsiCo\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc., Eli Lilly and Co. and PepsiCo, Inc., as well as two micro-cap stocks Hovnanian Enterprises, Inc. and IDT Corporation. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today's research reports here >>>Berkshire Hathaway's shares were in line with the Zacks Insurance - Property and Casualty industry over the year-to-date period (+13.8% vs. +13.8%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Eli Lilly have outperformed the Zacks Large Cap Pharmaceuticals industry over the year-to-date period (+52.0% vs. +21.8%). The company boasts a solid portfolio of core drugs for diabetes, autoimmune diseases and cancer. Its revenue growth is being driven by higher demand for drugs like Mounjaro, Verzenio, Jardiance, Taltz and others.Eli Lilly's new tirzepatide medicines, diabetes drug Mounjaro and obesity medicine, Zepbound, are seeing exceptionally strong demand trends. Lilly has also launched some other new products like Omvoh and Jaypirca. Mounjaro, Zepbound and other new products are expected to drive Lilly's top line in 2024.Lilly is also making rapid pipeline progress in areas like obesity, diabetes and Alzheimer's. However, generic competition for some drugs, rising pricing pressure and challenges in meeting strong demand for incretin products like Zepbound and Mounjaro are some top-line headwinds.(You can read the full research report on Eli Lilly here >>>)PepsiCo's shares have underperformed the Zacks Beverages - Soft drinks industry over the year-to-date period (-2.4% vs. +2.2%). The company witnessed soft sales trends in the QFNA segment due to recent product recalls. Adverse currency rates also remain headwinds.Nevertheless, PepsiCo has been benefiting from strength and resilience in core categories, diversified portfolio, modernized supply chain, improved digital capabilities, flexible go-to-market distribution systems and robust consumer demand trends.Additionally, PEP's international business continues to hallmark its overall performance, delivering significant volume and organic revenue growth in the first quarter. These factors along with robust pricing aided PepsiCo's earnings and organic revenues first-quarter 2024. The company's productivity and cost-management initiatives bode well.(You can read the full research report on PepsiCo here >>>)Shares of Hovnanian have outperformed the Zacks Building Products - Home Builders industry over the past year (+54.5% vs. +34.2%). This microcap company with market capitalization of $920.57 million has substantially improved its financial health, reducing debt from $2.5 billion to under $1 billion as of the second quarter of fiscal 2024.Its aggressive growth in controlled lots, which rose 29% year over year to 36,841 at the end of the second quarter of fiscal 2024, and a planned community count increase of 5-10% by year-end will support revenue growth. The company targets niche markets like active adults and innovates in-home designs, ensuring solid sales potential.However, Hovnanian faces legal risks from litigation and regulatory challenges, especially in environmental issues. The competitive homebuilding market threatens market share and profitability, exacerbated by the dependency on volatile housing market conditions. A declining contract backlog could affect the company's profitability and growth.(You can read the full research report on Hovnanian here >>>)IDT's shares have outperformed the Zacks Diversified Communication Services industry over the past year (+38.6% vs. -9.4%). This microcap company with market capitalization of $929.95 million is innovating its B2B2X financial services and leveraging digital payments, enhancing operational efficiency with a notable rise in NRS EBITDA margin from 1% to 20%.DT's NRS segment reported $82 million in recurring revenues with a 30% year-over-year increase, driven by a suite of merchant services. The POS network grew 28% to 28,700 terminals, tapping into a TAM of 200,000 retailers. BOSS Money's remittance service saw a 42% revenue uptick, boosting the fintech space.Challenges include regulatory risks in fintech, reliance on volatile segments like Traditional Communications for cash flow, and intense competition in POS and remittance markets. Macroeconomic factors and one-time costs may impact profitability. Despite growth, concerns about expense management and the unpredictability of new investments could affect investor sentiment.(You can read the full research report on IDT here >>>)\nWhy Haven't You Looked at Zacks' Top Stocks? \nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com                        \nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nPepsiCo, Inc. (PEP) : Free Stock Analysis Report\nHovnanian Enterprises Inc (HOV) : Free Stock Analysis Report\nIDT Corporation (IDT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-24T14:11:30.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Investment in Coca-Cola Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 400 million shares of The Coca-Cola Company (NYSE:KO) stock, which is roughly 9.3% of the company. And it's a significant stake for Berkshire, representing approximately 6.5% of its portfolio.\nCoca-Cola is one of the world's leading beverage companies and it currently rewards its shareholders with a quarterly dividend of $0.485 per share, equating to an annual dividend of $1.94 per share. Let’s find out how much Berkshire will earn in dividends from its stake.\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk has reportedly bought 6,000 acres of land just outside of this city. Here’s how to invest in its growth before he floods it with new tech workers.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nSo...\nTrending: This real estate fund backed by Uber CEO Dara Khosrowshahi gives you instant access to a portfolio of rental properties, and you only need $100 to get started.\nBerkshire shares of Coca-Cola: 400,000,000\nCoca-Cola annual dividend per share: $1.94\nTotal Annual Dividend = 400,000,000 x 1.94\nResult: $776,000,000\nBerkshire Hathaway will receive $776 million in dividends from Coca-Cola this year based on its current dividend rate. This equates to $194 million quarterly, or about $2.13 million daily.\nThe income Berkshire earns from Coca-Cola aligns with Warren Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Coca-Cola has raised its annual dividend payment for 62 consecutive years, so Berkshire's annual income will likely grow in the years ahead.\nKeep Reading:\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nCOCA-COLA (KO): Free Stock Analysis Report\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Investment in Coca-Cola Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-07-01T12:17:00.000Z",
        "Title": "Berkshire Hathaway Specialty Insurance Expands to the Nordics, Names Regional and Product Line Leadership",
        "Author": "Business Wire ",
        "Text": "BOSTON & STOCKHOLM, July 01, 2024--(BUSINESS WIRE)--Berkshire Hathaway Specialty Insurance (BHSI) today announced that it has expanded its operations to the Nordic countries, opening an office in Stockholm, and naming Anna Green as Head of Nordics. BHSI has also appointed Karin Bryner as Head of Executive & Professional Lines and Anton Holmgren as Head of General Property, for the Nordics.\n\"Launching BHSI in the Nordics is an exciting continuation of BHSI’s steady global expansion. We will continue to expand our local team and capabilities, and look forward to bringing the certainty of BHSI’s financial strength, underwriting acumen, and CLAIMS IS OUR PRODUCT philosophy to customers and distribution partners throughout Sweden, Denmark, Norway, and Finland,\" said Andreas Krause, Head of DACH, BHSI.\nBeginning immediately, BHSI’s Nordic office is underwriting Executive & Professional Lines, General Property, Energy, and Construction.\n\"We look forward to building a strong team in the Nordics and bringing BHSI’s commitment to excellent technical underwriting and highly responsive service to the market. We have already had great response from brokers and customers,\" said Anna Green, Head of Nordics, BHSI.\nAnna Green takes the reins as Head of Nordics with industry experience spanning the Nordics, as well as Europe, the UK, and the Asia Pacific region. Anna started her insurance career more than 20 years ago and was most recently CEO of the Sweden Branch of another global insurer. Anna has deep expertise in Specialty and Environmental underwriting. She is based in Stockholm and can be reached at anna.green@bhspecialty.com.\nKarin Bryner comes to her role as Head of Executive & Professional Lines with more than 20 years of experience in financial lines underwriting, including more than a decade focused on Nordic risks. She was most recently Underwriting Manager, Financial Lines in Sweden, at another global insurer. She is based in Stockholm and can be reached at Karin.Bryner@bhspecialty.com.\nAnton Holmgren brings more than a decade of property underwriting experience to his role as Head of General Property. He has held increasingly senior underwriting roles over his career, including Nordic Head of Underwriting, Property, Engineering Lines & Marine, at another global insurer. He will be based in Stockholm and can be reached at Anton.holmgren@bhspecialty.com.\nBHSI’s new office in Sweden is located at:\nBrahegatan 10114 37 StockholmSweden\nIn Europe, Berkshire Hathaway Specialty Insurance (BHSI) trades under Berkshire Hathaway European Insurance DAC (BHEI) and Berkshire Hathaway International Insurance Limited (BHIIL). BHEI is an Irish domiciled Designated Activity Company, Registration Number 636883 and Registered Office at 2nd Floor, 7 Grand Canal Street Lower, Dublin D02 KW81. Berkshire Hathaway International Insurance Limited (BHIIL) is an incorporated England and Wales limited liability company, Registration Number 3230337 and Registered Office at 8 Fenchurch Place, 4th Floor, London EC3M 4AJ, United Kingdom. BHEI and BHIIL are affiliates of Berkshire Hathaway Specialty Insurance Company (BHSIC), a Nebraska USA domiciled corporation, which provides commercial property, casualty, healthcare professional liability, executive and professional lines, transactional liability, surety, marine, travel, programs, accident and health, medical stop loss, homeowners, and multinational insurance. BHSIC, BHIIL and BHEI are subsidiaries of Berkshire Hathaway's National Indemnity group of insurance companies, which hold financial strength ratings of A++ from AM Best and AA+ from Standard & Poor's. Based in Boston, Berkshire Hathaway Specialty Insurance has offices in Atlanta, Boston, Chicago, Columbia, Dallas, Houston, Indianapolis, Irvine, Los Angeles, New York, Plymouth Meeting, San Francisco, San Ramon, Seattle, Stevens Point, Adelaide, Auckland, Barcelona, Brisbane, Brussels, Cologne, Dubai, Dublin, Frankfurt, Hong Kong, Kuala Lumpur, London, Lyon, Macau, Madrid, Manchester, Melbourne, Milan, Munich, Paris, Perth, Singapore, Stockholm, Sydney, Toronto, and Zurich.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240630408644/en/\nContacts\nMEDIAJoAnn Lee / +1 617.936.2937\n"
    }
]