[
    {
        "Date": "2024-07-23T13:00:17.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK.B) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this company have returned +5.3%, compared to the Zacks S&P 500 composite's +2% change. During this period, the Zacks Insurance - Property and Casualty industry, which Berkshire Hathaway B falls in, has gained 4.8%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Berkshire Hathaway B is expected to post earnings of $5.10 per share, indicating a change of +10.4% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nThe consensus earnings estimate of $18.78 for the current fiscal year indicates a year-over-year change of +9.3%. This estimate has changed +0.4% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $19.38 indicates a change of +3.2% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed -1.2%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Berkshire Hathaway B.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Berkshire Hathaway B, the consensus sales estimate for the current quarter of $97.31 billion indicates a year-over-year change of +5.2%. For the current and next fiscal years, $368.44 billion and $374.39 billion estimates indicate +1.1% and +1.6% changes, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway B reported revenues of $89.87 billion in the last reported quarter, representing a year-over-year change of +5.2%. EPS of $5.19 for the same period compares with $3.69 a year ago.\nCompared to the Zacks Consensus Estimate of $81.03 billion, the reported revenues represent a surprise of +10.91%. The EPS surprise was +52.2%.\nOver the last four quarters, Berkshire Hathaway B surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-13T16:39:28.000Z",
        "Title": "Warren Buffett Eliminated This Stock From Berkshire's Portfolio Last Year. It Has Fallen 32% in the First Half of 2024.",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "Last year, Warren Buffett and his team at Berkshire Hathaway eliminated its stake in Globe Life (NYSE: GL), a stock that had been a part of its portfolio for over two decades. The company faced some serious legal issues last year and suffered a deep sell-off earlier this year when it was the subject of a short-seller report.\nSince the start of the year, Globe Life stock has plummeted 32.4%, according to data from S&P Global Market Intelligence. Here's what investors should know about the dip and what's next for Globe Life.\nLast year, storm clouds began to emerge over Globe Life when one of its subsidiaries, American Income Life Insurance Co. and Arias Agencies, faced a lawsuit accusing it of inappropriate workplace conduct, including rampant drug use, sexual abuse, and degradation of agents who didn't hit sales targets. Compounding its troubles were accusations from a former executive who said he was fired for blowing the whistle on \"potentially illegal\" sales practices.\nWarren Buffett, who emphasizes management's character and integrity, seemingly took the accusations quite seriously, and Berkshire sold its stake in the insurer last year. Although it wasn't a sizable position, it has long been a staple of Berkshire Hathaway's portfolio since 2001.\nInvestors seemed to shrug off the accusations as the calendar turned to 2024. Then, on March 6, the U.S. Department of Justice issued subpoenas to Globe Life and American Income Life as part of an investigation into allegations of fraud and misconduct at one of its top life insurance agencies.\nIn early April, Globe Life took another hit when short seller Fuzzy Panda Research accused the insurer of \"extensive\" insurance fraud that was ignored by management. The short seller interviewed former employees \"who showed us where the fraud was hidden\" and that the fraud was ignored by management despite being \"obvious and reported hundreds of times.\"\nGlobe Life has since recovered from its low of $39 per share since the short report was published, indicating that perhaps the sell-off was overdone. Today, the company is priced at a dirt cheap valuation of 8.2 times earnings.\nHowever, the company continues to face questions and received \"a preliminary, informal inquiry from the SEC\" in May to investigate the short sellers' claims. While it is not a formal investigation by the SEC, these issues pose a risk and will be an overhang for Globe Life's stock for the time being.\nBefore you buy stock in Globe Life, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Globe Life wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nCourtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWarren Buffett Eliminated This Stock From Berkshire's Portfolio Last Year. It Has Fallen 32% in the First Half of 2024. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-16T02:07:53.000Z",
        "Title": "Watch These Berkshire Hathaway Price Levels After Stock Closes at Record High",
        "Author": "  Timothy Smith ",
        "Text": "\nShares in Berkshire Hathaway closed at a record high on Monday, buoyed by gains in some of the conglomerate’s key holdings.\nThe stock broke out from a symmetrical triangle, a chart pattern that suggests a continuation of the current uptrend.\nThe measuring principle projects a near-term price target in the shares of $465, while a bars pattern projects a longer-term target of around $500.\nDuring retracements, Berkshire shares may find support around $415 from the symmetrical triangle's top trendline, and near a multi-month uptrend line at $390.\n\nShares in Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) closed at a record high on Monday, buoyed by gains in some of the conglomerate’s key holdings, including Apple (AAPL), American Express, (AXP), Chevron (CVX), and Occidental Petroleum (OXY). Investors typically view the performance of the company’s stock, which trades at about 23 times analysts' full-year operating profit projections, as a proxy for the health of the U.S. economy due to its diversification across a broad range of industries.\nBerkshire Hathaway shares added 2.4% to finish Monday's session at $434.42.\nAmid the stock’s move to record highs, we’ll take a closer look at the technicals on the Berkshire Hathaway weekly chart and identify important levels to watch out for.\nSince bottoming out midway between the 50- and 200-week moving averages (MAs) in early October last year. Berkshire shares have trended consistently higher. More recently, the price broke out from textbook symmetrical triangle, a chart pattern that indicates a continuation of the current uptrend.\nImportantly, the initial breakout from the pattern occurred on the highest weekly trading volume since late February, suggesting buying conviction behind the move. Moreover, the relative strength index (RSI) sits just below overbought levels to confirm strong price momentum in the stock.\nBelow, we’ll use two different technical analysis techniques to predict near-term and longer-term price targets. These levels help us determine a general area on the chart where Berkshire shares may climb to and encounter resistance if the price continues to trend higher.\nTo forecast a potential short-term price target, we can use the measuring principle. We do this by calculating the distance between the symmetrical triangle’s two trendlines near their widest point and apply that amount to the breakout area. For example, we add $50 to $415, which projects a target at $465\nInvestors can speculate a longer-term price target by using a chart overlay of prior price action. This works by taking the bars pattern from the uptrend that preceded the symmetrical triangle and applying it to the most recent swing low. In this case, we take the bullish bars pattern between October 2023 and February this year and align it with the April low, which indicates a possible upside target of around $500.\nInvestors looking for a key pullback level should keep an eye on the $415 area, where Berkshire shares would likely find buying interest near the symmetrical triangle’s top trendline. A more significant retracement could see the stock revisit a multi-month uptrend trendline around $390, with this location also sitting in close proximity to the 50-week MA.\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info.\nAs of the date this article was written, the author does not own any of the above securities.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-07-01T12:17:00.000Z",
        "Title": "Berkshire Hathaway Specialty Insurance Expands to the Nordics, Names Regional and Product Line Leadership",
        "Author": "Business Wire ",
        "Text": "BOSTON & STOCKHOLM, July 01, 2024--(BUSINESS WIRE)--Berkshire Hathaway Specialty Insurance (BHSI) today announced that it has expanded its operations to the Nordic countries, opening an office in Stockholm, and naming Anna Green as Head of Nordics. BHSI has also appointed Karin Bryner as Head of Executive & Professional Lines and Anton Holmgren as Head of General Property, for the Nordics.\n\"Launching BHSI in the Nordics is an exciting continuation of BHSI’s steady global expansion. We will continue to expand our local team and capabilities, and look forward to bringing the certainty of BHSI’s financial strength, underwriting acumen, and CLAIMS IS OUR PRODUCT philosophy to customers and distribution partners throughout Sweden, Denmark, Norway, and Finland,\" said Andreas Krause, Head of DACH, BHSI.\nBeginning immediately, BHSI’s Nordic office is underwriting Executive & Professional Lines, General Property, Energy, and Construction.\n\"We look forward to building a strong team in the Nordics and bringing BHSI’s commitment to excellent technical underwriting and highly responsive service to the market. We have already had great response from brokers and customers,\" said Anna Green, Head of Nordics, BHSI.\nAnna Green takes the reins as Head of Nordics with industry experience spanning the Nordics, as well as Europe, the UK, and the Asia Pacific region. Anna started her insurance career more than 20 years ago and was most recently CEO of the Sweden Branch of another global insurer. Anna has deep expertise in Specialty and Environmental underwriting. She is based in Stockholm and can be reached at anna.green@bhspecialty.com.\nKarin Bryner comes to her role as Head of Executive & Professional Lines with more than 20 years of experience in financial lines underwriting, including more than a decade focused on Nordic risks. She was most recently Underwriting Manager, Financial Lines in Sweden, at another global insurer. She is based in Stockholm and can be reached at Karin.Bryner@bhspecialty.com.\nAnton Holmgren brings more than a decade of property underwriting experience to his role as Head of General Property. He has held increasingly senior underwriting roles over his career, including Nordic Head of Underwriting, Property, Engineering Lines & Marine, at another global insurer. He will be based in Stockholm and can be reached at Anton.holmgren@bhspecialty.com.\nBHSI’s new office in Sweden is located at:\nBrahegatan 10114 37 StockholmSweden\nIn Europe, Berkshire Hathaway Specialty Insurance (BHSI) trades under Berkshire Hathaway European Insurance DAC (BHEI) and Berkshire Hathaway International Insurance Limited (BHIIL). BHEI is an Irish domiciled Designated Activity Company, Registration Number 636883 and Registered Office at 2nd Floor, 7 Grand Canal Street Lower, Dublin D02 KW81. Berkshire Hathaway International Insurance Limited (BHIIL) is an incorporated England and Wales limited liability company, Registration Number 3230337 and Registered Office at 8 Fenchurch Place, 4th Floor, London EC3M 4AJ, United Kingdom. BHEI and BHIIL are affiliates of Berkshire Hathaway Specialty Insurance Company (BHSIC), a Nebraska USA domiciled corporation, which provides commercial property, casualty, healthcare professional liability, executive and professional lines, transactional liability, surety, marine, travel, programs, accident and health, medical stop loss, homeowners, and multinational insurance. BHSIC, BHIIL and BHEI are subsidiaries of Berkshire Hathaway's National Indemnity group of insurance companies, which hold financial strength ratings of A++ from AM Best and AA+ from Standard & Poor's. Based in Boston, Berkshire Hathaway Specialty Insurance has offices in Atlanta, Boston, Chicago, Columbia, Dallas, Houston, Indianapolis, Irvine, Los Angeles, New York, Plymouth Meeting, San Francisco, San Ramon, Seattle, Stevens Point, Adelaide, Auckland, Barcelona, Brisbane, Brussels, Cologne, Dubai, Dublin, Frankfurt, Hong Kong, Kuala Lumpur, London, Lyon, Macau, Madrid, Manchester, Melbourne, Milan, Munich, Paris, Perth, Singapore, Stockholm, Sydney, Toronto, and Zurich.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240630408644/en/\nContacts\nMEDIAJoAnn Lee / +1 617.936.2937\n"
    },
    {
        "Date": "2024-07-09T17:44:53.000Z",
        "Title": "How Much Berkshire Hathaway Stock Does the Gates Foundation Own?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Judging by the disclosed holdings in the Gates Foundation (formerly called the Bill and Melinda Gates Foundation Trust), one would think that billionaire Bill Gates is a big fan of Warren Buffett. According to its latest 13F filing, the foundation run by Gates owns a huge amount of Buffett's holding company, Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B).\nRight now, the largest stock position in the $46 billion trust's publicly disclosed portfolio is Microsoft. Gates co-founded Microsoft back in 1975 and in 2010 he committed to donating his entire stake in Microsoft to charity by the time he died. As a result, much of the foundation's holdings in Microsoft came from Gates' donations over the years. Today, the trust's stake in Microsoft is valued at around $15.4 billion.\nBerkshire Hathaway, meanwhile, is the third-largest position in the trust's portfolio at around $7.3 billion. Most of those Berkshire shares were donated to the foundation by Buffett.\nAfter Gates committed to donating the majority of his wealth to charity more than a decade ago, Buffett immediately joined him in making a similar pledge. A trust was launched in 2000 and was initially run by Gates, his now ex-wife Melinda French Gates, and Buffett. Together, the trio convinced dozens of other billionaires to also donate the majority of their wealth to various charitable causes. Buffett served as a member of the foundation's board until June 2021. Melinda Gates resigned from the board effective June 2024. Since 2021, Buffett started donating portions of his Berkshire stock to other charitable trusts instead, including trusts run by his three children.\nWhile Berkshire Hathaway stock trades at all-time highs, the foundation's stake has shrunk in recent quarters (the sale is partly related to stipulations for how the donated stock must be used by the trust). Last quarter, for example, it trimmed its stake by 2.6 million shares -- a reduction of around 13%. However, don't expect it to disappear from the portfolio completely anytime soon. There are still plenty of funds left to utilize for charitable causes.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $785,556!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nHow Much Berkshire Hathaway Stock Does the Gates Foundation Own? was originally published by The Motley Fool\n"
    }
]