[
    {
        "Date": "2024-08-05T12:39:22.000Z",
        "Title": "Berkshire Hathaway Added 26 Million Shares of This Stock in the Past 3 Quarters: Here's Why It's a Smart Buy Today",
        "Author": "  Courtney Carlsen ",
        "Text": "Since becoming CEO at Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) in 1965, Warren Buffett has delivered 19.8% compound annual returns to investors, or enough to turn a $100 investment into $4.4 million today. Buffett's extended track record of success is one reason investors eagerly await the release of Berkshire's quarterly report showing the stocks the conglomerate bought and sold during the quarter.\nOver the past three quarters, Berkshire Hathaway has bought shares of Chubb (NYSE: CB) stock hand over fist and kept its buying confidential for two quarters. Berkshire owns 26 million shares of the insurer as of March 31, worth roughly $7.2 billion today. Here's why Chubb is a smart buy for investors today.\nBuffett loves the insurance industry, going back to his days as a student at Columbia Business School. At the time, Buffett learned under Benjamin Graham, who invested in GEICO in 1948. It was one of the best-performing assets during Graham's career.\nWhen Buffett acquired Berkshire Hathaway in 1965, it was a failing textile company that was barely staying afloat. In 1967, Berkshire acquired the insurer National Indemnity, which Buffett credits as a turning point in Berkshire Hathaway's history.\nInsurance companies' cash flows make them appealing investments, which is why Buffett continues to invest heavily in them. A few years ago, Berkshire Hathaway acquired Alleghany for $11.6 billion, adding to its list of insurance companies owned by Berkshire Hathaway, including GEICO, National Indemnity, Berkshire Hathaway Primary Group, and Berkshire Hathaway Reinsurance Group.\nChubb is one of the world's largest property and casualty insurance companies and underwrites various policies, including personal automotive, homeowners, accident and health, agriculture, and reinsurance.\nThe company has an excellent risk management history, which you can observe by its combined ratio. This essential insurance metric is the sum of claims costs (how much an insurance company pays out on a policy) and expenses (like employee compensation or fixed overhead) divided by the premiums the company collects.\nOver the past two decades, Chubb's average combined ratio was 90.8%, well below the industry average of 100%. This matters because it translates into free cash flow, which the company uses to pay dividends, buy back shares, or invest in things like bonds and stocks. Chubb's solid growth is why it has raised its dividend payout for 31 consecutive years.\nAnother benefit of investing in insurance is the timing of cash flows. Insurers collect premiums upfront and pay out claims down the road. In the time between, the company can invest this money, known as \"float,\" usually in short-term Treasury bills. As policies expire, companies keep their profits and can build an extensive investment portfolio over time.\nChubb has a $113 billion investment portfolio primarily invested in fixed-income securities. Last year, it earned $4.9 billion in investment income, up 32% year over year, and its yield on average invested assets improved from 3.4% to 4.2% as it benefited from rising interest rates. Through the first six months of 2024, Chubb's net investment income has increased another 27% from last year.\nThe Federal Reserve is projected to cut interest rates sometime this year and into next, which could negatively impact Chubb's investment portfolio in the short term. However, some longtime market participants think interest rates could stay elevated.\nFor example, Howard Marks of Oaktree Capital Management has described a \"sea change,\" saying, \"For various reasons, the Fed is not going to go back to the ultra-low interest rates over the last 13 years\" in a 2023 interview on the Motley Fool Money podcast. If that's the case, insurers like Chubb will benefit by earning more interest income than was possible in the decade and a half prior.\nJPMorgan Chase CEO Jamie Dimon also cautioned that \"there are still multiple inflationary forces in front of us\" due to fiscal deficits, rising interest rates, and stubbornly high inflation. Chubb is already a solid company to own, and if inflationary pressures persist, it has the pricing power to adapt to rising costs, giving it stellar potential for the next decade and beyond.\nBefore you buy stock in Chubb, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chubb wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $657,306!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 29, 2024\nJPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Courtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and JPMorgan Chase. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Added 26 Million Shares of This Stock in the Past 3 Quarters: Here's Why It's a Smart Buy Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-08-26T08:15:00.000Z",
        "Title": "Warren Buffett Has 52.6% of Berkshire Hathaway's $312 Billion Portfolio Invested in 3 Phenomenal Stocks",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "Warren Buffett is one of the smartest investors around and has been for decades. As CEO of Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), Buffett offers tons of investment advice and commentary in his annual letters to shareholders and at the conglomerate's annual shareholders meeting in Omaha, Nebraska.\nBuffett's advice tends to be straightforward, but one topic that he can sound contradictory on is diversification. He's a staunch advocate of most investors sticking with S&P 500 index funds. He has even directed the executor of his estate to invest 90% of the money he leaves to his wife in an S&P 500 index fund after he passes. Such funds offer a diverse portfolio of stocks representing numerous industries.\nAnd yet, Berkshire Hathaway's $312 billion investment portfolio is heavily concentrated in just a few stocks. Its top three holdings account for nearly 53% of the portfolio's value. On that point, Buffett makes a great analogy: \"If you have LeBron James on your team, don't take him out of the game just to make room for someone else. ... It's crazy to put money into your 20th choice rather than your first choice.\"\nHere are Buffett's top three choices right now, which combined account for the majority of Berkshire's investment portfolio.\nApple (NASDAQ: AAPL) has long been one of Berkshire Hathaway's largest equity holdings. Not only did Buffett spend an estimated $37 billion acquiring a stake in Apple from 2016 through 2018, but the stock has appreciated greatly since then.\nAt one point, it accounted for more than 50% of Berkshire's equity portfolio. Buffett called Apple \"a better business than any we own,\" referencing Berkshire's portfolio of wholly owned companies like Geico and See's Candies. Recently, Buffett trimmed the position over the last three quarters, including a massive sale of nearly half of Berkshire's remaining stake in the second quarter. Still, Apple remains Berkshire's largest equity holding by far, and Buffett expects it to remain the largest position in its portfolio for the foreseeable future.\nThere's a lot to like about Apple. The company's ecosystem of hardware and services provides stable revenue as customers generally remain extremely loyal to the brand. Its services business provides a nice area of high-margin revenue growth for the business while the stalwart iPhone ensures that cash flow remains high. Significant share buybacks give an additional boost to its earnings per share every year. And when a new growth catalyst comes along, like the potential for a surge in iPhone upgrade rates due to the pending debut of new AI features, it provides a significant bump in earnings.\nAt its current price, the stock trades for around 30 times forward earnings. That's a premium to the S&P 500, but the stock is arguably worth it as significant cash on its balance sheet and robust share buybacks support strong returns for shareholders.\nBuffett, through Berkshire, acquired a substantial stake in American Express (NYSE: AXP) in the mid-1990s, and he hasn't done much with the position since. It's a true buy-and-hold story.\nBuffett pointed to the value of his investment in Amex during his 2022 letter to shareholders. The annual dividends paid on Berkshire's original $1.3 billion total investment in the stock climbed from $41 million in 1995 to $302 million that year. More importantly, the stock has grown in step with Berkshire Hathaway, and even faster over the past year and a half. In his 2023 letter to shareholders, he said Berkshire's share of Amex's earnings from the prior year exceeded the $1.3 billion originally invested two decades ago.\nOn the subject of American Express, he said, the lesson is clear: \"When you find a truly wonderful business, stick with it. Patience pays.\" Indeed, Berkshire's Amex position is now worth about $37.5 billion.\nWhat separates American Express from other credit card networks is that it issues the cards as well as manages the payment network. That allows it to retain greater control and capture a greater share of the economics of card transactions. That business has treated it extremely well as more and more transactions move from cash to digital payment tools like credit cards. Amex is quickly expanding its network, particularly internationally, where it lags behind its largest rivals, enhancing the network effect of the business.\nMore recently, Amex has turned to lending as a growth opportunity. Historically, it required charge card balances to be paid in full every month, but now, some of its cards permit users to carry a balance. Its net interest income grew 20% year over year in the second quarter, accounting for 23% of net revenue.\nIt has also driven revenue growth by increasing its card fees, while still maintaining its popularity with high-value, high-income consumers. That provides additional protection for Amex against economic slowdowns relative to other card issuers and payment networks.\nShares currently trade near an all-time high, but with a forward P/E ratio of 19, the stock still presents good value.\nAnother financial stock sitting near the top of Buffett's roster of all-stars, Bank of America (NYSE: BAC) was a more recent addition to the portfolio. Berkshire Hathaway first acquired preferred shares in the bank in 2011, plowing $5 billion into it -- a highly public vote of confidence in the bank at a time when investor sentiment toward it had soured in the wake of the mortgage crisis. Along with the 5% dividend paid by the preferred shares, Buffett received warrants to buy 700 million shares of BofA's common stock anytime over the next decade for $7.14 each.\nIn 2017, Buffett exercised those warrants because Bank of America raised its quarterly dividend to $0.12 per share, meaning that Berkshire could get more in dividends from the common stock than the preferred shares. So he sold the preferred stock to cover his common stock purchase. Buffett went on to add to the position over the next few years.\nRecently though, Berkshire trimmed about 12% of its stake in BofA. The reason was likely the same as the one behind the Apple stock sale. Berkshire currently benefits from favorable corporate tax policies that are set to expire at the end of 2025. It's sitting on massive gains from its common stock shares of BofA, which currently trade around $38.50.\nBank of America struggled during 2022 and 2023 as the Federal Reserve hiked benchmark U.S. interest rates to curb surging inflation. It held a relatively high amount of long-duration bonds on its balance sheet that lost value on paper as those interest rates climbed. That led to a decline in BofA's net interest income as it had to pay higher interest rates on customers' deposits while collecting lower interest rates from pre-2022 bonds. But the worst appears to be behind BofA as interest rate cuts appear to be on the horizon. Management believes that its net interest income reached the bottom of its trough in the second quarter.\nShares currently trade for 1.5 times tangible book value, which is a fair price to pay even as earnings remain under pressure from interest rates. While Buffett sold some Bank of America shares recently, a 12% cut in Berkshire's stake shouldn't be viewed as signaling that anything is wrong with the business.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $792,725!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of August 22, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Adam Levy has positions in Apple. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWarren Buffett Has 52.6% of Berkshire Hathaway's $312 Billion Portfolio Invested in 3 Phenomenal Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-08-06T06:25:51.000Z",
        "Title": "Berkshire Hathaway Stock (NYSE:BRK.B): Don’t Panic Following Halving of Apple Stake",
        "Author": "  TipRanks ",
        "Text": "Warren Buffett’s conglomerate Berkshire Hathaway ($BRK.B) may have shocked some over the weekend when it was disclosed that it had cut its massive Apple (AAPL) stake in half as it released its latest round of quarterly earnings results. With a massive cash mountain that’s since grown to be even more towering, there are many unanswered questions when it comes to Berkshire, Apple, and the road ahead. Despite the giant question marks, I remain bullish on Berkshire Hathaway stock.\nAs you’d expect, the news sent shares of Berkshire and Apple nosediving on Monday (down 3.4% and 4.8%, respectively), a move exacerbated by Monday’s blow-up in the Japanese stock market. Despite the volatility spike, investors likely have nothing to panic over as Berkshire raises more cash that it’ll likely deploy once it finally sees better opportunities.\nBerkshire’s swelling cash pile (currently at a record $277 billion) and continued prudence make shares an even better defensive bet, in my humble opinion. To some, Berkshire’s record pile of cash is a “problem.” Sure, not being able to find opportunities to score a solid return relative to the risk is a problem.\nHowever, I’m sure you’d agree that it’s far less of a problem than being caught fully invested in the face of a painful stock market correction or crash without enough dry powder to take advantage of the bargains to be had on the way down.\nIn any case, Berkshire already had ample financial firepower before it sold off its latest chunk of AAPL shares. Further, some investors may be inclined to wonder if the magnitude of the recent Apple share sale is a red flag that the broader stock market is looking at a serious drawdown going into year’s end. Though it’s impossible to tell what Buffett is thinking in real-time, I think many investors are overreacting (maybe even panicking) in the heat of the moment.\nThe latest slate of tech earnings has been worrisome, as has negative momentum in the Nasdaq 100 (NDX) and the latest wave of fear rippling from Japan. And while the latest round of AAPL stock selling may be far more sizeable than many may have expected, the Oracle of Omaha already had a chance to address the Apple questions during Berkshire’s 2024 shareholder meeting.\nWarren Buffett (and the late Charlie Munger) have had nothing but good things to say about the iPhone maker. Heck, at the latest Berkshire Hathaway annual shareholders meeting, Buffett went as far as to say that Apple “is an even better business” than some of the other “wonderful” holdings in the Berkshire stock portfolio, as Apple CEO Tim Cook watched the meeting from special seats close to the front.\nThough the latest round of selling is a heck of a lot larger than the first sale made earlier this year (back then, Berkshire trimmed just 13% of its Apple stake), investors probably shouldn’t treat the paring as a sign that Apple is no longer a wonderful business. They shouldn’t assume that its Apple Intelligence product will fail to hit the mark or that the market is dancing on a knife’s edge. In fact, Buffett mentioned tax considerations as a reason for taking profits on a portion of Berkshire’s Apple stake.\nSome may be inclined to think it’s more than just taxes, given how massive the latest round of selling has been. However, I’d argue that the taxation reasoning still makes sense.\nWith recent chatter from the Biden administration pointing to the potential for capital gains taxes to go up in the U.S. (to a proposed 44.6% rate, which is even higher than Canada’s recent hike to 33%) for the wealthy, taking profits well ahead of time seems smart. Should Kamala Harris win the U.S. presidential election, the window to book gains at the old rate may close, perhaps sooner than expected.\nIn any case, there’s nothing stopping Berkshire from having their cake and eating it, too, by selling Apple here and buying back at a later date. By selling before any capital gains tax hike has a remote chance of happening, Buffett won’t have to risk taking as large a hit to the chin by selling later.\nFurther, nothing is stopping Berkshire from buying back into Apple at a later date, perhaps after the stock trades at more reasonable valuations. After the Apple Intelligence-driven rally, AAPL stock traded at close to 34 times trailing price-to-earnings (P/E), the highest the multiple had been in recent memory. Indeed, Apple had become historically expensive, as the AI hype drove shares above $230 per share.\nEven with the latest round of selling, Apple remains the largest holding in the Berkshire stock portfolio, comprising around 28.4% of it at the time of writing. That’s still a massive stake that allows Berkshire to continue riding the firm higher as it moves into the age of generative AI.\nArguably, having one stock comprise nearly 30% of the portfolio is still excessive, given that Berkshire shareholders have expressed their concerns to Buffett at previous shareholder meetings over the company’s heavy concentration in Apple.\nOn TipRanks, BRK.B stock comes in as a Moderate Buy. Out of three analyst ratings, there are two Buys and one Hold recommendation. The average BRK.B stock price target is $462.33, implying upside potential of 11.8%. Analyst price targets range from a low of $450.00 per share to a high of $472.00 per share.\nSee more BRK.B analyst ratings\nBerkshire Hathaway may have alarmed some with the magnitude of its latest Apple stake paring. Despite the size of the sales, I view Buffett’s previous taxation explanation as still sound.\nAdditionally, with AAPL stock still trading at the high end of its range, I’d argue it’s only prudent to play with the house’s money at this juncture. Finally, such a big sale also reduces Berkshire’s single-stock risk, something that had been brought up by Berkshire shareholders in the past.\nSo, if you’re not overinvested in Apple, have no shareholders to appease, and won’t be affected by changes to tax policy, I’d argue it makes very little sense to follow Buffett and Berkshire by dumping AAPL stock, especially now that a chunk of the Warren Buffett premium was wiped off AAPL stock during Monday’s session. If you really want to follow Buffett’s style, buying Berkshire stock on the dip seems like a far better idea.\nDisclosure\n"
    },
    {
        "Date": "2024-08-06T13:36:37.000Z",
        "Title": "Elon Musk Says Warren Buffett Is 'Clearly Expecting A Correction' After Berkshire Sold Nearly Half Of Its Apple Stock",
        "Author": "  Ananya Gairola ",
        "Text": "Tesla Inc. (NASDAQ:TSLA) and SpaceX CEO Elon Musk has commented on Warren Buffett-led Berkshire Hathaway, Inc.‘s (NYSE:BRK) (NYSE:BRK) decision to sell about half its stake in Apple Inc. (NASDAQ:AAPL).\nWhat Happened: Over the weekend, a user on X, formerly Twitter, shared the news of Berkshire accumulating a cash reserve of almost $277 billion on the platform.\nDon't Miss:\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today.\nAmid the ongoing EV revolution, previously overlooked low-income communities now harbor a huge investment opportunity at just $500.\nDon’t miss out on the next Nvidia – you can invest in the future of AI for only $10.\nThe user humorously suggested that Buffett could make daring, all-in investments with this cash reserve, and acquire any of these companies: Netflix, Salesforce, Toyota, Adobe, and Hermes.\nIn response to the user, Musk said, “He [Buffett] is clearly expecting a correction of some kind or otherwise simply cannot see better investments than Treasury bills.”\nThe tech mogul also criticized the Federal Reserve for not lowering interest rates, suggesting that the current rates are too high.\nTrending: Elon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. Investing in its booming real estate market has never been more accessible.\n“The Fed needs to drop rates. They have been foolish not to have done so already,” he stated.\n\nWhy It Matters: Circuit breakers were triggered for Japan's TOPIX index, halting trading as the index dropped over 6%, leading to urgent stabilization measures on Sunday night.\nThe broader Asia-Pacific region saw declines, with the MSCI AC Asia Pacific Index falling 2%, Japan's Nikkei 225 plummeting 5.60%, and South Korea's KOSPI index dropping 4%.\nSee Also: Here’s the AI-powered startup that turns traders into influencers achieving 12% monthly growth – invest in it at only 10 cents per share.\nThis continued a trend from Friday, when Japan's Nikkei 225 and TOPIX both fell over 5% and 6%, respectively. In the U.S., markets faced significant losses on Friday due to a weaker-than-expected July jobs report, with the Nasdaq dropping over 10%, and the S&P 500 and Dow decreasing by 5.7% and 3.9%, respectively. At the time of writing, Dow Jones Industrial Average futures fell by 0.81%, while S&P 500 and Nasdaq-100 futures dipped 1.43% and 2.4%.\nNotably, Berkshire Hathaway’s second-quarter net earnings fell year-over-year due to a decline in investment gains, despite an increase in operating earnings. The company continued to offload its stake in Apple during this period.\nSee Also: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nIn the second quarter, net earnings experienced a 15.50% decline year-over-year, dropping from $35.91 billion to $30.35 billion. On the other hand, operating earnings—reflecting income from the company’s portfolio entities—increased by 15.48%, reaching $11.60 billion.\nGains from the investment portfolio saw a significant decrease of 27.52%, falling to $18.75 billion.\nMeanwhile, Berkshire’s swelling cash position has also led to speculation on social media about potential investments, with some Tesla fans hoping that Buffett would invest in the electric vehicle maker’s stock.\nRead Next: \nThis city is the clear winner of Zillow's 2024 Home Value Forecast — No surprise as the number of millionaires there grew by 75% in the last decade.\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Elon Musk Says Warren Buffett Is 'Clearly Expecting A Correction' After Berkshire Sold Nearly Half Of Its Apple Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-08-13T19:26:28.000Z",
        "Title": "Is Berkshire Hathaway Inc. (BRK-B) the Best Homeowner’s Insurance Stock To Buy?",
        "Author": "  Ramish Cheema ",
        "Text": "We recently published a piece titled Homeowner’s Insurance Rates Skyrocketing: 10 Best Stocks To Buy. In this article we are going to take a look at where Berkshire Hathaway Inc. (NYSE:BRK-B) stands against the other homeowner's insurance stocks.\nInsurance is one of Warren Buffett’s favorite businesses. So much insurance is the single largest revenue contributor to Buffett’s firm, Berkshire Hathaway. Its first quarter SEC filings show that Berkshire earned $89.8 billion in revenue during Q1 2024, out of which its insurance underwriting and investment income accounted for 27% or $24.6 billion in revenue.\nSeems like insurance is quite a lucrative business, and even though it sounds boring, insurance is also one of the most dynamic businesses in today’s environment. This is because of climate change, which has led to a growing number of floods, tornadoes, and hurricanes in the US. In fact, climate change along with a slew of other reasons has led to soaring home insurance costs since the coronavirus pandemic, according to data from the Insurance Information Institute. Between 2020 and 2022, replacement costs for homeowners insurance have soared by 55% because of increasing natural disasters and high inflation which has made construction materials expensive. In fact, cumulative insured losses from hurricanes and convective storms sat below $500 (in 2024 dollars) in 1990. As of 2023 end, these had jumped to $5,984 and $5,761, respectively.\nThese rising costs have also hit the home insurance industry hard. Insurance companies’ profitability is measured through the combined ratio, which is the sum of an insurer’s costs and payouts divided by the premiums collected. Naturally, a value below 100 reflects profitability, and from 2020 to 2023, the net combined ratio which also accounts for reinsurance sat at 107.3%, 103.4%, 104.7%, and 110.9% for each of the years, respectively. The value for 2023 was the worst since 2011, and it came at a time when home insurers increased their premiums by 12% – for the highest increase in 15 years. Since 2012 and 2021, the average premiums have grown by $1,034 to $1,411.\nWhile these rising home insurance premiums reflect the higher cost of doing business, the real picture is more complicated. Like inflation, where prices always go up and never come down, the same is the case for insurance premiums as well. While insurance premiums rose in the Gulf Area during Katrina, costs were at least $55 billion, and at least nine insurers went bankrupt, business was booming the year after in 2006. In 2006, home insurers bathed in profits, with data from A.M. Best outlining that the property and casualty industry raked in $68 billion for a 39% annual growth. For some, like the 21st largest insurance company in the US by assets, their profits were a record high (it earned $5 billion). The same firm had an earnings per share of $50 early during the coronavirus pandemic and then it became a loss making entity in 2022. Naturally, regulators allowed it to increase its prices by 30%, 20%, and 14.6% in California, New Jersey, and New York. Now, Wall Street has penciled in an earnings per share of $15 for this insurance company in 2024 and expects it to grow to more than $20 in the next couple of years.\nFast forwarding to the current day, the effects of climate change and inflation can even translate into higher home prices. After fires raged through California last year, several home insurance companies stopped taking new policies. This leads to higher premiums and ends up affecting home buyers hard since they factor in the insurance cost at the end of their buying decision. And while homeowner and home buying costs might rise due to the tighter insurance market, the industry continued to struggle in 2023.\nA.M. Best’s latest data reveals that 2023 was the worst year for the homeowner’s insurance industry for the worst loss this century. The sector suffered from a whopping $15.2 billion underwriting loss last year, and the rating agency didn’t mince its words when it simply stated that the reason behind the losses is simply a higher number of Americans moving to the disaster prone areas of the South and the West. A.M. Best outlines that while the US population grew by 7.4% between 2010 and 2020, the population in the South and the West jumped by 10.2% and 9.2%, respectively. The scale of these losses meant that in 2023, the combined ratio for homeowner insurance was higher than 100 in 17 American states. If you thought that these troubles were temporary, A.M. Best was also careful to mention that “a return to underwriting profitability for the segment over the near term is unlikely.”\nThe next question to ask when analyzing the state of the home insurance industry in the US in 2024 is, which states are experiencing the most trouble? On this front, the New York Times provides some insight. Its research shows that instead of 17, 18 American states had a combined ratio greater than 100 last year. Leading the pack was Hawaii, which is unsurprising given that the claims from historic wildfire losses exceeded a whopping $3.3 billion – for another instance of climate related disasters disrupting the insurance industry. After Hawaii, one of the worst performing regions was Arkansas. The Bear State is notable not only for its combined ratio being greater than 100 in 2023 but also for having a near similar ratio in 2022. Severe weather events, including tornadoes, are also a key reason for the struggles that the Arkansas insurance industry is facing.\nCombining the difficulties that home insurance companies are facing with the shifting weather patterns, it’s also relevant to check whether the same states that give insurers trouble are also witnessing an increase in homeowner insurance costs. According to data from Insurify, not only have homeowners insurance premiums jumped by 20% over the past two years to sit at $2,377 annually on average, but they will grow by an added 6% this year. Within this growth, Louisiana is expected to lead the pack and see its premiums jump by an eye watering 23% this year.\nSo, as home insurance faces a changing climate (figuratively and literally) we decided to see which home insurance stocks are finding favor from analysts.\nFor our list of the best home insurance stocks, we ranked property and casualty, diversified, and specialty home insurance companies by the number of hedge funds that had bought their shares in Q1 2024. The specialty and diversified firms were chosen to ensure completeness, and each firm was analyzed to ensure that it offered home insurance.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA team of insurance professionals in a boardroom overlooking a city skyline.\nNumber of Hedge Fund Investors  in Q1 2024: 119 Berkshire Hathaway Inc. (NYSE:BRK-B) is the multi billion dollar investment firm owned by Warren Buffett. It earned $24.6 billion in insurance revenue during Q1 2024.  Berkshire Hathaway Inc. (NYSE:BRK-B) operates in homeowner insurance primarily through its GEICO business. GEICO is the firm’s biggest insurance business, and Buffett bought it in 1996. It has been in the business for 86 years, and due to its parent Berkshire Hathaway Inc. (NYSE:BRK-B), GEICO benefits from more than $200 billion of cash and short term investments that can help it during the time of crisis. Since Buffett also invests through Berkshire Hathaway Inc. (NYSE:BRK-B), his insurance companies benefit from a unique business model that generates a substantial amount of cash and provides financial backing. Its homeowners insurance business depends on part on the larger auto insurance business since GEICO focuses on offering homeowner policies to its existing auto insurance customers. Vitava Fund mentioned Berkshire Hathaway Inc. (NYSE:BRK-B) in its Q4 2023 investor letter. Here is what the firm said:\n“Berkshire Hathaway continues to be a very unique type of conglomerate whose investments generate huge amounts of cash and which can successfully reinvest that cash again and again over the long term. It is an almost perfect case of a snowball in the markets. Here is one interesting fact: we estimate that the intrinsic value of a single Berkshire share is currently growing at a rate of about $178 per day. When we bought the shares 12 years ago, this was less than $50 a day. The rate of growth is accelerating gradually and with minimal fluctuations. Moreover, Berkshire has additional decades of similar growth still ahead of it.”\nBRK-B is the unsurprising top hedge fund insurance stock pick. But our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than BRK-B but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nOverall BRK-B ranks 1st on our list of the best homeowner's insurance stocks to buy. While we acknowledge the potential of BRK-B as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for AI stock that is more promising than BRK-B but trades at less than 5 times its earnings, checkout our report about the cheapest AI stock.\n \nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and 10 Best of Breed Stocks to Buy For The Third Quarter of 2024 According to Bank of America.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    }
]