[
    {
        "Date": "2024-09-22T10:34:00.000Z",
        "Title": "Is Berkshire Hathaway a Millionaire-Maker?",
        "Author": "  Justin Pope, The Motley Fool ",
        "Text": "Warren Buffett might be the greatest investor the world has ever seen. If anything, he probably has the most public resume to make his argument. Buffett's holding company, Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), offers decades of evidence of his Wall Street magic.\nHad you invested just $1,000 in Berkshire Hathaway when it went public in 1980, you'd have over $2.3 million today. That's genuinely life-changing returns on a modest investment.\nHowever, Berkshire Hathaway is worth nearly $1 trillion today, and Buffett recently turned 94. Can the stock still turn long-term investors into millionaires?\nBuffett doesn't have an easy job. Berkshire Hathaway is a holding company, which is a business entity that owns various other businesses and assets. Berkshire Hathaway owns dozens of private companies, including GEICO Insurance, railroads, energy pipelines, manufacturers, and consumer-facing brands like Dairy Queen and Fruit of the Loom. The company also operates an enormous stock portfolio with nearly four dozen positions worth approximately $316 billion. Buffett and his management team must act as conductors, pulling and pushing the right buttons and levers so that all these moving parts create value for Berkshire and its shareholders.\nBerkshire has been consistently successful at this, boosting its book value for decades through the economic ups and downs.\nThis steady value creation is driving the company's remarkable stock performance. Sure, Berkshire is a behemoth today, but the stock can create wealth for you if management wisely allocates Berkshire's vast financial resources to increase its book value.\nBuffett seemingly hasn't lost his touch or instincts in his old age.\nYou could credit Berkshire's soaring book value over the past decade to Buffett's investment in Apple, arguably his most extraordinary feat to date. Berkshire bought Apple in early 2016, when it traded at roughly 12 times earnings. Since then, Apple has been a multibagger, returning over 860%. The investment grew to be worth several hundreds of billions of dollars, and Buffett began selling it off earlier this year as Apple stock approached a price-to-earnings ratio of 35. That's the definition of \"Buy low, sell high.\"\nNot only did Berkshire capture much of its Apple returns by selling off a chunk of the stock, but Berkshire has financially equipped itself to be opportunistic again. The company now has an estimated $277 billion in cash, approximately 28% of its market cap today!\nKnowing Berkshire's track record, there's a good chance that Buffett or Berkshire's management team will eventually use that money well, and shareholders will benefit.\nApproaching Buffett's age as respectfully as possible, it's fair to wonder about Berkshire's long-term leadership. After all, Buffett is 94, and while he seems in good health and as sharp as ever, time eventually defeats us all. That said, investors shouldn't avoid Berkshire simply because Buffett won't be around forever to lead the ship.\nIt would be insulting to pretend that Berkshire isn't aware of this -- the company has a succession plan. Buffett has already tapped Greg Abel to lead Berkshire after he's gone. Abel has been with Berkshire for over 25 years and has undoubtedly played the student role under Buffett's mentorship.\nWill Abel allocate Berkshire's capital as well as Buffett has? There is only one Buffett, so that's a valid concern. However, Berkshire is one of the world's most financially and fundamentally robust companies. It could create value for its shareholders for decades to come. Consider having some faith until there's a reason not to.\nBerkshire can continue growing -- there are always additional investments or businesses to buy that can increase its book value. Don't forget that the companies within Berkshire also grow over time.\nIt's also fair to acknowledge that at a worth of nearly a trillion dollars, Berkshire is likely too big to generate the same returns it once did. The days of Berkshire turning $1,000 into a million dollars are probably over. However, Berkshire can still build wealth over time as part of a diversified portfolio.\nAnyone with a long-term time horizon should consider buying and holding this unique company.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $710,860!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of September 16, 2024\nJustin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway a Millionaire-Maker? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-09-04T13:00:18.000Z",
        "Title": "Is Trending Stock Berkshire Hathaway Inc. (BRK.B) a Buy Now?",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this company have returned +13%, compared to the Zacks S&P 500 composite's +3.6% change. During this period, the Zacks Insurance - Property and Casualty industry, which Berkshire Hathaway B falls in, has gained 11%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nBerkshire Hathaway B is expected to post earnings of $4.57 per share for the current quarter, representing a year-over-year change of -7.9%. Over the last 30 days, the Zacks Consensus Estimate has changed +5.4%.\nFor the current fiscal year, the consensus earnings estimate of $19.72 points to a change of +14.8% from the prior year. Over the last 30 days, this estimate has changed +4.5%.\nFor the next fiscal year, the consensus earnings estimate of $19.99 indicates a change of +1.4% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed +3.1%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Berkshire Hathaway B is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Berkshire Hathaway B, the consensus sales estimate for the current quarter of $96.62 billion indicates a year-over-year change of +3.7%. For the current and next fiscal years, $368.44 billion and $374.84 billion estimates indicate +1.1% and +1.7% changes, respectively.\nBerkshire Hathaway B reported revenues of $93.65 billion in the last reported quarter, representing a year-over-year change of +1.2%. EPS of $5.38 for the same period compares with $4.62 a year ago.\nCompared to the Zacks Consensus Estimate of $97.31 billion, the reported revenues represent a surprise of -3.75%. The EPS surprise was +11.39%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-01T21:45:22.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Moves -0.62%: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) ended the recent trading session at $457.41, demonstrating a -0.62% swing from the preceding day's closing price. This change was narrower than the S&P 500's 0.93% loss on the day. On the other hand, the Dow registered a loss of 0.41%, and the technology-centric Nasdaq decreased by 1.53%.\nShares of the company witnessed a loss of 3.29% over the previous month, trailing the performance of the Finance sector with its gain of 0.52% and the S&P 500's gain of 2.17%.\nThe upcoming earnings release of Berkshire Hathaway B will be of great interest to investors. In that report, analysts expect Berkshire Hathaway B to post earnings of $4.57 per share. This would mark a year-over-year decline of 7.86%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $96.62 billion, up 3.66% from the year-ago period.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $19.72 per share and a revenue of $368.44 billion, signifying shifts of +14.78% and +1.09%, respectively, from the last year.\nInvestors should also take note of any recent adjustments to analyst estimates for Berkshire Hathaway B. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed an unchanged state. Berkshire Hathaway B is holding a Zacks Rank of #2 (Buy) right now.\nLooking at valuation, Berkshire Hathaway B is presently trading at a Forward P/E ratio of 23.34. This signifies a premium in comparison to the average Forward P/E of 13.67 for its industry.\nWe can additionally observe that BRK.B currently boasts a PEG ratio of 3.33. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. As the market closed yesterday, the Insurance - Property and Casualty industry was having an average PEG ratio of 1.54.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This group has a Zacks Industry Rank of 16, putting it in the top 7% of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-09-11T13:00:00.000Z",
        "Title": "Powin Selected by BHE Renewables, a Berkshire Hathaway Energy business, for one of the World’s Largest Solar and Storage Microgrids",
        "Author": "Business Wire ",
        "Text": "Powin partners with BHE Renewables to advance clean energy and aerospace manufacturing in West Virginia, meeting crucial domestic content requirements\nPORTLAND, Ore., September 11, 2024--(BUSINESS WIRE)--Powin, a global leader in energy storage solutions, will partner with BHE Renewables as the energy storage solutions provider for one of the largest solar and storage microgrids, located in Ravenswood, West Virginia. This groundbreaking project will supply Titanium Metals Corporation, Inc. (TIMET), a subsidiary of Precision Castparts Corp., with renewable energy to manufacture titanium products for the global aerospace industry.\nPowin will deliver a 50 MW Centipede™ Stack800 battery energy storage system to help power this first-of-its-kind renewable energy microgrid, that will include a 106 MW solar array. The battery system is engineered to discharge energy continuously for 10 to 12 hours, showcasing the viability of lithium-ion phosphate batteries for long-duration applications. The partnership marks one of Powin's first projects that meet the domestic content requirements outlined in the Inflation Reduction Act, designed to bolster the United States economy.\n\"We are honored to collaborate with BHE Renewables on this monumental project,\" said Jeff Waters, CEO of Powin. \"This initiative not only showcases the scalability and reliability of our energy storage solutions but also underscores our commitment to advancing clean energy and economic growth in the United States. By meeting domestic content requirements, we're proud to contribute to the reshoring of critical energy infrastructure manufacturing.\"\nBHE Renewables, a subsidiary of Berkshire Hathaway Energy, will oversee the construction and operation of the solar and battery system, which will be completed in phases aligned with TIMET’s ramp-up to full production. The project is set to commence with initial deliveries beginning in 2025 and reaching full capacity in 2027. This is the first facility of what will be an industrial hub, driving economic revitalization in the region.\n\"Powin is a trusted partner who was uniquely able to meet our commercial and technical specifications,\" said Alicia Knapp, President and CEO of BHE Renewables. \"Their expertise and innovative approach were essential in providing the best technical solution available to enable us to deliver the Ravenswood microgrid and meet domestic content requirements, using the benefits of the Inflation Reduction Act to drive economic revitalization in West Virginia.\"\nThis project marks Powin's second collaboration with BHE Renewables, including the current development of Solar Star 3 and 4 in Kern County, California. These solar-plus-storage projects demonstrate how renewable energy can drive economic growth, improve grid reliability, and lower our carbon footprint.\nAbout Powin, LLC (Powin):\nAt Powin, we are advancing the next frontier of energy and changing the way we power our daily lives by ensuring access to clean, resilient, and affordable power. With 17 GWh of projects deployed and under construction, we are a leading and trusted energy storage provider dedicated to creating an exceptional customer experience through end-to-end energy storage solutions. As a global energy storage platform provider, we offer fully integrated battery solutions, software, and services to optimize grid performance and enable the transition to cleaner energy sources. To learn more, please visit www.powin.com.\nAbout BHE Renewables:\nBHE Renewables develops, owns and operates solar, wind, geothermal, hydroelectric projects that produce energy for both the wholesale market and for customers under long-term power agreements. Learn more at www.bherenewables.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240911925505/en/\nContacts\nKate Adamspowin@pancomm.com\n"
    },
    {
        "Date": "2024-09-02T15:30:03.000Z",
        "Title": "Why Is Berkshire Hathaway B (BRK.B) Up 11.1% Since Last Earnings Report?",
        "Author": "  Zacks Equity Research ",
        "Text": "It has been about a month since the last earnings report for Berkshire Hathaway B (BRK.B). Shares have added about 11.1% in that time frame, outperforming the S&P 500.\nWill the recent positive trend continue leading up to its next earnings release, or is Berkshire Hathaway B due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important drivers.\nBerkshire Hathaway Q2 Earnings & Revenues Rise Y/YBerkshire Hathaway delivered second-quarter 2024 operating earnings of $11.6 billion, which increased 15.5% year over year. The increase was driven by higher earnings insurance underwriting and insurance-investment income.\nRevenues increased 1.2% year over year to $93.6 billion, attributable to higher revenues at Insurance and Other. Costs and expenses decreased 1.2% year over year to $79.6 billion, largely due to a decrease in freight rail transportation expenses, utility and energy cost of sales and other expenses, interest expense, and cost of sales and services. The figure was lower than our estimate of $86 billion.\nBerkshire Hathaway’s Insurance and Other segment revenues increased 4.2% year over year to $68.4 billion in the reported quarter on the back of higher insurance premiums earned, leasing revenues and interest, dividend and other investment income. Insurance underwriting earnings increased 81.5% year over year to $2.3 billion. Railroad, Utilities and Energy operating revenues decreased 6% year over year to $25.2 billion, primarily due to lower freight rail transportation revenues, utility and energy operating revenues, service revenues and other income. The figure was lower than our estimate of $28 billion. Pre-tax earnings of Railroad increased 0.5% year over year to $1.6 billion. Operating earnings from the Railroad business increased 0.3% year over year to $1.8 billion.Total revenues at Manufacturing, Service and Retailing increased 0.2% year over year to $42.2 billion. Pre-tax earnings decreased 5.6% year over year to $4.2 billion.Earnings from Manufacturing, Service and Retailing businesses decreased 5.3% year over year to $3.2 billion.\nAs of Jun 30, 2024, consolidated shareholders’ equity was $607.9 billion, up 7.1% from the level as of Dec 31, 2023. At quarter-end, cash and cash equivalents were $36.9 billion, up 9.5% from the level at 2023-end.BRK.B exited the second quarter of 2024 with a float of about $169 billion, which remained unchanged from the figure at the end of 2023. Cash flow from operating activities totaled $24.2 billion in the reported quarter, up 14.5% from the year-ago period.Berkshire Hathaway bought back shares worth $2.9 billion in the first half of 2024.\nIn the past month, investors have witnessed an upward trend in fresh estimates.\nThe consensus estimate has shifted 5.43% due to these changes.\nAt this time, Berkshire Hathaway B has a subpar Growth Score of D, however its Momentum Score is doing a lot better with an A. However, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.\nOverall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.\nEstimates have been trending upward for the stock, and the magnitude of this revision looks promising. Notably, Berkshire Hathaway B has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.\nBerkshire Hathaway B is part of the Zacks Insurance - Property and Casualty industry. Over the past month, First American Financial (FAF), a stock from the same industry, has gained 5.1%. The company reported its results for the quarter ended June 2024 more than a month ago.\nFirst American Financial reported revenues of $1.61 billion in the last reported quarter, representing a year-over-year change of -2.1%. EPS of $1.27 for the same period compares with $1.35 a year ago.\nFor the current quarter, First American Financial is expected to post earnings of $1.16 per share, indicating a change of -4.9% from the year-ago quarter. The Zacks Consensus Estimate has changed -0.9% over the last 30 days.\nFirst American Financial has a Zacks Rank #3 (Hold) based on the overall direction and magnitude of estimate revisions. Additionally, the stock has a VGM Score of B.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nFirst American Financial Corporation (FAF) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]