[
    {
        "Date": "2024-10-10T13:19:52.000Z",
        "Title": "‘We Underestimated’ Nvidia, Says $50 Billion Manager Impax",
        "Author": "  Frances Schwartzkopff ",
        "Text": "(Bloomberg) -- As Nvidia Corp. found itself the target of a deep selloff earlier this year, Impax Asset Management was quietly seizing the moment to build a stake it had long regretted not owning.\nMost Read from Bloomberg\nSan Francisco to Shut 9% of Public Schools Amid Budget Woes\nThe Cablebus Transformed Commutes in Mexico City’s Populous Outskirts\nChicago’s $1 Billion Budget Hole Exacerbated by School Turmoil\nUrban Heat Stress Is Another Disparity in the World’s Most Unequal Nation\nShould Evictions Be Banned After Hurricanes and Climate Disasters?\nIan Simm, chief executive officer and founder of the $50 billion London-based asset manager, says he and his team had been looking for an opportunity to correct what they had come to realize was a wrong call a few years ago, which meant missing out on Nvidia’s stunning 800% rally since the beginning of 2023.\n“We just underestimated the market potential of their product,” Simm said in an interview. Impax had been looking for a way in, but Nvidia “was expensive.” That is, “until it had a selloff.”\nNvidia’s share-price slump earlier this year resulted in a peak-to-trough decline in its market value of close to $1 trillion. Though much of that has since been recouped, Simm says he thinks the company’s current valuation of more than $3.2 trillion still understates what it’s really worth.\nEstablished in 1998, Impax has made a name for itself as a giant among asset managers focused on the transition to a more sustainable economy. Simm says that goal should be compatible with making money for his clients. But it’s been a tough sell of late.\nOver the past couple of years, a spike in interest rates, an energy crisis and the ascent of the so-called Magnificent Seven of technology behemoths have turned green investing into a losing bet. Impax’s own share price is down almost 30% this year, while the S&P Global Clean Energy Index has lost more than 10%. The S&P 500, meanwhile, is up more than 20% in the same period.\nImpax recently reported results that showed gains in listed equities of £5.3 billion ($6.9 billion) for the fiscal year ended Sept. 30. That was less than the £5.8 billion of net outflows that Impax saw in the period.\nA few years ago, Simm says there was a “big debate” at Impax on the merits of piling into Nvidia. The case around artificial intelligence was “speculative at the time,” he said. Back then, the asset manager concluded that Nvidia’s technology was largely limited to the gaming industry and therefore the asset manager decided against going big on investing.\n“Frankly, we’ve underperformed for the last couple of years in our main strategies because we’ve been more growth-at-a-reasonable-price, staying away from the momentum and hype around mega-cap tech investing,” he said.\nAs Nvidia’s share price was falling in June, Impax more than tripled its stake in the company to 4.9 million shares by the end of the month from 1.4 million shares at the end of the first quarter, according to data compiled by Bloomberg and confirmed by Impax.\nSimm says Impax still considers Nvidia to be undervalued when taking into account how the boom in artificial intelligence is expected to drive demand for its chips.\nSimm says holding Nvidia, which like other technology giants needs to consume vast stores of energy to power its growth, also makes investing sense from a climate perspective. As demand for energy continues to increase, Nvidia and other companies that develop more efficient models will be better for the environment, he says.\nNvidia’s Blackwell chips, which are beginning to roll out to customers this year, would need 3 gigawatts of power to develop OpenAI’s GPT-4 software, the company said at an event earlier this month. Ten years ago, that process would have required 5,500 gigawatts, the chipmaker said.\n“Nvidia’s ability to deliver energy savings makes it even more valuable,” Simm said.\nNvidia is emitting greenhouse gasses at a pace that exceeds levels needed to limit global warming to the critical threshold of 1.5C. Back in April, Morningstar analysts estimated the company’s so-called implied temperature rise was 3.8C.\n“You can still make money from investing in society’s response to too much CO2 emissions while still being bearish about what the net result’s going to be,” Simm said. Impax looks “for growth at a reasonable price rather than from an ethical perspective or the non-financial impact.”\nExceeding the thresholds in the Paris climate agreement is “a risk issue.”\nBut “pricing should sort that out, if countries are moving ahead with internalizing the cost of CO2 emissions,” he said.\nImpax holds Nvidia in five strategies and funds. That includes its Global Opportunities portfolio, which is limited to 40 stocks and consists of companies that have a diversified business model, operate in high-growth markets and are “out of favor for whatever reason,” Simm said. Microsoft Corp. is included because Impax thinks it’s undervalued “in the context of the secular trend toward more AI,” he said.\nIn fact, “the whole industrial space” now looks undervalued, Simm said. That may change as a “soft landing in the US” looks increasingly likely, which is helping restore confidence, he said. The cost of capital is falling and consumer sentiment is stabilizing, so equity “is looking more attractive.”\n(Adds Nvidia implied temperature rise, CEO comments in final paragraphs.)\nMost Read from Bloomberg Businessweek\nLina Khan Is Just Getting Started (She Hopes)\nWhy Is It So Hard for Clothing Resale Platforms to Make Money?\nMusk Reveals Why He’s Jumping Into Trump’s Arms\nChina Is Playing Catch-Up to Elon Musk in Space\nHow Jellycat Plushies Became a Gen Z Obsession\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-10-11T10:05:59.000Z",
        "Title": "NVIDIA Corporation (NVDA) CEO Jensen Huang Discusses Future of AI and the Need for Reduced Computing Costs on Podcast",
        "Author": "  Usman Kabir ",
        "Text": "We recently compiled a list of the 35 AI News You Should Not Miss. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against the other AI stocks you should not miss.\nThe AI industry is constantly evolving and investors are keeping a close eye on investments, advancements in AI capabilities, and new partnerships to keep pace with the continued rise of generative AI and integration into key industries. One of the most exciting developments in the field of AI over the past week has been the 2024 Nobel Prize in Physics, which was awarded to scientists John Hopfield and Geoffrey Hinton for their pioneering work in the field of machine learning. Hopfield, a researcher at Princeton University, gained recognition for developing an associative memory system, a neural network model capable of storing and reconstructing images or other data patterns. His work revolutionized how data patterns can be represented and recalled, marking significant progress in the field of artificial intelligence. Meanwhile, Hinton, a professor at the University of Toronto, pioneered a method for autonomously discovering data properties, enabling machines to perform tasks such as identifying specific elements within images. His contributions have been pivotal in advancing AI capacity for image recognition and pattern identification.\nAnother notable report worthy of mention is a recent Reuters study into the funding that AI startups have attracted so far this year. The study highlights the $6.6 billion funding round for AI startup OpenAI recently that pushed the valuation of the company to more than $157 billion. It also spotlights other AI startups that have received more than $500 million in funding this year. These include xAI, CoreWeave, Scale AI, Figure AI, Groq, Mistral AI, and Cohere. They have raised $6 billion, $1.1 billion, $1 billion, $657 million, $640 million, $600 million, and $500 million in funding so far this year, respectively. The startups are all valued at more than $2.5 billion, with xAI, founded by Tesla chief Elon Musk, worth over $24 billion. A recent report by Goldman Sachs reveals that businesses worldwide are projected to spend nearly $1 trillion in the coming years on building AI infrastructure. The report underscores the massive scale of investment needed to meet the growing demand for AI technologies across various industries. In 2024 alone, venture capital firms have already completed around 200 deals with AI companies, pouring in nearly $22 billion in funding. The average size of these funding rounds exceeds $100 million, reflecting the increasing valuation of AI startups, which now often surpass $1 billion.\nRead more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities.\nOur Methodology\nFor this article, we selected AI stocks by combing through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA close-up of a colorful high-end graphics card being plugged in to a gaming computer.\nNumber of Hedge Fund Holders: 179 \nNVIDIA Corporation (NASDAQ:NVDA) provides graphics, computing and networking solutions. Jensen Huang, the CEO of the firm, recently made an appearance on a podcast hosted by Rene Haas, the CEO of chip design firm Arm. During his appearance, Huang stressed that the future of AI would be services which could reason. However, he also cautioned that the cost of computing needed to be reduced to reach that phase. Huang further predicted that next-generation AI tools would be able to answer questions by going through hundreds or thousands of steps and reflecting on their own conclusions. Huang added that his company would set the stage for these advancements by strengthening chip performance every year.\nOverall NVDA ranks 5th on our list of the AI stocks you should not miss. While we acknowledge the potential of NVDA as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-02T08:34:27.000Z",
        "Title": "NVIDIA Corporation (NVDA): One of the Most Widely Held Stocks by Hedge Funds",
        "Author": "  Maleha Afzal ",
        "Text": "We recently compiled a list of the 10 Most Widely Held Stocks by Hedge Funds. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against the other widely held stocks.\nThe last trading day of September is upon us and so are many questions about the market. On September 30, Dana D’Auria, Envestnet Solutions co-CIO and group president, appeared in an interview on Yahoo Finance to discuss the financial market.\nD'Auria regards employment data to be a major concern at the moment. Since inflation rates are subsiding, employment data is something investors should be on the lookout for, along with other data points including GDP and consumer confidence. She suggests that to ensure a soft landing, the Fed must initiate larger rate cuts, and that recessionary conditions are out of the picture.\nSeptember is notoriously volatile along with October, and, with elections in another 35 days, the conditions may be slightly different or even more turbulent. According to D'Auria, the 50 basis point cut is a catch-up for July, and expecting a 50 basis point cut in November is borderline questionable.\nOverall, she believes that the market has been overshooting and we may have to settle for two 25 basis point cuts before the end of 2024. She reiterates that the job market is crucial and investors must get out of their comfort zone to invest in non-cash opportunities. Investors concerned about low-risk options may consider equities in the defensive sectors that are innately low volatile.\nWall Street is heading to close September and Q3 on a high note and stocks have experienced their best September in over a decade. On September 30, Kevin Gordon, harles Schwab's Director and Senior Investment Strategist, appeared in an interview on Yahoo Finance to discuss his market thesis.\nGordon believes that stocks in the utilities and defensive sectors have caught up to tech stocks amid the AI boom, compared to their financials at the end of FY 2023. However, he does acknowledge that sectors like industrials, financials, and materials are performing relatively well, calling it a case of market broadening.\nIn terms of market breadth, most sectors are experiencing an upward trajectory. Almost 81% of the S&P 500 members are experiencing an uptrend, despite the quality bias investors may have towards certain stocks. According to Gordon, large-cap quality stocks will continue to perform well despite the volatility and the Fed's decisions. Speaking of smaller-cap stocks, he believes that some stocks may struggle a bit especially when it comes to earnings growth.\nOur Methodology\nTo come up with the 10 most widely held stocks by hedge funds, we sifted through Insider Monkey's database that tracks over 900 hedge funds, as of Q2 2024. We ranked the top 10 stocks that were the most widely held by hedge funds in ascending order of their hedge fund sentiment.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter's strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA close-up of a colorful high-end graphics card being plugged in to a gaming computer.\nNumber of Hedge Fund Holders: 179\nNVIDIA Corporation (NASDAQ:NVDA) is one of the most popular stocks at the moment, also referred to as the AI star. The GPU maker is known for its cloud solutions, chip systems, and growing role in producing artificial intelligence solutions.\nThe company logged $26.3 billion in data center revenue, up 16% from the previous quarter and 154% year-over-year. The revenue growth was driven by strong demand for Nvidia’s GPU Computing platform. Overall, NVIDIA Corporation (NASDAQ:NVDA) logged $30 billion in revenue during the FQ2 of 2025, up by 122% year-over-year, well above its outlook of only $28 billion.\nNVIDIA Corporation (NASDAQ:NVDA) is one of the most widely held stocks by hedge funds. Such can be attributed to its rapid advancements in technology and strategic partnerships. The company’s networking platform for AI, Spectrum X, is projected to become a multi-billion dollar entity in a year. Moreover, the company just closed a deal with Salesforce allowing organizations to benefit from advanced AI and data capabilities. Two weeks ago, NVIDIA launched a new AI tool, Aerial, to optimize wireless networks that will meet the needs of the next generation on mobile, robots, autonomous vehicles, and 5G.\nAnalysts are bullish on NVDA and their 12-month median price target of $150 points to a 24% upside from current levels. At the close of Q2 2024, 179 investors were bullish on NVDA, with total stakes amounting to $53.7 billion.\nIthaka Group's Ithaka US Growth Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its Q2 2024 investor letter:\n\"NVIDIA Corporation (NASDAQ:NVDA) is the market leader in visual computing through the production of high-performance graphics processing units (GPUs). The company targets four large and growing markets: Gaming, Professional Visualization, Data Center, and Automotive. NVIDIA’s products have the potential to lead and disrupt some of the most exciting areas of computing, including: data center acceleration, artifi cial intelligence (AI), machine learning, and autonomous driving. The reason for the stock’s appreciation in the quarter was twofold: First, the stock benefi ted from tremendous excitement surrounding the further development of generative AI and the likelihood this would necessitate the purchase of a large number of Nvidia’s products far into the future; Second, Nvidia posted another strong beat[1]and-raise quarter, where the company upped its F2Q25 revenue guidance above Street estimates, showcasing its dominant position in the buildout of today’s accelerated computing infrastructure.\"\nOverall NVDA ranks 6th on our list of the most widely held stocks by hedge funds. While we acknowledge the potential of NVDA as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-03T17:19:57.000Z",
        "Title": "Nvidia stock rises as CEO Jensen Huang touts 'insane' chip demand",
        "Author": " Alexandra Canal    · Senior Reporter",
        "Text": "Nvidia (NVDA) stock jumped as much as 5% on Thursday as CEO Jensen Huang said demand for its next-generation Blackwell chips has been \"insane.\"\nIn an interview with CNBC on Wednesday after the market close, Huang confirmed the chips are in \"full production\" despite recent design issues that caused some delays in customer rollouts.\n\"Blackwell is as planned,\" Huang said. \"Everybody wants to have the most and everybody wants to be first.\"\nBlackwell delays have caused concern for investors, with many looking to the rollout as the next big catalyst for the chipmaker after a recent stock slump fueled by a mid-July sell-off from the unwinding of the yen carry trade.\nSince then, markets have seen a rotation out of Big Tech while other macroeconomic factors, such as China trade fears, have also hampered Nvidia's stock price.\nBut investors and analysts alike remain largely confident in the trajectory of the artificial intelligence trade. Nvidia's stock is still up about 170% over the last 12 months and more than 2,700% over the last five years. Year to date, Nvidia has gained around 150%.\n90% of Wall Street analysts recommend the stock as a Buy, with the majority predicting that shares will rise to around $147.60 over the next year, according to Bloomberg consensus estimates.\nOn top of its latest Blackwell update, Nvidia's move to the upside also comes as the company backed ChatGPT developer OpenAI (MSFT) in its latest funding round, which concluded on Wednesday.\nOpenAI was able to raise an additional $6.6 billion to reach a valuation of $157 billion in another bullish sign for the AI boom.\nGil Luria, senior software analyst at DA Davidson, said in an interview with Yahoo Finance that \"there's a direct flow from the funding round that was announced today to Nvidia\" due to data center demand that would benefit the chipmaker. \"That's why the stock's up today,\" he said.\nYahoo Finance's Laura Bratton contributed to this report. \nAlexandra is a Senior Reporter at Yahoo Finance. Follow her on X @alliecanal8193 and email her at alexandra.canal@yahoofinance.com\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-10-14T08:28:00.000Z",
        "Title": "Want to Buy Nvidia, Microsoft, and Apple? Consider This Vanguard Growth ETF",
        "Author": "  Anthony Di Pizio, The Motley Fool ",
        "Text": "The S&P 500 (SNPINDEX: ^GSPC) is home to 500 different companies, but it's weighted by market capitalization, which means the largest names in the index have a greater influence over its performance than the smallest.\nApple, Nvidia, and Microsoft are the top three companies in the S&P 500, with a combined market cap of $9.8 trillion, which represents 19.7% of the index. Nvidia stock, for example, was up 156% through the first half of 2024, which accounted for one-third of the entire 15% gain in the S&P 500.\nIn other words, investors who don't have America's tech giants in their portfolio are probably underperforming the broader market. But there's a simple way to buy them without having to predict which ones might deliver the best returns from here.\nThe Vanguard Mega Cap Growth ETF (NYSEMKT: MGK) is an exchange-traded fund (ETF) with a concentrated portfolio filled with the largest tech stocks an investor could want. Here's why it might be a great alternative to buying individual stocks.\nETFs can hold hundreds, or even thousands, of different stocks. However, the Vanguard Mega Cap Growth ETF holds just 71, so it's ideal for investors who already have an existing portfolio, but specifically want to add some exposure to the largest growth companies in America.\nThe ETF holds stocks from 10 different sectors of the economy, but technology has a whopping 61.4% weighting because of the sheer size of companies like Apple, Microsoft, and Nvidia.\nIn fact, the ETF is highly concentrated toward its top five holdings for that reason. The table shows their weightings in the ETF, compared to their weightings in the S&P 500 index:\nStock\nVanguard ETF Portfolio Weighting\nS&P 500 Weighting\n1. Apple\n13.52%\n6.97%\n2. Microsoft\n12.68%\n6.54%\n3. Nvidia\n11.29%\n6.20%\n4. Meta Platforms\n4.96%\n2.41%\n5. Amazon\n4.54%\n3.45%\nData source: Vanguard. Portfolio weightings are accurate as of Aug. 31, and are subject to change.\nHaving a much higher weighting toward these stocks can be a double-edged sword. It means the Vanguard ETF will outperform the S&P 500 when those specific stocks are doing well, but it's likely to underperform if they hit a rough patch, because it lacks diversity relative to the index.\nWith that said, these five companies are among the most important players in the fast-growing artificial intelligence (AI) industry. Apple is rolling out its Apple Intelligence software, which it developed in partnership with OpenAI. It's going to transform the way iPhone, iPad, and Mac users create and consume content. Since Apple has over 2.2 billion active devices worldwide, the company could soon become the biggest distributor of AI to consumers.\nMicrosoft and Amazon have developed their own AI virtual assistants, which are embedded into their flagship software products. Plus, the Microsoft Azure and Amazon Web Services cloud platforms are two of the largest AI distribution channels for businesses, allowing them to access ready-made models and data center computing power for their development needs.\nNvidia's graphics processing chips (GPUs) for the data center are at the heart of the entire AI revolution. Its H100 GPU set the benchmark for AI developers last year, and the company is preparing to ship large volumes of its new Blackwell-based GPUs, which will deliver an incredible leap in performance and cost efficiency.\nOutside its top five positions, the Vanguard ETF also holds popular megacap stocks like Eli Lilly, Tesla, Costco Wholesale, and McDonald's -- so it isn't all about technology.\nThe Vanguard ETF has delivered a compound annual return of 13.1% since it was established in 2007, which is much better than the average annual return of 10.2% in the S&P 500.\nThe ETF has delivered an even stronger compound annual return of 20.2% over the last five years. That's because of the rapid adoption of technologies like cloud computing and AI, which have propelled stocks like Nvidia, Microsoft, and Amazon to multitrillion-dollar valuations. The S&P 500 has gained 16.7% per year (on average) over that same stretch.\nIn other words, if technology stocks continue to lead the broader market higher, investors should expect the Vanguard ETF to outperform the S&P 500 because of its enormous exposure to the sector. Some forecasts on Wall Street suggest AI could add anywhere from $7 trillion to $200 trillion to the global economy over the next decade. If that's true, tech stocks will be one of the best places to invest.\nConversely, if AI fails to live up to the hype, the Vanguard ETF could underperform for a period of time because stocks like Nvidia would lose a chunk of the value they have created over the last couple of years.\nThis Vanguard ETF is very cheap to own, with an expense ratio of just 0.07% (the portion of the fund deducted each year to cover management costs), which is more than 90% cheaper than comparable funds, according to Vanguard. Therefore, investors seeking exposure to the big end of the stock market without having to pick individual winners and losers should look no further.\nBefore you buy stock in Vanguard World Fund - Vanguard Mega Cap Growth ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Vanguard World Fund - Vanguard Mega Cap Growth ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, Costco Wholesale, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nWant to Buy Nvidia, Microsoft, and Apple? Consider This Vanguard Growth ETF was originally published by The Motley Fool\n"
    }
]