[
    {
        "Date": "2024-02-22T09:30:00.000Z",
        "Title": "Tech war: Nvidia sampling alternative AI chips to China as US restrictions take a toll there",
        "Author": "South China Morning Post ",
        "Text": "US chip giant Nvidia said it has started shipping alternative samples of permissible AI chips to Chinese customers, as Washington's restrictions on sales of advanced chips to the mainland begin to take a toll on its business in China.\nNvidia reported upbeat results for its fourth quarter ended January 28 on the back of robust demand worldwide for its data centre graphics processing units (GPUs), with revenue up 265 per cent year on year to US$22.1 billion, including US$18.4 billion generated from the data center segment.\nBut China was an exception. \"Growth was strong across all regions except for China, where our data center revenue declined significantly following the US government export control regulations imposed in October,\" Nvidia's chief financial officer Colette Kress said in an earnings conference call with analysts on Tuesday.\nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.\nKress said Nvidia has started shipping alternative GPUs that do not require a licence for the Chinese market under the tighter export regime, adding that the firm has not received licences from the US government to ship restricted products to China.\nShe expects China to represent a mid-single-digit percentage of its data centre revenue in the next quarter, flat with the fourth quarter.\nNvidia has been among the most-affected US companies after the US Commerce Department tightened export controls in October, citing national security concerns.\nWhile Nvidia's net profit skyrocketed 581 per cent to US$29.8 billion in the 12 months ended January 28, its prospects in China remain under a cloud. The trade sanctions prevent Nvidia from exporting to China its advanced GPUs, such as the A100 and H100, which have become sought-after for artificial intelligence (AI) training. Its tailor-made A800 and H800 GPUs, developed as workarounds for Chinese clients in 2022, were blocked by the updated US controls last October, leading to new alternatives such as the H20, L20 and L2 GPUs.\nNvidia's CEO Jensen Huang attends a session of the World Governments Summit, in Dubai, United Arab Emirates, February 12, 2024. Photo: Reuters alt=Nvidia's CEO Jensen Huang attends a session of the World Governments Summit, in Dubai, United Arab Emirates, February 12, 2024. Photo: Reuters>\n\"At the core, the US government wants to limit the latest capabilities of Nvidia's accelerated computing and AI to the Chinese market,\" Jensen Huang, the company's billionaire chief executive, said on the call.\nHe added that following the October restrictions, Nvidia has \"reconfigured its products in a way that is not software hackable in any way\", which took some time. He added that Nvidia is sampling products with customers in China.\nNvidia has started to take pre-orders for its H20, a GPU that can be used by China-based customers for AI training, with a single card price range between US$12,000 and US$15,000, the Post reported previously.\nChina, including Hong Kong, was Nvidia's third-largest single market after the US and Taiwan in its financial year 2023. Greater China, which includes Taiwan, accounted for 21.5 per cent of its total revenue, down from 26 per cent in the previous year.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved.\nCopyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved.\n"
    },
    {
        "Date": "2024-02-23T20:15:10.000Z",
        "Title": "Why Nvidia Stock Rallied (Again) on Friday",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "Shares of Nvidia (NASDAQ: NVDA) rallied (again) on Friday, jumping as much as 4.9%. As of 2:32 p.m. ET, the stock was still up 1.7%.\nThe rally followed yesterday's blockbuster financial report, which propelled Nvidia to new heights. After digesting the results and after adjusting his models, the self-professed \"most bullish analyst on Nvidia\" has issued a new price target.\nRosenblatt analyst Hans Mosesmann, the self-professed \"most bullish analyst on Nvidia,\" maintained his buy rating on the stock while increasing his price target to a Street-high $1,400. That suggests potential upside of more than 78% -- on top of the stock's 437% gains since the beginning of 2023.\nWhile there wasn't any new commentary forthcoming, Mosesmann has previously called Nvidia's triple-digit revenue growth \"unprecedented\" and suggested that the stock is \"just getting started.\"\nHe also said CEO Jensen Huang \"made the case that [in] looking at the data center installed base of $1 trillion, most of it will shift to accelerated computing from general purpose compute for generative AI models (training and inference).\"\nMosesmann is likely onto something.\nIn the conference call to discuss Nvidia's results, Huang reiterated that view, saying, \"Fundamentally, the conditions are excellent for continued growth [from] calendar '24 to calendar '25 and beyond.\"\nHe pointed to two secular tailwinds that he believes will continue to drive growth. First, the \"transition from general to accelerated computing.\" He argues, \"There's just no reason to update with more CPUs\" when GPUs are more energy-efficient and cost-effective. Second is the speed and computing horsepower necessary to run generative artificial intelligence applications. Nvidia is at the intersection of both those trends.\nIf we are, as Mosesmann believes, on the cusp of a $1 trillion data center upgrade cycle, that represents a massive opportunity. Furthermore, Nvidia controls an estimated 95% of the data center GPU market, according to CFRA analyst Angelo Zino.\nWe're still in the early innings of each of these transitions. This puts Nvidia in the driver's seat for years to come.\nShould you invest $1,000 in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 20, 2024\nDanny Vena has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy.\nWhy Nvidia Stock Rallied (Again) on Friday was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-21T21:00:21.000Z",
        "Title": "Best AI Stock: Nvidia vs. TSMC",
        "Author": "  Parkev Tatevosian, CFA, The Motley Fool ",
        "Text": "Fool.com contributor Parkev Tatevosian identifies which stock is the better buy, Nvidia (NASDAQ: NVDA) or Taiwan Semiconductor Manufacturing (NYSE: TSM).\n*Stock prices used were the afternoon prices of Feb. 19, 2024. The video was published on Feb. 21, 2024.\nShould you invest $1,000 in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 20, 2024\nParkev Tatevosian, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy.\nParkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\nBest AI Stock: Nvidia vs. TSMC was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-22T01:29:47.000Z",
        "Title": "Nvidia's 4Q revenue, profit soar thanks to demand for its chips used for artificial intelligence",
        "Author": "Associated Press Finance ",
        "Text": "SANTA CLARA, Calif. (AP) — Nvidia Corp., which has seen its value skyrocket over the past year thanks to soaring demand for its graphics chips used for artificial intelligence, posted stronger-than-expected results Wednesday for its latest quarter, with its revenue more than tripling from a year earlier.\nNvidia reported revenue for its fiscal fourth quarter that ended Jan. 28 of $22.1 billion, up from $6.05 billion.\nThe company based in Santa Clara, California, earned $12.29 billion, compared to a profit of $1.41 billion a year ago.\nAdjusted for one-time items, Nvidia earned $5.16 a share in the latest quarter, that topped Wall Street forecasts for $4.59 per share, based on analysts surveyed by FactSet Research. Analysts had expected revenue of $20.4 billion for the period that concluded the company’s fiscal year.\nThe company's specialized chips are key components that help power different forms of artificial intelligence, including the latest generative AI chatbots such as ChatGPT and Google's Gemini.\n“Accelerated computing and generative AI have hit the tipping point,\" said Jensen Huang, founder and CEO of Nvidia, in a statement. “Demand is surging worldwide across companies, industries and nations.”\nNvidia carved out an early lead in the hardware and software needed to tailor its technology to AI applications, partly because Huang began to nudge the company into what was then seen as a still half-baked technology more than a decade ago. It also makes chips for gaming and cars.\nHuang looked at ways that Nvidia chipsets known as graphics processing units might be tweaked for AI-related applications to expand beyond their early inroads in video gaming.\n“Another blockbuster quarter from Nvidia raises the question of how long its soaring performance will last,\" said Insider Intelligence analyst Jacob Bourne. “It has a massive lead in the growing global AI chip sector but can’t rest on its laurels.”\nBourne said Nvidia faces a number of challenges, including broader economic uncertainty, tech giants’ drive to make their own AI chips and emerging rivals. But he said the company's market strength, for the near future, is “durable”\nFor the current quarter, Nvidia expects revenue of about $24 billion. Analysts are currently expecting Nvidia to post revenue of $22.2 billion for the February-April period. The company expects “continued growth” to 2025 and beyond.\nThe company said its data center revenue grew in all regions except China, where the U.S. government has imposed export regulations.\n“Although we have not received licenses from the U.S. government to ship restricted products to China, we have started shipping alternatives that don’t require a license for the China market,” Huang said in a conference call with analysts.\nNvidia relies heavily on the world's biggest maker of computer chips, the Taiwan Semiconductor Manufacturing Company, to churn out the chips that Nvidia designs.\nTaiwan’s Taiex benchmark index last week jumped 3% to a record high, buoyed by a surge in TSMC's share price.\nThe leap came after Morgan Stanley analysts raised their price target on Nvidia's stock to $750 from $603, citing an increase in demand for AI chips.\n“Generative AI has kicked off a whole new investment cycle to build the next $1 trillion of infrastructure of AI generation factories,” Huang said. “We believe these two trends will drive a doubling of the world’s data center infrastructure installed base in the next five years and will represent an annual market opportunity in the hundreds of billions.”\nNvidia's shares jumped 7.5%, to $726 in after-hours trading.\n"
    },
    {
        "Date": "2024-02-23T09:55:00.000Z",
        "Title": "1 Big Problem With Nvidia's Rising Valuation",
        "Author": "  David Jagielski, The Motley Fool ",
        "Text": "Nvidia's (NASDAQ: NVDA) stock has been red hot for over a year now. Up an incredible 239% in 2023, it has continued to climb more than 45% so far in 2024 already. Investors aren't averse to paying a high premium for the stock given the potential that the company possesses.\nFor long-term investors, it's hard not to like Nvidia's growth prospects. Artificial intelligence (AI) is a huge opportunity for the business and its chips, which could prove to be essential for companies developing their own AI models and chatbots.\nBut there's a big concern that I see as the stock continues to rise, and one that could derail its progress: The expectations may be far too high.\nNvidia's stock trades at nearly 100 times its trailing earnings. Even if you base it on the company's estimated future profits, the multiple is still a bit high at around 36. What investors can turn to in order to help normalize the company's earnings multiple is the price-to-earnings-growth ratio, or PEG.\nThe PEG multiple takes the price-to-earnings (P/E) ratio and divides it by the expected earnings growth for the business over the next five years. Nvidia's PEG ratio is less than 1, which implies that it's a good deal. If the PEG multiple is below 1, that indicates the company is expanding at a fast rate and the current P/E multiple may be justified, and that the stock is even cheap given the company's future growth prospects.\nThe problem with this conclusion, however, is that it depends heavily on analyst earnings estimates. According to analysts' expectations and data collected from Yahoo! Finance, Nvidia's growth rate will average 95% annually for five years. What this means is that if you believe Nvidia can double its revenue for five consecutive years, then yes, it's a good buy even at a P/E multiple of close to 100. The problem with that is it can create an extremely high bar for the company to have to hit.\nNvidia's growth rate has been more than doubling, however, and so it isn't outlandish to believe that it could maintain that high of a rate next year.\nBut how Nvidia will do in three or four years is more debatable. Previously, OpenAI CEO Sam Altman warned that people were effectively \"begging to be disappointed\" with AI's capabilities. If that turns out to be true, the risk is that the level of investment in AI that analysts and investors expect could way off base. And any drop in demand could make Nvidia's expensive stock vulnerable to a sell-off.\nNvidia is a promising stock to own because it is a leading supplier of AI chips. But at its extremely elevated price tag, it's not a stock I would buy today. If you're willing to hang on for several years, it could still be a good buy. But with expectations set so high, there's a fair amount of risk starting to creep into the stock, which could set it up for a correction in the future.\nInvestors may want to consider buying other AI stocks that can provide them with potentially more upside.\nShould you invest $1,000 in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 20, 2024\nDavid Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy.\n1 Big Problem With Nvidia's Rising Valuation was originally published by The Motley Fool\n"
    }
]