[
    {
        "Date": "2024-05-01T18:26:03.000Z",
        "Title": "Why Nvidia (NVDA) Shares Are Sliding Today",
        "Author": "  Kayode Omotosho ",
        "Text": "Shares of leading designer of graphics chips Nvidia (NASDAQ:NVDA) fell 5.9% in the afternoon session after peer, AMD, reported reported first quarter results which highlighted a material increase in its inventory levels. In addition, AMD's guidance for the next quarter was underwhelming as revenue projection was mostly in line with Wall Street's projections.\nSuper Micro Computer, another beneficiary of the current AI wave, reported underwhelming earnings as revenue fell below Wall Street's expectations, with the company calling out supply chain challenges. Like AMD, Super Micro provides data center infrastructure (servers, GPUs, and storage solutions) that power AI models. These include customized cooling racks that enable AI models to deliver better performance.\nOverall, the underwhelming results and mixed outlook provided by these semiconductor players suggest the era of hypergrowth that has propelled the valuation of some of the leading innovators in the AI space might be cooling off as investors become increasingly cautious.\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy Nvidia? Access our full analysis report here, it's free.\nNvidia's shares are very volatile and over the last year have had 11 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 5 days ago, when the company gained 6.2% as markets rallied, with the Nasdaq up 2.1%, while the S&P rose 1.1%, following strong earnings from big tech companies including Microsoft, Meta, and Alphabet. Notably, the earnings highlighted the strong demand for AI solutions, including cutting-edge AI chips that power most AI applications. These chips are developed by Nvidia and its peers.\nFor example, during its Q1'2024 earnings call, Meta raised its forecasted operating expenses and capital expenditures for the full year. The increased costs are related to the company's AI infrastructure. It also released its AI assistant, Meta AI. This product was rolled out across its family of apps and is powered by Llama 3, an open-source large language model that is a ChatGPT competitor.\nAlso, during its earnings, Microsoft noted that its operating cash flow was impacted by higher capital expenditures to support cloud and AI offerings, and guided for \"capital expenditures to increase materially on a sequential basis driven by cloud and AI infrastructure investments.\" Lastly, Alphabet struck a similar tone, adding during its earnings, \"You can see that from the increases in our capital expenditures. This will fuel growth in cloud help us push the frontiers of AI models.\"\nOverall, the future looks promising for Nvidia as it continues to meet growing market demand within the AI space.\nNvidia is up 72.3% since the beginning of the year, but at $829.38 per share it is still trading 12.7% below its 52-week high of $950.02 from March 2024. Investors who bought $1,000 worth of Nvidia's shares 5 years ago would now be looking at an investment worth $18,394.\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback.\n"
    },
    {
        "Date": "2024-04-10T07:50:00.000Z",
        "Title": "Regret Missing Nvidia's Stunning Rally? 1 Incredible Artificial Intelligence (AI) Stock to Buy Hand Over Fist Before the Company Is Worth $1 Trillion",
        "Author": "  Harsh Chauhan, The Motley Fool ",
        "Text": "Nvidia (NASDAQ: NVDA) has been one of the top ways to play the artificial intelligence (AI) boom, as customers line up to buy its powerful graphics cards so that they don't miss out on the fast-growing adoption of this technology that's expected to give the global economy a huge boost.\nAccording to PwC, AI could add a whopping $15.7 trillion to global GDP (gross domestic product) by 2030. Nvidia will play a central role in driving this AI-related economic growth thanks to its graphics processing units (GPUs), which play a major role in training large language models (LLMs) and developing AI applications.\nAll this explains why Nvidia has been growing at a breathtaking pace, leading to an impressive surge in its stock price.\nHowever, Nvidia's rally wouldn't have been possible without its foundry partner, Taiwan Semiconductor Manufacturing (NYSE: TSM), popularly known as TSMC. That's because Nvidia is a fabless semiconductor company, which means that it only designs its chips but leaves the manufacturing part to foundries such as TSMC.\nSo investors looking for an Nvidia proxy to play the AI boom would do well to buy shares of TSMC, as it looks set to join the trillion-dollar market cap club thanks to the impressive upside it is likely to deliver. Let's see why that may be the case.\nTSMC has been rapidly expanding its manufacturing capacity to help Nvidia meet the terrific demand for its AI chips. The company has allocated an estimated 40% to 50% of its advanced chip packaging capacity to Nvidia so that the latter can increase its AI chip supply, according to market research firm TrendForce.\nMore importantly, TSMC is reportedly going to increase its advanced chip packaging -- formally known as a chip on wafer and wafer on substrate (CoWoS) -- capacity to 240,000 units this year from 120,000 units last year. By the end of the year, TSMC is expected to ramp up its monthly CoWoS packaging capacity to 26,000 to 28,000 wafers a month, suggesting that Nvidia could continue to improve the output of its AI chips.\nWhat's more, TSMC has now received a $6.6 billion grant from the U.S. government, along with a $5 billion loan facility, so that it can build more factories in Arizona. TSMC is already building two facilities in Arizona that will go online in 2025 and 2028, and it is now going to build a third site following the latest grant. In all, TSMC is set to spend $65 billion on the three U.S. plants.\nThe third plant will be set up for manufacturing advanced 2-nanometer (nm) chips, which will be deployed for AI and military applications. It is worth noting that TSMC is expected to begin the trial production of 2nm chips for Nvidia so that it can start mass-producing these chips in 2025.\nThe move to a 2nm process is likely to play an important role in helping Nvidia maintain its dominance in the AI chip market. For instance, by moving from a custom 5nm architecture for its Hopper AI GPUs to a custom 4nm process from TSMC for its upcoming Blackwell GPUs, Nvidia is claiming that it can deliver a 7x to 30x jump over its current flagship H100 processor, while also reducing power consumption by up to 25 times.\nSo TSMC looks all set to benefit from Nvidia's AI chip dominance, and this should ideally help drive stronger growth in the company's revenue and earnings. That's probably the reason why analysts have significantly bumped their earnings growth expectations for TSMC.\nTSMC stock trades at 28 times trailing earnings and 23 times forward earnings. Both multiples are lower than the Nasdaq-100's earnings multiple of 30 (using the index as a proxy for tech stocks). We saw in the chart in the previous section that TSMC's bottom line could jump just over $9 per share in 2026.\nAssuming TSMC does hit that mark and trades at 30 times earnings after three years, in line with the Nasdaq-100's earnings multiple, its stock price could hit $270 -- an 86% jump from current levels. TSMC currently commands a market cap of $750 billion, which means that it is well on course to join the trillion-dollar market cap club within the next three years.\nAll this indicates why investors looking for an AI stock trading at an attractive valuation should consider buying TSMC hand over fist, as it seems built for terrific upside that could help take its market cap well beyond $1 trillion.\nBefore you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $533,869!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 8, 2024\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy.\nRegret Missing Nvidia's Stunning Rally? 1 Incredible Artificial Intelligence (AI) Stock to Buy Hand Over Fist Before the Company Is Worth $1 Trillion was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-09T18:10:28.000Z",
        "Title": "Intel Unveils New AI Accelerator in Bid to Challenge Nvidia",
        "Author": "  Ian King ",
        "Text": "(Bloomberg) -- Intel Corp. is rolling out a new version of its artificial intelligence chip, aiming to challenge Nvidia Corp. in one of the fastest-growing parts of the semiconductor industry.\nMost Read from Bloomberg\nIsrael Versus Iran — What All-Out War Could Look Like\nTexas Warns of Possible Power Emergency Next Week\nIran’s Missile Barrage Was an Error Israel Can Gain From\nIsrael Grapples With New Phase in its Multi-Front War With Iran\nA $150 Billion Fortune Bolsters Qatari Royals at Critical Moment\nThe updated processor, called Gaudi 3, will be widely available in the third quarter, Intel said at a company event Tuesday. The chip is designed to boost performance in two key areas: helping train AI systems — a process that involves bombarding them with data — and running the finished software.\nBooming demand for AI services has sent tech companies scrambling for these so-called accelerator chips, but Nvidia has seen most of the benefit. Earlier versions of Gaudi failed to achieve the market share gains that Intel had been hoping for, Chief Executive Officer Pat Gelsinger has said. He expects the new model to have a bigger impact.\n“They’re a good competitor, but people want an alternative,” he said Tuesday of Nvidia. “The world needs more suppliers, and we’re quite dedicated to providing that choice.”\nIntel shares gained were up less than 1% at $38 as of 1:33 p.m. in New York on Tuesday, reversing an earlier decline. They had been down 24% this year through Monday’s close.\nGelsinger declined to give pricing but said that his chips would be “a lot below” the cost of Nvidia’s current and future chips. They’ll provide an “extremely good” total cost of ownership, he said.\nChallenging Nvidia won’t be easy. The runaway success of that company’s H100 accelerator helped more than double revenue and sent its market valuation over $2 trillion. And now Nvidia is looking to build on its lead with a just-announced chip platform called Blackwell. Systems based on that product will be available later this year, the company said in March.\nRead More: Nvidia Looks to Extend AI Dominance With New Blackwell Chips\nAccording to Intel’s assessment, Gaudi 3 will be faster and more power-efficient than the H100. It will train certain types of AI models 1.7 times more quickly and be 1.5 times better at running the software, the chipmaker claims. The product will be roughly equal with Nvidia’s newer H200, Intel said, performing slightly better in some areas and a bit behind in others.\nIntel, based in Santa Clara, California, said it can’t provide comparisons with Nvidia’s upcoming Blackwell line until those products are publicly available. Intel rival Advanced Micro Devices Inc. — its longtime competitor in personal computer processors — also is pushing into the field. It unveiled an accelerator lineup called MI300 in December.\nIntel’s Gelsinger has said that he’s not just trying to catch up with Nvidia. He expects AI to bring a bigger windfall for the industry — especially as the technology spreads beyond its current concentration in the data centers of companies such as Microsoft Corp. and Alphabet Inc.’s Google. Personal computers, mobile phones and networking gear will require chips that are able to handle AI tasks and provide users with instantaneous feedback — something that’s not always possible with remote server farms.\nWhen Intel announced its fourth-quarter results in late January, Gelsinger said he was increasing the supply of Gaudi to meet growing orders and that the company has a “pipeline” for 2024 of “above $2 billion and growing.” The broader market for corporate spending on generative AI gear will increase from $40 billion in 2024 to $151 billion in 2027, Intel said, citing market research.\nBut that just underscores how much of a lead Nvidia has. The company had data center revenue of more than $47 billion during the 12 months ended in January. In its current fiscal year, that total will top $95 billion, according to analysts’ estimates.\n(Updates with CEO comment starting in fourth paragraph.)\nMost Read from Bloomberg Businessweek\nHow a Pioneering Blackjack Master Beats the Odds of Aging\nRace for AI Supremacy in Middle East Is Measured in Data Centers\nCocoa’s Surge Is Drawing Africa’s Farmers Back to the Bean\nToyota Pins Its Hopes on Revamped 4Runner to Beat Ford and Hyundai\nEveryone Is Rich, No One Is Happy. The Pro Golf Drama Is Back\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-04-23T13:45:09.000Z",
        "Title": "Why Nvidia (NVDA) is a Top Growth Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "Taking full advantage of the stock market and investing with confidence are common goals for new and old investors alike.\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\nWhy This 1 Growth Stock Should Be On Your Watchlist\nDifferent than value or momentum investors, growth-oriented investors are concerned with a stock's future prospects, and the overall financial health and strength of a company. Thus, they'll want to focus on the Growth Style Score, which analyzes characteristics like projected and historical earnings, sales, and cash flow to find stocks that will see sustainable growth over time.\nNvidia (NVDA)\nNVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence (AI) based solutions that now support high performance computing (HPC), gaming and virtual reality (VR) platforms.\nNVDA boasts a Growth Style Score of A and VGM Score of B, and holds a Zacks Rank #2 (Buy) rating. Its bottom-line is projected to rise 84.7% year-over-year for 2025, while Wall Street anticipates its top line to improve by 74.1%.\nSix analysts revised their earnings estimate higher in the last 60 days for fiscal 2025, while the Zacks Consensus Estimate has increased $0.79 to $23.94 per share. NVDA also boasts an average earnings surprise of 20.2%.\nNvidia is also cash rich. The company has generated cash flow growth of 50.2%, and is expected to report cash flow expansion of 303.7% in 2025.\nNVDA should be on investors' short lists because of its impressive growth fundamentals, a good Zacks Rank, and strong Growth and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-01T16:45:05.000Z",
        "Title": "Is Nvidia (NVDA) a Solid Growth Stock? 3 Reasons to Think \"Yes\"",
        "Author": "  Zacks Equity Research ",
        "Text": "Growth stocks are attractive to many investors, as above-average financial growth helps these stocks easily grab the market's attention and produce exceptional returns. But finding a great growth stock is not easy at all.\nThat's because, these stocks usually carry above-average risk and volatility. In fact, betting on a stock for which the growth story is actually over or nearing its end could lead to significant loss.\nHowever, it's pretty easy to find cutting-edge growth stocks with the help of the Zacks Growth Style Score (part of the Zacks Style Scores system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.\nOur proprietary system currently recommends Nvidia (NVDA) as one such stock. This company not only has a favorable Growth Score, but also carries a top Zacks Rank.\nResearch shows that stocks carrying the best growth features consistently beat the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better.\nHere are three of the most important factors that make the stock of this maker of graphics chips for gaming and artificial intelligence a great growth pick right now.\nEarnings Growth\nEarnings growth is arguably the most important factor, as stocks exhibiting exceptionally surging profit levels tend to attract the attention of most investors. For growth investors, double-digit earnings growth is highly preferable, as it is often perceived as an indication of strong prospects (and stock price gains) for the company under consideration.\nWhile the historical EPS growth rate for Nvidia is 50%, investors should actually focus on the projected growth. The company's EPS is expected to grow 84% this year, crushing the industry average, which calls for EPS growth of -1.6%.\nCash Flow Growth\nCash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds.\nRight now, year-over-year cash flow growth for Nvidia is 303.7%, which is higher than many of its peers. In fact, the rate compares to the industry average of -14.3%.\nWhile investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 50.2% over the past 3-5 years versus the industry average of 0.6%.\nPromising Earnings Estimate Revisions\nBeyond the metrics outlined above, investors should consider the trend in earnings estimate revisions. A positive trend is a plus here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nThe current-year earnings estimates for Nvidia have been revising upward. The Zacks Consensus Estimate for the current year has surged 3.1% over the past month.\nBottom Line\nWhile the overall earnings estimate revisions have made Nvidia a Zacks Rank #1 stock, it has earned itself a Growth Score of B based on a number of factors, including the ones discussed above.\nYou can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\nThis combination indicates that Nvidia is a potential outperformer and a solid choice for growth investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]