[
    {
        "Date": "2024-05-29T15:37:00.000Z",
        "Title": "NVIDIA in Rush to Overtake Apple: ETFs Set to Gain Further",
        "Author": "  Sweta Killa ",
        "Text": "NVIDIA NVDA has been on a solid run with no signs of a slowdown, driven by the flurry of continued artificial intelligence (AI) investments and blockbuster earnings. Its shares closed above the $1,100 milestone for the first time ever.Last trading at $1,139, the AI chipmaker, the world’s third-most valuable company, is now just $100 billion away in market value to overtake Apple AAPL in a major reshuffle of Wall Street's biggest players. NVIDIA's market capitalization reached $2.8 trillion, compared to a market value of $2.9 trillion for Apple, the second-most valuable company after Microsoft MSFT.Investors seeking to tap the robust growth could consider ETFs having the largest allocation to this AI darling stock. These are Strive U.S. Semiconductor ETF SHOC, VanEck Vectors Semiconductor ETF SMH, Grizzle Growth ETF DARP, TrueShares Technology, AI and Deep Learning ETF LRNZ and Invesco PHLX Semiconductor ETF SOXQ.\nNVIDIA has been at the forefront of technology companies racing to build AI into their products and services. NVIDIA founder and CEO Jensen Huang said, “The next industrial revolution has begun — companies and countries are partnering with NVIDIA to shift the trillion-dollar traditional data centers to accelerated computing and build a new type of data center — AI factories — to produce a new commodity: artificial intelligence.”The latest catalyst driving NVIDIA is the billions of dollars funding into Elon Musk’s artificial intelligence start-up. Elon Musk announced that AI start-up xAI's supercomputer will run on NVIDIA technology (read: Why You Should Buy AI & Chip ETFs Post-NVIDIA Earnings).NVIDIA's next-generation Blackwell GPU chip is expected to drive another round of massive growth for the chip maker, along with its CUDA software platform and its exposure to the automotive market. Investors cheered CEO Jensen Huang’s comments regarding their latest chip, Blackwell, which is expected to be launched in the second half of the year.\nLast week, NVIDIA reported blowout first-quarter fiscal 2025 results, wherein it topped both earnings and revenue estimates and offered a bullish revenue outlook for the current quarter, thanks to the solid demand for its artificial intelligence (AI)-enabled GPU chips. Its data center revenues skyrocketed 427% year over year to a record $22.6 billion, buoyed by the rapid adoption of AI technologies (read: AI Boom Bolsters NVIDIA's Q1 Growth: ETFs to Tap).\nThe chipmaker announced a 10-to-1 stock split, effective Jun 7, and boosted its quarterly dividend by 150% to 10 cents per share. The stock split has sparked a retail frenzy as it will make NVIDIA shares more accessible to a wider range of investors, including the ones who make small trades, and increase liquidity. Also, it will likely pave the way for the company’s inclusion in the Dow Jones Industrial Average.Additionally, the lower price could pave the way for the company’s inclusion in the Dow Jones Industrial Average. Amazon AMZN joined the Dow earlier this year after undergoing a 20-for-1 stock split in June 2022.\nDriven by explosive growth prospects, Wall Street analysts have turned more bullish on NVIDIA and raised the target price on the stock. At least 28 of the 58 brokerage firms have raised their price targets on the stock, pushing up the median view to $1,200, according to LSEG data.NVIDIA currently has an average brokerage recommendation (ABR) of 1.20 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 41 brokerage firms. Of the 41 recommendations, 36 are Strong Buy and two are Buy. Strong Buy and Buy, respectively, account for 87.8% and 4.88% of all recommendations.\nNVIDIA stock has more than doubled so far this year, following a nearly 240% rise in 2023, courtesy of the fast-growing adoption of its H100 AI chips. However, its valuation does not seem overstretched, given that its earnings are growing faster than the share price. NVIDIA is currently trading at a P/E ratio of 46.90 versus 50.14 for Advanced Micro Devices (AMD).NVIDIA stock is expected to surge 258% from the current levels and hit a $10 trillion market valuation by 2030, according to I/O Fund tech analyst Beth Kindig (read: NVIDIA's Explosive Earnings: Should You Buy the Stock or ETFs Now?).\nStrive U.S. Semiconductor ETF (SHOC) – NVIDIA occupies the top position with 30.3% of assets.VanEck Vectors Semiconductor ETF (SMH) - NVIDIA is the top firm, accounting for 23.3% share.  Grizzle Growth ETF (DARP) - NVIDIA occupies the top position with 22.6% of the assets.TrueShares Technology, AI and Deep Learning ETF (LRNZ) - NVIDIA takes the top spot at 16.4% share.Invesco PHLX Semiconductor ETF (SOXQ) - NVIDIA occupies the top position with a 14.6% share in the basket.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nVanEck Semiconductor ETF (SMH): ETF Research Reports\nTrueShares Technology, AI and Deep Learning ETF (LRNZ): ETF Research Reports\nInvesco PHLX Semiconductor ETF (SOXQ): ETF Research Reports\nStrive U.S. Semiconductor ETF (SHOC): ETF Research Reports\nGrizzle Growth ETF (DARP): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-16T15:06:45.000Z",
        "Title": "What Nvidia, Oracle, and Dell Stock Investors Should Know About Recent Artificial Intelligence (AI) Updates",
        "Author": "  Jose Najarro, The Motley Fool ",
        "Text": "In today's video, I discuss recent updates impacting Nvidia (NASDAQ: NVDA) and other AI companies. Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the after-market prices of May 15, 2024. The video was published on May 15, 2024.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $579,803!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nJose Najarro has positions in Nvidia and Oracle. The Motley Fool has positions in and recommends Nvidia and Oracle. The Motley Fool has a disclosure policy. Jose Najarro is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\nWhat Nvidia, Oracle, and Dell Stock Investors Should Know About Recent Artificial Intelligence (AI) Updates was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-28T19:15:48.000Z",
        "Title": "Why Is Nvidia (NVDA) Stock Soaring Today",
        "Author": "  Adam Hejl ",
        "Text": "Shares of leading designer of graphics chips Nvidia (NASDAQ:NVDA) jumped 7.5% in the afternoon session after continued strong momentum following a strong earnings report last week. This helped drive the Nasdaq to a record high. The tech-heavy index crossed the 17,000 mark.\nThere was also some positive news over the weekend. The Information reported that Elon Musk's AI company, xAI, announced plans to buy Nvidia's AI chips for its new supercomputer. On Monday, May 27, 2024, xAI announced its series B funding round on the social media platform X.com (formerly called Twitter). The AI start-up raised $ 6 billion to \"take xAI's first products to market\" and to \"build advanced Infrastructure.\" According to the reports, it is likely that the development of the infrastructure will birth a massive computing system - dubbed \"the Gigafactory of computing\" - which is expected to use 100,000 semiconductors based on NVDA's H100 GPU, and with an estimated size exceeding 4x the biggest cluster in existence.\nOverall, the report suggested that it is still early days in the hot AI market while providing more definitive insight into the growing demand for Nvidia's AI chips.\nIs now the time to buy Nvidia? Access our full analysis report here, it's free.\nNvidia's shares are very volatile and over the last year have had 11 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 5 days ago, when the company gained 11.2% on the news that the company reported first quarter earnings results. Nvidia recorded healthy gross margin improvement, indicating elevated pricing power. Its revenue and EPS outperformed Wall Street's estimates, driven by better-than-expected results in its data center and automotive segments; the result in its automotive segment (17% year-on-year revenue growth) was especially impressive given the industry is in a cyclical downturn and many other semiconductor companies have posted year-on-year declines for that end market.\nLastly, its inventory levels increased, likely due to the company stocking up on products in anticipation of strong demand. During the announcement of the results, Nvidia issued a 10-1 stock split that will commence on Friday, June 7, 2024. Looking ahead, Nvidia's revenue for the next quarter beat expectations again. Overall, this was a great quarter that shareholders will appreciate.\nNvidia is up 136% since the beginning of the year. Investors who bought $1,000 worth of Nvidia's shares 5 years ago would now be looking at an investment worth $31,676.\nHere at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified a relatively under-the-radar profitable growth stock benefitting from the rise of AI, available to you FREE via this link.\n"
    },
    {
        "Date": "2024-05-22T13:49:00.000Z",
        "Title": "The Nvidia Rivals: 3 AI Stocks Ready to Steal the Spotlight",
        "Author": "  Tezcan Gecgil ",
        "Text": "Artificial Intelligence (“AI”) is increasingly emerging as a pivotal force shaping the future of technology. As a key player in the AI revolution, Nvidia (NASDAQ:NVDA) has been leading the list of AI stocks to buy. The tech giant is renowned for its graphics processing units (GPUs) for gaming and professional markets. Wall Street also focuses on its system-on-a-chip units (SoCs) for the mobile computing and automotive markets.\nThis week, the spotlight is on the NVDA stock as it is reporting earnings. Nvidia’s stock has been a focal point among investors, due to its remarkable performance over the few past years, but especially since 2023. NVDA’s success can be traced back to its strategic focus on some of the most transformative technologies, including AI, deep learning and autonomous vehicles. Powering breakthroughs in machine learning and data science, its GPUs have become indispensable.\nHowever, the AI stocks to buy extend beyond Nvidia. The market is expansive and growing, with many companies vying for a share of the lucrative pie. According to a report by Grand View Research, the global AI market size stood at $196.6 billion in 2023. In addition, it could grow at a compound annual growth rate (CAGR) of 36.6% from 2024 to 2030. This growth should be propelled by increasing data volume and the adoption of cloud-based applications and services. There has also been a surge in demand for intelligent virtual assistants.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nAs the AI industry continues to burgeon, several other companies are making their presence felt and are ready to challenge Nvidia. These companies are not just competitors. They are also potential game-changers, ready to steal the spotlight with their innovative AI solutions. In this article, we will explore three such AI stocks to buy.\nSource: Ascannio / Shutterstock.com\nAmong the AI stocks to buy, Palantir Technologies (NYSE:PLTR) could appeal to long-term investors. The software company specializes in big data analytics for government agencies and commercial clients. Their “Foundry” platform integrates and analyzes large, complex datasets, making PLTR a top contender among AI stocks to buy.\nInvestors have been eyeing Palantir for its potential to capitalize on AI, used in everything from fraud detection to national security. The AI play released the financial metrics for the first quarter 2024 at the beginning of May. Revenue grew 21% year-over-year (YOY) to $634 million, driven by strong performance in its U.S. commercial business, which saw a 40% increase. Adjusted earnings per share (“EPS”) was 8 cents.\nIn a move to empower businesses and governments globally, tech giants Oracle (NYSE:ORCL) and Palantir are working together. By combining Oracle’s robust cloud infrastructure with Palantir’s cutting-edge AI and data analysis tools, the partnership aims to unlock the full potential of data for organizations. This could translate to improved efficiency, meeting data sovereignty needs and gaining a competitive edge.\nAs a result, PLTR stock is up 28% year-to-date (YTD). The company’s profitability metrics are impressive. However, its valuation metrics indicate high expectations, with a price-to-earnings (P/E) ratio of 171x and a price-to-sales (P/S) ratio of 21x. Meanwhile, the 12-month median price forecast for PLTR is $22.00, presenting an upside potential of 3.6% from current levels. Therefore, interested readers may wait for a potential decline toward the $20 level before loading up on PLTR stock.\nSource: rafapress / Shutterstock.com\nThe next company on our list of AI stocks to buy is SoundHound AI (NASDAQ:SOUN). The company focuses on the voice AI segment, having made significant strides in enhancing conversational experiences. Its conversational interfaces include automatic speech recognition, natural language understanding and voice-enabled commerce solutions.\nOn May 9, SoundHound released first quarter 2024 financial metrics. Revenues grew 73% YOY to $11.6 million, but the adjusted loss per share was 7 cents. The company raised its full-year 2024 revenue guidance to between $65 million and $77 million, anticipating continued growth. SoundHound’s management remains optimistic about achieving a revenue milestone of $100 million and reaching adjusted EBITDA profitability by 2025.\nMeanwhile, SoundHound AI has strategically partnered with Nvidia and Perplexity to enhance and expand its voice AI capabilities. These partnerships aim to integrate SoundHound’s conversational AI technologies with Nvidia’s DRIVE platform for in-vehicle applications and incorporate Perplexity’s large language models to improve the accuracy of SoundHound’s AI solutions. Investors are hopeful that the collaborations could drive innovation and monetization, significantly impacting SoundHound’s market presence and technological advancement.\nSo far in the year, SOUN stock has returned 146% YTD, showcasing a strong positive market sentiment towards its future prospects. However, valuation remains expensive as SOUN shares are changing hands at 25.5 times sales. Yet Wall Street’s median price forecast stands at $7.00, suggesting an upside potential of over 36%.\nSource: Michael Vi / Shutterstock.com\nWe conclude our discussion of AI stocks to buy with Teradyne (NASDAQ:TER). The company is one of the most important names in testing equipment for semiconductors, wireless products and industrial automation solutions.\nTeradyne’s management released first quarter fiscal 2024 earnings in late April. Investors noted the continued weakness in mobility. Yet robust memory and networking demand driven by AI applications drove financial performance above the high end of guidance. Going forward, further growth in the semiconductor industry is expected to gain traction, benefiting Teradyne as a provider of testing equipment.\nIn 2024, management is anticipating a 500% increase in the high-bandwidth memory test market. The growth will likely be driven by AI tailwinds for semiconductor testing. Analysts note that the increasing complexity of semiconductor testing should continue to drive Teradyne’s margin expansion and profit growth in the long term as well.\nAs a result, since January, TER stock has advanced 33.8%. Shares are changing hands at a forward P/E ratio of 44x and a trailing sales ratio of 7.5x. We would wait for a pullback and look to buy Terradyne stock around $130.\nOn the date of publication, Tezcan Gecgil has both long and short positions in NVDA. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nTezcan Gecgil, PhD, began contributing to InvestorPlace in 2018. She brings over 20 years of experience in the U.S. and U.K. and has also completed all 3 levels of the Chartered Market Technician (CMT) examination. Publicly, she has contributed to investing.com and the U.K. website of The Motley Fool.\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\nIt doesn’t matter if you have $500 or $5 million. Do this now.\nThe post The Nvidia Rivals: 3 AI Stocks Ready to Steal the Spotlight appeared first on InvestorPlace.\n"
    },
    {
        "Date": "2024-05-07T10:46:30.000Z",
        "Title": "The biggest risk to investing in 'Magnificent 7' stocks like Nvidia and Amazon, according to top CEOs",
        "Author": " Brian Sozzi    · Executive Editor",
        "Text": "What's a glitzy investing conference without a little \"Magnificent Seven\" banter?\n\"The risk is simple — those stocks don't do well,\" Avenue Capital Group founder and CEO Marc Lasry told Yahoo Finance at the Milken Institute Global Conference on Monday.\nLasry was answering a question about the risk of overcrowding into tech names such as Nvidia (NVDA), Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Google (GOOG, GOOGL), Meta (META), and Tesla (TSLA) — aka the Magnificent Seven.\n\"What has happened is when people are nervous, they invest in things that they know really well and they believe are going to be around,\" Lasry added. \"But I don't know what happens in the next year. I do know on the credit side, you've got all these opportunities.\"\nThe former co-owner of the Milwaukee Bucks, Lasry has been investing in credit markets for more than four decades, giving him a reported net worth of $1.9 billion.\nSo suffice it to say, Lasry has seen a few investing cycles and market crazes.\nAnd the Magnificent Seven could be viewed as a craze.\nAltogether, the Magnificent Seven stocks were responsible for about 37% of the S&P 500's 10.2% gain in the first quarter, according to data from S&P Global Indices. In 2023, the cohort constituted roughly two-thirds of the S&P 500's advance.\nThe optimism in the group reflects profit enthusiasm on everything from Nvidia's AI chips to Microsoft's Copilot productivity tool.\nBut with investors now more closely scrutinizing the Magnificent Seven amid higher interest rates, shares have slowed their roll.\nAs Apollo Global Management CEO Marc Rowan explained, \"I'm not in the stock-picking business. But very few people come in every day and try to buy 45 or 50 P/E stocks. It's just not what we do.\" (Disclosure: Apollo Global Management is the parent company of Yahoo Finance.)\n\"I look at the broader trend. We used to have 8,000 public companies. We now have 4,000 public companies,\" he added. \"People think most of the action is in public markets. 80% of companies over a hundred million [in] revenue and 80% of employment is in private companies.\"\nSome top traders shared their views on how to trade the Magnificent Seven stocks on a new episode of the Opening Bid podcast. You can tune in below.\nBrian Sozzi is Yahoo Finance's Executive Editor. He is also the host of the \"Opening Bid\" podcast. Follow Sozzi on Twitter/X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com. Are you a CEO and want to come on Yahoo Finance Live? Email Brian Sozzi.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    }
]