[
    {
        "Date": "2024-06-20T14:48:07.000Z",
        "Title": "Great News for Nvidia Stock Investors",
        "Author": "  Parkev Tatevosian, CFA, The Motley Fool ",
        "Text": "Fool.com contributor Parkev Tatevosian highlights what the news could mean for Nvidia (NASDAQ: NVDA) stock investors.\n*Stock prices used were the afternoon prices of June 17, 2024. The video was published on June 19, 2024.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $830,777!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 10, 2024\nParkev Tatevosian, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy.\nParkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\nGreat News for Nvidia Stock Investors was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-06T14:00:00.000Z",
        "Title": "NVIDIA Overtakes Apple: ETFs to Tap the Incredible Growth Story",
        "Author": "  Sweta Killa ",
        "Text": "NVIDIA NVDA has been on an explosive surge with no signs of a slowdown, fueled by the artificial intelligence (AI) frenzy and blockbuster earnings. The chipmaker overtook Apple AAPL, topping $3 trillion in market cap and becoming the second-most valuable company in the United States. NVIDIA hit the $1 trillion mark in May 2023 and reached $2 trillion by February 2024, surpassing Amazon and Alphabet.Investors can tap into its incredible growth with the help of ETFs that have the largest allocation to this AI darling. These include Strive U.S. Semiconductor ETF SHOC, AXS Esoterica NextG Economy ETF WUGI, VanEck Vectors Semiconductor ETF SMH, Grizzle Growth ETF DARP and TrueShares Technology, AI and Deep Learning ETF LRNZ. All these funds have NVIDIA as the top holding with a large concentration.The latest catalyst in driving the growth is the stock split and the fervor surrounding the next-generation AI chips. The solid trend is likely to continue.NVIDIA sparked a retail frenzy on the 10-for-1 stock split news. At the end of the week, NVDA will undergo a 10-for-1 stock split, which will make its shares more affordable to a wider range of investors, including the ones who make small trades, and increase liquidity. In a stock split, the company increases the number of shares, reducing the share price. However, the total dollar value of all shares outstanding remains the same and doesn’t affect the company’s valuation (read: ETFs to Tap on NVIDIA's 10-for-1 Stock Split Retail Frenzy).The stock split will also likely pave the way for NVIDIA’s inclusion in the Dow Jones Industrial Average, like Amazon (AMZN), which joined the index earlier this year after undergoing a 20-for-1 stock split in June 2022.NVIDIA has been the biggest beneficiary of the AI boom. Last weekend, the AI chipmaker unveiled a high-powered version of its Blackwell chip — called the Blackwell Ultra — slated to release in 2025, followed by a new AI chip platform, Rubin, in 2026. The company will debut an Ultra version of Rubin in 2027. Its first Blackwell processors are slated for delivery later this year, replacing the widely popular Hopper generative AI chips.Companies like Microsoft, Meta Platforms and Alphabet are rapidly expanding their AI computing capabilities, boosting NVIDIA's growth. NVIDIA has an estimated 80% market share in AI chips for data centers, which are attracting billions of dollars in spending from big cloud vendors.Further, Elon Musk recently announced that AI start-up xAI's supercomputer will run on NVIDIA technology. This week, Foxconn announced its plans to build an advanced computing center in Taiwan using NVIDIA's Blackwell chips. These are expected to provide a further boost to the company’s growth prospects.\nWall Street analysts are going more bullish on NVIDIA and continue to boost their price targets. This week, Bank of America called NVIDIA a \"top pick,\" reiterating its buy rating on the stock and raising its price target to $1,500 from $1,320. As the chipmaker is accelerating its product upgrade cycle, the analyst believes the move will \"continue to bolster NVIDIA’s AI leadership position.\"Driven by explosive growth prospects, Wall Street analysts have turned more bullish on NVIDIA and raised the target price on the stock post-earnings. At least 28 of the 58 brokerage firms have raised their price targets on the stock, pushing up the median view to $1,200, according to the recent LSEG data.NVIDIA currently has an average brokerage recommendation (ABR) of 1.20 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 41 brokerage firms. The current ABR compares to an ABR of 1.20 a month ago based on 40 recommendations.Of the 41 recommendations deriving the current ABR, 36 are Strong Buy and two are Buy. Strong Buy and Buy, respectively, account for 87.8% and 4.88% of all recommendations. A month ago, Strong Buy made up 87.5%, while Buy represented 5%.\nNVIDIA stock has risen more than 140% this year and 200% over the past year. It is by far the biggest outperformer among the so-called “Magnificent Seven.” However, its valuation does not seem overstretched, given that its earnings are growing faster than the share price. NVIDIA is currently trading at a P/E ratio of 42.85 versus 47.81 for Advanced Micro Devices AMD (read: AMD-Nvidia ETFs in Focus Amid New Chip Introductions).\nStrive U.S. Semiconductor ETF (SHOC)Strive U.S. Semiconductor ETF seeks broad market exposure to the U.S. semiconductor sector. It follows the Bloomberg US Listed Semiconductors Select Total Return Index and holds 32 stocks in its basket, with NVIDIA accounting for 31.9% of the assets. Strive U.S. Semiconductor ETF has AUM of $71.4 million and charges 40 bps in annual fees. It trades in a volume of 13,000 shares per day on average and has a Zacks ETF Rank #2 (Buy).AXS Esoterica NextG Economy ETF (WUGI)AXS Esoterica NextG Economy ETF is an actively managed ETF that invests in stocks of companies that benefit from the ever-evolving digital economy. It holds 31 stocks in the basket, with NVIDIA making up for a 26.1% share. AXS Esoterica NextG Economy ETF has accumulated $29.5 million in its asset base and charges 75 bps in fees per year. It trades in a volume of 32,000 shares a day on average.VanEck Vectors Semiconductor ETF (SMH)VanEck Vectors Semiconductor ETF offers exposure to companies involved in semiconductor production and equipment. It follows the MVIS US Listed Semiconductor 25 Index and holds 26 stocks in its basket, with NVIDIA accounting for 24.5% of the total assets. VanEck Vectors Semiconductor ETF has managed assets worth $20.5 billion and charges 35 bps in annual fees and expenses. SMH has a Zacks ETF Rank #1 (Strong Buy) with a High risk outlook.Grizzle Growth ETF (DARP)Grizzle Growth ETF is an actively managed ETF that seeks long-term capital appreciation through companies focused on growth, innovation and disruption. It seeks to identify future leaders in key growth themes, including Digitization and Cloud Computing, Future Media and Entertainment, Health and Wellness, and Sustainability and Energy Transition. Grizzle Growth ETF holds 41 stocks in its basket, with NVIDIA making up 24.2% of the assets. It has accumulated $14.1 million in its asset base and charges 75 bps in annual fees (read: AI Boom Bolsters NVIDIA's Q1 Growth: ETFs to Tap).  TrueShares Technology, AI and Deep Learning ETF (LRNZ)TrueShares Technology, AI and Deep Learning ETF is an actively managed fund targeting companies that are significantly involved in the application of high levels of artificial intelligence. It holds 23 stocks in its basket, with NVIDIA making up for a 17.8% share. LRNZ has amassed $41.3 million in its asset base and trades in an average daily volume of 8,000 shares. It charges 69 bps in fees per year.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nVanEck Semiconductor ETF (SMH): ETF Research Reports\nTrueShares Technology, AI and Deep Learning ETF (LRNZ): ETF Research Reports\nAXS Esoterica NextG Economy ETF (WUGI): ETF Research Reports\nStrive U.S. Semiconductor ETF (SHOC): ETF Research Reports\nGrizzle Growth ETF (DARP): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-20T15:44:10.000Z",
        "Title": "Microsoft and Nvidia are now the world’s most valuable companies. How Intel—once the top chipmaker—blew its shot to be one of them",
        "Author": "  Geoff Colvin ",
        "Text": "In the annals of business success stories few saw coming, Nvidia’s incredible rise to surpass Microsoft and become the world’s most valuable company is one for the books. This past week Nvidia, cofounded by Jensen Huang, edged out Microsoft as its market cap soared to $3.42 trillion. Yet it could have been otherwise. As business leaders marvel at Nvidia’s rise, it’s worth remembering that another company—Intel—came tantalizingly close to being where Nvidia is now.\nInstead, Intel is waging a heroic effort to regain its place as the world’s preeminent maker of leading edge chips. The story of how it lost that position is part of a recent Fortune case study.\nAs detailed in the piece, a key moment occurred in the mid-2000s, when Paul Otellini, then CEO of Intel, said a word to Steve Jobs he almost never heard: No.\nIt was 2006, and Intel, the global king of computer chips, was bringing in record revenue and profits by dominating the kinds of chips in hottest demand—for personal computers and data centers. Now Jobs wanted Intel to make a different type of chip for a product that didn’t even exist, which would be called the iPhone.\nOtellini knew chips for phones and tablets were the next big thing, but Intel had to devote substantial capital and its best minds to the fabulously profitable business it already possessed. Besides, “no one knew what the iPhone would do,” he told The Atlantic seven years later, just before he stepped down as CEO. “There was a chip that they were interested in, that they wanted to pay a certain price for and not a nickel more, and that price was below our forecasted cost. I couldn’t see it.”\nOtellini, who died in 2017, was a highly successful CEO by many measures. But if that decision had gone the other way, Intel might have become a chip titan of the post-PC era. Instead, it gave up on phone chips in 2016 after losing billions trying to become a significant player. As he left the company, Otellini seemed to grasp the magnitude of his decision: “The world would have been a lot different if we’d done it.”\nMeantime, some 800 miles north, in Seattle, Microsoft was struggling to find its role in a tech world dominated by the internet, mobile devices, social media, and search. Investors were not impressed by its efforts. No one could have foreseen that years later, a few key decisions would set the company up as an AI powerhouse and send its stock soaring.\nThere was a time not so long ago that Microsoft and Intel were both atop the tech world. They were neither competitors nor significant customers of each other, but what New York University’s Adam Brandenburger and Yale’s Barry Nalebuff deemed “complementors.” Microsoft built its hugely profitable Windows operating system over the years to work on computers that used Intel’s chips, and Intel designed new chips to run Windows (hence “Wintel”). The system fueled the leading tech product of the 1990s, the personal computer. Microsoft’s Bill Gates became a celebrity wonk billionaire, and Intel CEO Andy Grove was Time’s 1997 Man of the Year.\nSnubbing Steve Jobs wasn’t the only cause of Intel’s decline, but it was a significant one. Intel also tried and failed to develop a GPU (graphics processing unit), which turned out to be the type of chip used in AI development and that Nvidia designs. What if Intel had succeeded? It was the world’s sixth most valuable company in 2000 and the largest maker of semiconductors; today it’s No. 69 by value and No. 2 in semiconductors by revenue, far behind No. 1 TSMC (and in some years also behind Samsung).\nA Fortune 500 CEO makes thousands of decisions in a career, a few of which will turn out to be momentous. What’s easy to explain in hindsight—that Microsoft would be at the forefront of AI, that Google would become a behemoth, that Blockbuster would fade into obscurity—is never preordained. Often the fateful decisions are identifiable only in retrospect. Nothing more vividly illustrates this than the parallel stories of Microsoft and Intel, and the failures at the latter that cleared the way for the moonshot rise of Nvidia. The case study of what went right and wrong at these giant corporations offers a master class in business strategy not just for today’s front-runners at the likes of Nvidia, Google, Open AI, Amazon, and elsewhere—but also for any Fortune 500 leader hoping to survive and thrive in the coming decade.\nYou can read the full case study here.\nThis story was originally featured on Fortune.com\n.\n"
    },
    {
        "Date": "2024-06-21T13:37:21.000Z",
        "Title": "Analyst Sees a New $331 Billion AI Opportunity for Nvidia Corp (NASDAQ:NVDA)",
        "Author": "  Fahad Saleem ",
        "Text": "We recently published a list titled 10 Best AI Stocks With More Upside on $1.2 Trillion AI “Value Creation Opportunity”. Since Nvidia Corp (NASDAQ:NVDA) ranks 4th in the list, it deserves a deeper look.\nUBS Global Wealth Management’s (GWM) recently published a detailed report discussing different layers of the AI “value chain,” estimating the combined market value opportunity from the layers at $1.2 trillion by 2027.\nUBS segments the AI market into three layers –  Enabling Layer, Intelligence Layer and Application Layer. The enabling layer is what actually powers the AI ecosystem — infrastructure, GPUs, data centers, Cloud, servers. UBS further divided this layer into two segments,  Infrastructure and Cloud. The firm expects a combined $516 billion revenue opportunity from the enabling layer by 2027.\nNext up is the intelligence layer, which acts as the brain of the entire AI ecosystem. Large language models and backed software systems sit at this layer. UBS estimates that this layer presents a $225 billion opportunity by 2027.\nThe third layer in the AI market highlighted by UBS is the application layer. This is where the end user comes in. Cloud, data centers, GPUs, LLMs and algorithms amount to nothing if the end user cannot benefit from their huge processing power. UBS said estimating monetization opportunity of this layer was the hardest since it’s still in its very early stage. The application layer addresses actual AI software used by customers — think AI assistants, GitHub CoPilot, marketing, customer service software, etc. UBS expects a whopping $395 billion in revenue opportunities for the application layer by 2027.\nKey AI Predictions\nThe UBS report also made key “predictions” about the AI landscape. The firm’s analysts believe the race to achieve artificial general intelligence (AGI) could give rise to a “capex cycle” that could “inflate” the AI investment bubble. UBS sees the dominance of a few companies in the AI industry will continue to be a reality moving forward, as it expects “monolithic players” and “AI foundries” prevailing in the near future.\nBased on this report, let’s take a look at the top companies that will directly benefit from this $1.16 trillion opportunity by 2027. For this article we analyzed UBS analysis and picked 10 stocks that are directly exposed to the three layers in the AI ecosystem highlighted by UBS in its latest report. These companies are positioned extremely well to benefit from the monetization opportunities in the enabling, intelligence and application layers of the AI market. With each stock we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nNumber of Hedge Fund Investors: 186\nUBS believes Nvidia Corp (NASDAQ:NVDA) is well-positioned to benefit from the $331 billion market opportunity in the AI Enabling layer, thanks to its GPUs. In the Cloud segment of the Enabling layer, UBS thinks Nvidia Corp’s (NASDAQ:NVDA) DGX offering makes the company a promising player. Nvidia Corp (NASDAQ:NVDA) DGX Cloud is a supercomputing service that gives enterprises access to software and infrastructure required to train advanced models for generative AI. It’s a combination of servers and workstations for optimizing deep learning applications through the use of general-purpose computing on graphics processing units (GPGPU).\nOn the Intelligence and Application layer of the AI value chain, UBS sees no notable catalyst for Nvidia Corp (NASDAQ:NVDA).\nNVIDIA Corp’s (NASDAQ:NVDA) latest product announcements and its plans revealed at the Computex 2024 show that NVIDIA Corp (NASDAQ:NVDA) has much more in its arsenal to power its growth engine. Analysts like NVIDIA Corp’s (NASDAQ:NVDA) shift to new AI architecture known as Rubin (R100) and think its powerful H100 and Blackwell chips easily beat competitors.\nNVIDIA Corp (NASDAQ:NVDA) will start shipping H200 in the second half of this year. At its GTC conference NVIDIA Corp (NASDAQ:NVDA) revealed three accelerators – B200, GB200 and GB200 NVL72. All of these products provide growth catalysts for NVIDIA Corp (NASDAQ:NVDA) shares and justify its P/E multiple of 71, given NVIDIA Corp’s (NASDAQ:NVDA) growth expectation of over 100% this year and 32% next year. Based on 2026 EPS estimate set by Wall Street, NVIDIA Corp (NASDAQ:NVDA) is trading at a forward P/E multiple of 35.74, which makes the stock’s valuation attractive given the growth catalysts it has.\nRiverPark Large Growth Fund stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its first quarter 2024 investor letter:\n“NVIDIA Corporation (NASDAQ:NVDA): NVDA shares were our top contributor in the quarter following blowout 4Q results and 1Q guidance driven by strong data center sales. The company reported quarterly revenue of $22.1 billion, up 265% year-over-year, and EPS in the quarter of $5.16, up 487% year-over-year and 12% ahead of expectations. Revenue guidance for 1Q of $24 billion was 8% above very high expectations. The artificial intelligence arms race kicked-off by ChatGPT and Alphabet’s Bard, among others, has generated tremendous demand for Nvidia’s next generation graphic processors.\nOverall, Nvidia Corp (NASDAQ:NVDA) ranks 4th on Insider Monkey’s list titled 10 Best AI Stocks With More Upside on $1.2 Trillion AI “Value Creation Opportunity”. While we acknowledge the potential of Nvidia Corp (NASDAQ:NVDA), our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than Nvidia Corp (NASDAQ:NVDA) but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-06-18T18:28:11.000Z",
        "Title": "AI chipmaker Nvidia surpasses Apple, Microsoft to become world’s most valuable company",
        "Author": "  Thomas Barrabi ",
        "Text": "AI chipmaker Nvidia surged past Apple and Microsoft to become the most valuable company in the world – the latest milestone as Wall Street investors chase the booming artificial-intelligence sector.\nShares of California-based Nvidia, whose chips are in hot demand by industry leaders ranging from Microsoft-backed OpenAI to billionaire Elon Musk’s Tesla and xAI, rose more than 3% to close at $135.58 on Tuesday. Nvidia’s stock has swelled by more than 173% since the start of the year.\nThe latest uptick pushed the market cap of Nvidia — whose CEO Jensen Huang has become known for his trademark leather motorcycle jackets — to a whopping $3.34 trillion.\nMicrosoft fell to second place with a valuation of $3.32 trillion, followed by Apple at $3.28 trillion.\nMicrosoft’s stock was flat. Apple shares fell more than 1%.\nHuang, who also co-founded Nvidia, has been one of the chief beneficiaries from the stock’s astronomical climb. He currently ranks as the world’s 12th richest person with a personal net worth estimated at $115 billion, according to the Bloomberg Billionaires Index.\nLong known as a maker of high-end graphics cards for PC gamers, Nvidia has emerged in recent years as the key supplier for firms racing to develop advanced AI.\nThe firm controls roughly 80% of the market for the computer chips used to power AI data centers, according to CNBC.\nIn blockbuster first-quarter earnings results last month, Nvidia revealed revenue for its data center segment rose to $22.6 billion – a stunning increase of 427% compared to the same period one year ago.\nNvidia’s rise has drawn the attention of federal antitrust regulators.\nThe Justice Department has reportedly launched a probe into the chipmaking company’s business and whether it has violated competition laws.\nIn an interview with the FT, DOJ antitrust chief Jonathan Kanter noted that advanced chips have become a “scarce resource” and signaled his team was examining the process by which chipmakers decide which companies receive the critical products.\nMicrosoft and Apple have each made their own forays into the AI race. Microsoft has poured $13 billion into OpenAI — a deal which itself is under regulatory scrutiny — while Apple recently announced a suite of AI features will debut in its products this fall.\nApple also has a partnership with OpenAI.\nDespite their astronomical valuations, some analysts say the tech firms are still poised for growth.\n“We believe over the next year the race to $4 Trillion Market Cap in Tech will be front and center between Nvidia, Apple, and Microsoft,” Wedbush analyst Dan Ives said in a note to clients. “Nvidia’s GPU chips are in essence the new gold or oil in the tech sector as more enterprises and consumers quickly head down this path with the 4th Industrial Revolution well underway.”\n"
    }
]