[
    {
        "Date": "2024-08-26T13:17:00.000Z",
        "Title": "3 Reasons to Buy Nvidia Stock Before Aug. 28",
        "Author": "  Johnny Rice, The Motley Fool ",
        "Text": "Did you know that just one company was responsible for more than 30% of the S&P 500's growth for the first half of this year? Take a wild guess at what company you think it is. Yes, indeed, it's Nvidia (NASDAQ: NVDA). The chipmaker is the tide rising all boats.\nIt makes sense. Nvidia's technology is driving the artificial intelligence (AI) boom, enabling a technological revolution that some believe could be as transformative as the internet itself. Its massively powerful chips are a hot commodity, and that's putting it lightly. With the rest of big tech lining up at its door to get their hands on Nvidia's latest iteration, the company more than tripled its year-over-year revenue for the last three quarters.\nNow, all eyes are on the company's next earnings report, to be released August 28. Expectations are high. So, with the release fast approaching, is it a good time to hop on board the Nvidia train? Here are three reasons the stock still looks strong.\nThere was some trepidation in tech as a whole when the latest round of earnings reports kicked off. Although the numbers generally showed positive growth, they fell short of what many investors hoped, with the notable exception of Meta posting monster revenue growth. A major concern was the growing capital expenditures (capex) from most of Silicon Valley, especially from companies like Alphabet and Microsoft that build and operate the gargantuan data centers largely responsible for the internet as we know it.\nThese cloud operators spent huge sums of money in the last few years upgrading their data centers to be capable of training and running generative AI systems, and their spending is not slowing down. There's an arms race happening in Silicon Valley and no one wants to be left behind. Look at the uptick in capex for Alphabet and Microsoft over the last three years. Notice the big jump right as AI took over the news cycle in 2023?\nThis capex growth is only continuing and even accelerating. Alphabet spent around $32 billion on capex in 2023. It's on track to spend about $50 billion this year. This is great news for Nvidia, who is on the supplier's side of many of these infrastructure orders. Yes, not all of this revenue is flowing into Nvidia's coffers, but a sizable portion is. There will continue to be a need to upgrade and expand these data centers for some time, and Nvidia will be there to meet that need.\nThe hype around Nvidia's technology is almost entirely focused on its chips. Although this will continue to be the company's bread and butter, Nvidia is expanding its product offerings into a critical category: networking. In simple terms, data needs to travel. Traditionally, data centers used ethernet-based networks to handle this, but AI can create too much data too quickly for legacy systems to handle. There are other technologies that can be used instead of ethernet, but retrofitting data centers with this is extremely expensive.\nThat's where Spectrum-X comes in, Nvidia's new ethernet-based networking platform for AI. Single data ports can handle data speeds up to 800 gigabits per second with low latency, and they are still backward-compatible with slower Ethernet standards. This allows certain components to be upgraded without completely overhauling the data center's network infrastructure at once.\nNow, Spectrum-X is not the only solution like this on the market. Broadcom already has a similar offering, for example, but I think Nvidia is likely to gain significant market share here because its solution will \"play nice\" with Nivida chips. The components will be optimized to work at maximum capacity when used together. Nvidia is building an ecosystem that will reward clients for sticking with its products. This could easily be a multi-billion dollar revenue stream within a year or two.\nNividia committed itself to updating its flagship AI chip every year. That's quite a tall order and leaves little room for error. The company already seems to have slipped up.\nAfter a flaw was discovered in its Blackwell AI accelerator chips, the company announced there would be a delay in rolling them out. I think this is unlikely to have any significant impact on the company's bottom line. Its Hopper chips, which the Blackwells are intended to replace, are capable of meeting the current needs of its hyperscaler customers. Their sales will probably make up for any potential loss from the delayed Blackwell rollout.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $792,725!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of August 26, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Johnny Rice has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n3 Reasons to Buy Nvidia Stock Before Aug. 28 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-08-30T18:45:00.000Z",
        "Title": "The Best Chip Stock Post NVIDIA Earnings: NVDA, AMD or INTC?",
        "Author": "  Tirthankar Chakraborty ",
        "Text": "Wall Street darling NVIDIA Corporation NVDA recently reported its fiscal second-quarter results, following which its shares dipped. Does this mean that NVIDIA has lost its sheen to arch-rivals Advanced Micro Devices, Inc. AMD and Intel Corporation INTC in the semiconductor space? Or, does it still have the potential to increase shareholders’ wealth soon? Let’s examine – \nNVIDIA recently posted blowout second-quarter fiscal 2025 revenues and net income that easily surpassed analysts’ estimates. For the quarter ending on July 28, 2024, earnings per share for the chipmaker came in at $0.68, up 11% from the prior quarter and up 152% year over year.\nTotal reported revenues were $30 billion, up 15% from the previous quarter and 122% from a year ago. Revenues of each segment, such as data center, gaming, professional visualization, and robotics were up from the previous quarter and year.\nStrong demand for existing Hopper chips and shipping of next-generation Blackwell artificial intelligence (AI) chips to be launched later this year boosted NVIDIA’s quarterly results.\nHowever, despite such promising quarterly results, NVIDIA’s shares dipped 6.4% in Thursday’s trading and were 2.1% lower on Wednesday. This is because the performance expectations were much higher as the NVIDIA stock is currently the S&P 500’s best performer this year.\nThe share price drop at the moment is just a blip for NVIDIA. This is because if we look at the broader picture, with the Federal Reserve all set to trim interest rates in the September policy meeting, NVIDIA’s capital expenditure outlays on AI-related infrastructure are expected to increase.\nAI is a growing field, with the industry expected to expand from $214.6 billion in the current year to $1,339.1 billion by 2030, per MarketsandMarkets.\nWhile the Blackwell AI chip launch will give NVIDIA a competitive edge over its peers, its gaming graphic processing units (GPU) product line, GeForce, is expected to help NVIDIA penetrate the growing gaming market. NVIDIA’s initiative to enter the industrial metaverse space with the help of Siemens is also a tailwind for the company.\nLike NVIDIA, Advanced Micro Devices also makes semiconductors and is trying to enter the gaming space. However, NVIDIA is way ahead of Advanced Micro Devices, whose latest quarterly revenues were minuscule compared to that of NVIDIA. In the recently reported quarter, Advanced Micro Devices’ total revenues increased just 9% from a year ago.\nAdvanced Micro Devices is investing heavily in AI, but unlike NVIDIA, they are late to the party. Any AI investment takes a long period to generate returns on the invested capital. Moreover, Advanced Micro Devices hasn’t poured money into the necessary AI infrastructure, which can be an issue for the company in the long run.\nAnyhow, Advanced Micro Devices is losing the competition with NVIDIA. Per data from Jon Peddie Research, Advanced Micro Devices’ market shares in GPUs have fallen from 35% to 12% over the past decade, while NVIDIA’s shares have risen from 65% to 88%.\nWhile NVIDIA is in a league of its own, Intel is struggling to compete with Advanced Micro Devices, which has seen some progress in the production of high-performance processing machinery.\nIntel is in dire straits after failing to progress in the foundry business. Intel failed to make the most of the ever-expanding AI applications industry, where most of its peers are doing reasonably well.\nIntel’s server and networking segment is also being disrupted by Arm Holdings plc ARM. Many of ARM’s designs in the micro server segment have been accepted by Intel’s competitors. Intel’s shares never fully recovered from the dot-com bubble burst and currently has a Zacks Rank #4 (Sell). You can see the complete list of today’s Zacks #1 (Strong Buy) Rank stocks here.\nNVIDIA has generated profits more proficiently than Advanced Micro Devices and Intel. This is because the NVIDIA stock has a return on equity (ROE) of 124.6%, while Advanced Micro Devices and Intel have an ROE of 6% and 1.8%, respectively. As a thumb rule, any reading above 20% is considered very good.\nNVIDIA’s net profit margin is 55%, way more than Advanced Micro Devices and Intel’s 5.8% and 1.8%, respectively. Any reading above the threshold of 20% signifies the company has been able to keep operation costs under control and generate profit from sales. As a result, the $2.71 Zacks Consensus Estimate for NVIDIA’s earnings per share is up 74.8% year over year.\nImage Source: Zacks Investment Research\nFrom a technical perspective, the NVIDIA stock has been constantly trading above its 200-day moving average (DMA) so far this year, indicating a long-term uptrend.\nImage Source: Zacks Investment Research\nOn the other hand, the prices of Advanced Micro Devices and Intel have fallen below the 200 DMA this year, a tell-tale sign of a persistent downtrend.\nImage Source: Zacks Investment Research\nWith NVIDIA’s shares exhibiting a bullish trend and the stock faring much better than Advanced Micro Devices and Intel in the AI space and beyond, notable brokers have increased the average short-term price target of NVDA by 13.5% from the stock’s last closing price of $125.61. The analysts’ highest price target is at $200.\nImage Source: Zacks Investment Research\nHence, despite the recent hiccups, investors should hang on to the NVIDIA stock more than Advanced Micro Devices and Intel, as AI is here to stay (read more: 2 AI Stocks That Can Be the Next NVIDIA).\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nARM Holdings PLC Sponsored ADR (ARM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-08-07T20:13:00.000Z",
        "Title": "Nvidia stock falls 5%, chip stocks sink as Wall Street calls out 'tremendous opportunity' after sell-off",
        "Author": " Ines Ferré    · Senior Business Reporter",
        "Text": "Nvidia (NVDA) stock fell more than 5% on Wednesday, erasing gains from early in the session as chip stocks led the way lower during a trading session that saw all three major indexes close in red figures.\nThe sell-off in Nvidia and other chip names came despite a bullish note from Piper Sandler analysts published Wednesday, which pointed investors to a \"tremendous opportunity\" to buy some chip names following sector's recent sell-off.\n\"Fundamentally, NVDA remains the strongest player in the AI accelerator space,\" wrote Piper Sandler's Harsh Kumar, highlighting the company's next-generation chip. \"We also believe that strong tailwinds from the Blackwell architecture coming in October will continue to drive revenues well into 2025 as demand exceeds supply.\"\n\"As such,\" the firm added, \"we see tremendous opportunity in NVDA stock with the price off meaningfully from highs of $140.\" Piper has an Overweight rating and $140 price target on the stock.\nDuring Monday's market meltdown, The Information reported Nvidia's upcoming next-generation AI chips would be delayed by three months, potentially impacting its biggest customers like Microsoft, Alphabet, and Meta.\nSubsequently, Nvidia issued a statement stating its next-generation Blackwell chip \"production is on track to ramp\" in the second half of the year.\nAlong with Nvidia, Kumar said Advanced Micro Devices (AMD) remains a \"Top Pick\" for the firm as it gains share in the traditional server market amid struggles with incumbents like Intel. Intel (INTC) stock last Friday fell more than 28% following a poor quarterly report.\nPiper Sandler's team also sees an opportunity for AMD should Nvidia's chips turn out to be delayed.\n\"We believe there is not a lot of truth to the NVDA chip delay, but if it is true, near-term this would bode well for AMD if NVDA is struggling with supply and/or timing of chips,\" wrote Kumar. AMD stock fell 1% on Wednesday.\nLast week, Nvidia jumped more than 12% following peer AMD's quarterly results showing Big Tech continues to spend on data center infrastructure, a promising sign for chip suppliers.\nChip stocks have been volatile over the past few weeks as Big Tech names have led the market downturn.\nSince the start of July, the Philly Semiconductor Index is down almost 15%, a move that Piper said prompted it to revisit its coverage and look for \"ideas that we believe remain well-positioned fundamentally.\"\nAlong with Nvidia and AMD, the firm sees ON Semiconductor (ON) as well positioned in this environment.\nEarly Wednesday, chip stocks attempted a rebound that was punctuated by the recent market meltdown that sent the Nasdaq Composite (^IXIC) into correction territory.\nNvidia stock fell more than 6% on Monday as the \"Magnificent Seven\" stocks saw market cap losses of more than $650 billion during Monday's market plunge.\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on X at @ines_ferre.\n"
    },
    {
        "Date": "2024-08-05T13:00:17.000Z",
        "Title": "NVIDIA Corporation (NVDA) is Attracting Investor Attention: Here is What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Nvidia (NVDA) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this maker of graphics chips for gaming and artificial intelligence have returned -14.8%, compared to the Zacks S&P 500 composite's -2.9% change. During this period, the Zacks Semiconductor - General industry, which Nvidia falls in, has lost 13%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nNvidia is expected to post earnings of $0.64 per share for the current quarter, representing a year-over-year change of +137%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.1%.\nFor the current fiscal year, the consensus earnings estimate of $2.69 points to a change of +106.9% from the prior year. Over the last 30 days, this estimate has changed +0.3%.\nFor the next fiscal year, the consensus earnings estimate of $3.38 indicates a change of +25.8% from what Nvidia is expected to report a year ago. Over the past month, the estimate has changed +0.4%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Nvidia.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nIn the case of Nvidia, the consensus sales estimate of $28.24 billion for the current quarter points to a year-over-year change of +109%. The $117.82 billion and $152.66 billion estimates for the current and next fiscal years indicate changes of +93.4% and +29.6%, respectively.\nNvidia reported revenues of $26.04 billion in the last reported quarter, representing a year-over-year change of +262.1%. EPS of $0.61 for the same period compares with $0.11 a year ago.\nCompared to the Zacks Consensus Estimate of $24.33 billion, the reported revenues represent a surprise of +7.02%. The EPS surprise was +11.48%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nNvidia is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Nvidia. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-08-02T22:18:34.000Z",
        "Title": "Technical Analyst: NVIDIA Corp (NASDAQ:NVDA) Has ‘Triggered’ a ‘Sell Signal’",
        "Author": "  Fahad Saleem ",
        "Text": "We recently published a list of Top 10 Latest AI Stock News and Analyst Ratings. Since NVIDIA Corp (NASDAQ:NVDA) ranks 3rd on the list, it deserves a deeper look.\nThe much-feared correction in mega-cap tech stocks is here as investors keep pulling out of AI winners to pile into small-cap stocks as possible rate cuts from the Federal Reserve near. Brent Thill, Jefferies tech research analyst, recently said while talking to CNBC that we are seeing a rotation inside the tech industry where semiconductor and internet companies are performing well while software companies are underperforming. However, Thill reiterated his view that in the back half of the year things will start to change and tech companies will start their rebound. The analyst cited a few software earnings that suggest no signs of “demand cracks.” He said that many semiconductor stocks are now in the overbought territory.\nBrent Thill said the selloff has made software stocks more “attractive.”\nBut Thill also sees a broader rotation ongoing in the stock market, where sectors like financials and industrials are benefitting amid investor exodus from tech.\nAsked what is causing a sudden rebound in small-cap stocks, Thill said that interest rate cut expectations and a broader rotation out of mega-cap stocks have a role to play here, in addition to the M&A activity which has increased significantly recently.\nThill thinks the AI “payoff” time is still years away and companies are still at the beginning of the AI spending curve.\nFor this article we compiled the biggest AI news updates and analyst rating upgrades/downgrades around AI stocks over the past few days. With each stock we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nNumber of Hedge Fund Investors: 186\nRaymond James analyst Javed Mirza recently said in a report that NVDA has “triggered a mechanical sell signal” based on a moving average convergence/divergence indicator. In a technical analysis report, he stated that the stock is trading below its 50-day moving average and exhibiting early signs of selling pressure. This, according to Mirza, shows there is a looming corrective phase lasting 1-3 months. He added that a sustained break below the 50-day moving average could lead to a decline towards 94.94, representing a further 16.9% drop from current levels.\nNVIDIA Corp (NASDAQ:NVDA) rapid run and soaring valuation have started to make some circles on Wall Street uneasy. New Street Research recently downgraded the stock to Neutral from Buy and set the stock’s price target at $135.\n“We downgrade the stock to Neutral today, as upside will only materialize in a bull case, in which the outlook beyond 2025 increases materially, and we do not have the conviction on this scenario playing out yet.” New Street analyst Pierre Ferragu said.\nNYU professor and valuation guru Aswath Damodoran has also been skeptical about NVDA over the past several months, saying repeatedly that the stock looks overvalued. In March, when he was asked about his previous predictions (that proved wrong) about NVDA valuation, the professor said that either he has “no idea what I’m talking about” or it’s the market that just does not understand.\nAswath Damodoran at the time said that while Nvidia was in the “driving seat” of the AI bandwagon, its path to profits won’t be as easy as the market assumes.\nRecently, Oppenheimer’s Rick Schafer joined the NVIDIA Corp (NASDAQ:NVDA) chorus, raising the chipmaker’s price target to $150 from $110 following the 10-1 stock split.\nNVIDIA Corp (NASDAQ:NVDA) is one of the stocks accounting for a huge chunk of the total market returns, thanks to its AI-fueled rally that seems to have no end in sight. NVIDIA Corp (NASDAQ:NVDA) shares have gained about 174% over the past year.\nPatient Capital Opportunity Equity Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its Q2 2024 investor letter:\n“NVIDIA Corporation (NASDAQ:NVDA) continued to lead both the market and the portfolio, remaining a top performer in the period gaining 36.7%. Nvidia is the market leader in designing and selling Graphics Processing Units (GPU), which has recently benefited from the insatiable demand of artificial intelligence (AI) models. The company currently captures 92% market share of data center GPUs and grew revenue, earnings and free cash flow (“FCF”) an astounding 126%, 392%, and 610%, respectively, over the last year. While we expect competition to increase, we think NVDA can continue to maintain top market share. While many are concerned with backlog times shortening, we think the rollout of the B100, which promises 2.5x better performance for only 25% more cost, later this year will create more shortages. With leading edge technology, an increasing innovation cycle and strong cash generation, the company is well positioned for the increased adoption of artificial intelligence (AI).”\nOverall, NVIDIA Corp (NASDAQ:NVDA) ranks 3rd on Insider Monkey’s list titled Top 10 Latest AI Stock News and Analyst Ratings. While we acknowledge the potential of NVIDIA Corp (NASDAQ:NVDA), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    }
]