[
    {
        "Date": "2024-09-02T07:50:13.000Z",
        "Title": "NVIDIA Corporation (NVDA): This AI Stock Could Go Parabolic According to Financial Media",
        "Author": "  Usman Kabir ",
        "Text": "We recently compiled a list of the 10 AI Stocks That Could Go Parabolic According to Financial Media. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against the other AI stocks.\nOne of the primary growth drivers in the AI industry over the past few years has been the exponential increase in data generation. The rise of the Internet of Things (IoT), social media, e-commerce, and various digital platforms has led to an unprecedented surge in data production. This vast amount of data serves as the fuel for AI systems, particularly in the development of machine learning models. Clive Humby, a venture capitalist, emphasized the critical role of data in AI development by famously proclaiming that data is the new oil. The ability to collect, process, and analyze large datasets allows AI algorithms to improve accuracy and deliver more sophisticated outputs.\nRead more about these developments by accessing 33 Most Important AI Companies You Should Pay Attention To and 20 Industrial Stocks Already Riding the AI Wave.\nTo understand the AI revolution, it is also important to understand advancements in computing power. Moore’s Law, which predicts the doubling of transistors on a microchip approximately every two years, has played a crucial role in enhancing the processing power available for AI applications - consider companies like Taiwan Semiconductor Manufacturing and their advanced node processing. The advent of Graphics Processing Units (GPUs) and Tensor Processing Units (TPUs) - like the ones made popular by NVIDIA - has further accelerated AI development by enabling faster computation and more complex model training. Ray Dalio, founder of Bridgewater Associates, one of the largest hedge funds globally, says that these improvements in hardware have been a game-changer for AI.\nThe availability of massive investments in AI research and startups is also a key growth driver. According to a report by PwC, global investments in AI are expected to reach $15.7 trillion by 2030, with the technology contributing $6.6 trillion to GDP from increased productivity and $9.1 trillion from consumption effects. This influx of capital is spurring innovation and the commercialization of AI technologies across various sectors, from healthcare to finance. Prominent hedge fund managers are also taking note. Ken Griffin, the chief of Citadel Investment Group, says that AI is the most transformative technology of our time, and not just another bubble, but a structural shift in the economy.\nRead more about these developments by accessing Billionaire Stan Druckenmiller Is Betting On AI Infrastructure, Tobacco and Industrial Stocks and 10 Tech Stocks to Monitor Amid Market Volatility According to Bernstein Analyst..\nOur Methodology\nFor this article, we selected AI stocks that have explosive growth potential according to financial news outlets. These stocks are also popular among hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA close-up of a colorful high-end graphics card being plugged in to a gaming computer.\nNumber of Hedge Fund Holders: 179 \nNVIDIA Corporation (NASDAQ:NVDA) provides graphics, computing and networking solutions. Even though the company beat market expectations on earnings per share and revenue for the second fiscal quarter, the shares fell following the report. This was because there were concerns around the production ramp for the latest AI chips called Blackwell and a slowdown in data center growth during the second quarter, raising concerns about valuation and future volatility. This selloff happened despite the fact that the firm outlined $50 billion in share buybacks. However, market experts are forecasting a shift to robotics that could be a future growth driver for the tech giant as the AI boom fades away.\nWall Street analysts expect NVIDIA Corporation (NASDAQ:NVDA) to register parabolic growth in the coming months. Truist recently raised the price target on the stock to $148 from $145 and kept a Buy rating, noting that investors should look through the Blackwell fog and recognize that the company beat revenue and EPS expectations for the quarter and in the outlook, while the results and commentary reinforced leadership in AI as strong and persistent.\nOverall NVDA ranks 1st on our list of the AI stocks that could go parabolic according to financial media. While we acknowledge the potential of NVDA as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-09-29T01:57:29.000Z",
        "Title": "Jim Cramer on NVIDIA Corporation (NASDAQ:NVDA): “A $10 Trillion Stock”",
        "Author": "  Attiya Zainib ",
        "Text": "We recently published a list of Jim Cramer Stock Portfolio for Q4: Top 11 Stocks to Buy and Sell. Since NVIDIA Corporation (NASDAQ:NVDA) ranks 1st on the list, it deserves a deeper look.\nJim Cramer in a latest program on CNBC talked about the importance of using short-term rallies to your advantage. He said that investors should know when to take the chips off the table.\n“The idea that you should buy and hold through both the best of times and worst of times is probably incredibly foolish, with only very few exceptions,” Cramer said.\nCramer said that if the stock you bought is going higher and higher and you keep resisting the urge to take some profits, you won’t make any actual money from these gains if the stock comes down later paring all these profits. This seems straightforward but the idea of buying low and selling high is easier said than done, Cramer said.\n“Don’t get carried away by the optimism. Instead, keep your head on straight, check your emotions, focus on long term and think about ringing the register, especially on stocks that might be getting too high,” Cramer added.\nFor this article we watched several latest programs of Jim Cramer aired on CNBC and picked 10 stocks he’s talking about. We also picked an interesting prediction Cramer made back in 2021 about a stock and saw how it turned out. With each company we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nNumber of Hedge Fund Investors: 179\nIn December 2021, long before ChatGPT was launched or using trending words like “hyperscalers” or “LLM” was fashion, Jim Cramer made some prescient comments about the chipmaker during a program on CNBC.\n“I just went there and I saw things, I went time-traveling with Jensen Huang. I am being a pig in NVIDIA Corp (NASDAQ:NVDA) because this may be a $10 trillion stock.”\nBack then, NVDA was trading at around $29 and today it’s at $123.\nNvidia’s declines after the latest quarterly results were more or less expected amid Blackwell delay reports confirmed by management. However, the delays were mainly due to a change in Blackwell GPU mask. That does not affect the main functional logic or design of the chip, according to analysts. While Blackwell has been delayed for a few months, it does not change the core growth thesis for Nvidia.\nNvidia is set to see huge growth on the back of the data center boom amid the AI wave.\nAt Nvidia’s GPU Technology Conference in March 2024, CEO Jensen Huang estimated annual spending on data center infrastructure at about $250 billion. Over the next decade, this could total between $1 trillion and $2 trillion, depending on how long this level of investment continues. During the same Q&A session, Bank of America’s Vivek Arya echoed this estimate, suggesting the total addressable market would fall in the $1-2 trillion range, particularly as countries invest in their own AI infrastructure. By the end of the decade, spending could be at the high end of that range.\nOf course, Nvidia won’t dominate the entire $2 trillion opportunity, as it faces competition from companies like AMD and internally developed AI accelerators from Google, Amazon, and even Apple. Some analysts believe Nvidia’s data center market share between 2025 to 2029 will be over $950 billion—less than half of the total market—but still enough to make it the leader in the sector.\nIthaka US Growth Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its Q2 2024 investor letter:\n“NVIDIA Corporation (NASDAQ:NVDA) is the market leader in visual computing through the production of high-performance graphics processing units (GPUs). The company targets four large and growing markets: Gaming, Professional Visualization, Data Center, and Automotive. NVIDIA’s products have the potential to lead and disrupt some of the most exciting areas of computing, including: data center acceleration, artifi cial intelligence (AI), machine learning, and autonomous driving. The reason for the stock’s appreciation in the quarter was twofold: First, the stock benefi ted from tremendous excitement surrounding the further development of generative AI and the likelihood this would necessitate the purchase of a large number of Nvidia’s products far into the future; Second, Nvidia posted another strong beat[1]and-raise quarter, where the company upped its F2Q25 revenue guidance above Street estimates, showcasing its dominant position in the buildout of today’s accelerated computing infrastructure.”\nOverall, NVIDIA Corporation (NASDAQ:NVDA) ranks 1st on Insider Monkey’s list titled Jim Cramer Stock Portfolio for Q4: Top 11 Stocks to Buy and Sell. While we acknowledge the potential of NVIDIA Corporation (NASDAQ:NVDA), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-09-16T08:28:56.000Z",
        "Title": "Nvidia Stock vs. Palantir Stock: Wall Street Says Buy One and Sell the Other",
        "Author": "  Trevor Jennewine ",
        "Text": "Consultancy PwC estimates artificial intelligence (AI) will contribute more than $15 trillion to the global economy by 2030. Investors hoping to benefit are piling into AI stocks, and Nvidia (NASDAQ: NVDA) and Palantir Technologies (NYSE: PLTR) have been two of the most popular choices.\nIn the last two years, Nvidia shares surged 728%, and Palantir shares advanced 348%. But Wall Street analysts expect the stocks to move in opposite directions over the next 12 months, as detailed below:\nNvidia's median target of $150 per share implies 26% upside from its current share price of $119.\nPalantir's median target of $28 per share implies 20% downside from its current share price of $35.\nHere's what investors should know about these AI stocks.\nNvidia is best known for its graphics processing units (GPUs), chips that have become the industry standard in accelerating complex data center workloads such as training machine learning models and running AI applications. In March, Forrester Research wrote, \"Nvidia sets the pace for AI infrastructure worldwide. Without Nvidia GPUs, modern AI wouldn't be possible.\"\nHowever, the chipmaker is truly formidable because it provides a full-stack computing platform that comprises adjacent hardware, software, and services. Nvidia has secured leadership in generative AI networking gear, and its first server central processing unit (CPU) is ramping toward a multibillion-dollar product line, according to CEO Jensen Huang.\nLikewise, Nvidia says its software and services business will approach a $2 billion revenue run rate this year due to strength from its AI Enterprise offering. Nvidia AI Enterprise is a software platform that streamlines data preparation and model training, as well as the development and deployment of AI applications. The platform includes frameworks that address specific use cases, including conversational agents, recommender systems, and autonomous robotics.\nNvidia reported strong financial results in the second quarter of fiscal 2025 (ended July 2024). Revenue increased 122% to $30 billion on strong demand for AI hardware and software, and non-GAAP (generally accepted accounting principles) earnings surged 152% to $0.68 per diluted share. More importantly, the company is well positioned to maintain that momentum.\nNvidia's next generation of data center GPUs, called Blackwell, will ramp up later this year, and the market is rife with anticipation. Earlier this year, CEO Jensen Huang predicted, \"The Blackwell architecture platform will likely be the most successful product in our history.\"\nLooking ahead, Wall Street expects Nvidia's adjusted earnings to grow at 49% annually through fiscal 2026 (ends January 2026). That estimate makes the current valuation of 54 times adjusted earnings seem reasonable. Patient investors should consider purchasing a small position in Nvidia stock today.\nPalantir sells data analytics software. Its platforms help enterprises manage data, develop machine learning models, and integrate those digital assets into applications that improve decision-making. Palantir describes its core software products, Foundry and Gotham, as operating systems that connect data, decisions, and operations. Use cases range from managing supply chains to mitigating financial risk to optimizing manufacturing.\nLast year, Palantir added support for large language models and generative AI to Gotham and Foundry with AIP (Artificial Intelligence Platform). The company also reoriented its go-to-market strategy around the new product with AIP Bootcamps, instructional events where potential customers learn to use AIP on their own data in a matter of days.\nIn August, Forrester Research recognized Palantir as a leader among AI and machine learning platform vendors. Analysts wrote, \"Palantir is quietly becoming one of the largest players in this market.\" Palantir was awarded the highest score for its current product offering, but competitors Alphabet and C3.ai earned higher scores for their growth strategy.\nPalantir reported encouraging financial results in the second quarter. Its customer count increased by 41% to 593, and the average customer spent 14% more over the past year. In turn, revenue increased 27% to $678 million, the fifth sequential acceleration, and non-GAAP net income jumped 80% to $0.09 per diluted share.\nGoing forward, CEO Alex Karp expects the company to maintain its momentum. \"The persistent and unbridled demand for our software, for an effective enterprise platform that makes artificial intelligence capabilities useful to large institutions, shows no signs of relenting.\"\nThe problem is valuation. Wall Street forecasts adjusted earnings growth of 22% annually through 2025. That makes the current valuation of 109 times adjusted earnings look pricey. Personally, I agree with Wall Street. Palantir looks overvalued, and I would not be surprised to see a substantial correction in the future. Investors should consider trimming their positions.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $729,857!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of September 9, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Nvidia and Palantir Technologies. The Motley Fool has positions in and recommends Alphabet, Nvidia, and Palantir Technologies. The Motley Fool recommends C3.ai. The Motley Fool has a disclosure policy.\nNvidia Stock vs. Palantir Stock: Wall Street Says Buy One and Sell the Other was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-09-19T13:15:00.000Z",
        "Title": "Nvidia's CEO Has Sold Shares Virtually Every Trading Session Since Mid-June. Should Investors Follow Suit and Sell?",
        "Author": "  Geoffrey Seiler, The Motley Fool ",
        "Text": "Since the middle of June, Nvidia (NASDAQ: NVDA) CEO Jensen Huang has been selling shares of his company's stock during basically every trading session. That leads to an obvious question: If the company's CEO is dumping shares, should you be selling your shares, too?\nLet's dive into Huang's trades and see whether this could be a signal -- or not -- to sell the stock.\nHuang is selling his Nvidia shares through what's known as a Rule 10b5-1 plan, which is designed to allow company insiders to sell shares without being accused of illegally trading on material non-public information. Through these plans, company insiders give brokers set parameters as to when the insider wants them to sell shares. This can be based on certain price triggers and/or dates and set up to sell a certain dollar amount or number of shares.\nOnce established, the broker executes the plan following a designated cooling-off period. Insiders can make changes to the plan, but only during open insider trading windows and if they have no material non-public information that could impact the stock price.\nHuang's current 10b5-1 plan was established in March and revealed in a 10-Q filing in May. He arranged to sell 6 million shares (600,000 pre-split) by the end of March 2025.\nThe parameters of Huang's plan are pretty straightforward, as he sells 120,000 Nvidia shares each trading day. His first trade was June 13, and it appears his plan is about to be wrapped up. Through his sales, Huang will have pocketed over $700 million in cash.\nYes, that's a lot of shares sold and a lot of cash, but it's just a drop in the bucket for Huang, who owns over 860 million shares of Nvidia, even after this recent selling. Basically, he sold less than 1% of the shares he owned.\nGiven the gains that Huang, who has been CEO at Nvidia since 1993, has seen, no one can blame him for selling some shares to gain liquidity. His wealth is still very much tied to Nvidia.\nThe answer to this question comes down to each individual's circumstances. If you've seen huge gains in the stock over the past few years and Nvidia has become an outsized portion of your portfolio, it can be good portfolio risk management to lock in some gains. After all, every investment comes with risk, and Nvidia is no exception.\nAt this point, the biggest risk the company faces is future demand. There are still questions as to whether demand for the company's graphic processing units (GPUs) will soon peak and eventually decline as the race for artificial intelligence (AI) infrastructure cools. This very well could come down to how much other companies start benefiting from AI in the areas of software and other industries, as the infrastructure players can't be the only AI winners or the spending will eventually stop.\nFor now, though, there doesn't appear to be any let up for AI infrastructure spending. Cloud-computing operators are increasing their capital expenditure (capex) budgets, and companies such as Alphabet and Meta Platforms have indicated that there's more risk in under-investing in AI infrastructure and falling behind than in over-investing.\nAt the same time, as AI models advance, they need exponentially more computing power, which comes from Nividua's GPUs. For example, xAI's Grok large language model (LLM) went from using 20,000 GPUs for its second iteration to needing 100,000 for its third iteration, while Alphabet's Llama 4 is projected to need 10x as many GPUs as Llama 3. Meanwhile, Oracle CEO Larry Ellison recently said there was no end in sight to the need for computing power for AI training when asked on the company's most recent earnings call if there would be a shift to less compute-intensive AI inference.\nWhile there's a risk that future demand could eventually dry up, the comments from Nvidia's customers indicate that this isn't going to happen anytime soon. Nvidia remains the best-positioned company in the AI infrastructure buildout.\nI think Nvidia's stock is attractively priced at a forward price-to-earnings ratio (P/E) of about 29x next year's analyst estimates, given the robust growth still ahead, based on customers' comments. As such, I'm not worried by Huang's recent selling and would consider buying the stock.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $694,743!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of September 16, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Geoffrey Seiler has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, and Nvidia. The Motley Fool has a disclosure policy.\nNvidia's CEO Has Sold Shares Virtually Every Trading Session Since Mid-June. Should Investors Follow Suit and Sell? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-09-13T08:51:00.000Z",
        "Title": "Step Aside, Nvidia: Billionaires Are Selling It in Favor of 2 Other High-Growth Stock-Split Stocks",
        "Author": "  Sean Williams, The Motley Fool ",
        "Text": "Although artificial intelligence (AI) has been all the rage on Wall Street since 2023 began, excitement surrounding stock splits has given AI a run for its money this year.\nA stock split gives publicly traded companies the ability to superficially alter their share price and outstanding share count by the same magnitude. Splits are surface-scratching in the sense that they don't change a company's market cap or in any way affect underlying operating performance.\nAlthough there are two types of stock splits -- forward and reverse -- investors usually gravitate to companies conducting forward splits. This type of split is designed to lower a company's share price to make it more nominally affordable for investors who are unable to purchase fractional shares through their broker. Companies enacting forward splits are usually outpacing their competition from an execution and innovation standpoint.\nSince 2024 began, a little over a dozen leading businesses have announced or completed a stock split -- all but one of which was of the forward-split variety.\nHowever, the outlook for some of these premier stock-split stocks is mixed among Wall Street's brightest and richest investors. Based on the latest round of form 13F filings with the Securities and Exchange Commission, billionaires were decisive sellers of cutting-edge AI stock Nvidia (NASDAQ: NVDA) in the second quarter, but were avid buyers of two other high-growth stock-split stocks.\nFor three consecutive quarters, dating back to the start of October 2023, no fewer than seven billionaire money managers have reduced their respective stakes in Nvidia. The June-ended quarter featured seven billionaire sellers, including (total shares sold in parenthesis):\nKen Griffin of Citadel (9,282,018 shares)\nDavid Tepper of Appaloosa Management (3,730,000 shares)\nStanley Druckenmiller of Duquesne Family Office (1,545,370 shares)\nCliff Asness of AQR Capital Management (1,360,215 shares)\nIsrael Englander of Millennium Management (676,242 shares)\nSteven Cohen of Point72 Asset Management (409,042 shares)\nPhilippe Laffont of Coatue Management (96,963 shares)\nWith Nvidia completing its largest-ever forward split (10 for 1) in June, these billionaires might have chosen to ring the register and diversify their respective portfolios. But there looks to be more to this story than simple profit taking.\nAlthough Nvidia has undeniably benefited from its first-mover advantages as the standout supplier of AI graphics processing units (GPUs), competition is now coming at it from all angles.\nWith the debut of Nvidia's Blackwell chip delayed by at least three months due to reported design flaws and supply chain issues, and the company's prized H100 GPU backlogged, it should be relatively easy for external competitors like Advanced Micro Devices to find strong demand for their AI GPUs.\nMoreover, Nvidia's top customers are signaling an eventual reduced reliance on the AI kingpin. Its four largest clients by net sales are all developing AI GPUs that they plan to use in their data centers. Even with Nvidia's chips maintaining their computing advantage, the writing is on the wall that these customers intend to use their cheaper internally developed hardware.\nBillionaires might also be spooked by the persistent insider selling at Nvidia. While not all insider selling is necessarily nefarious (e.g., insiders sometimes sell stock to pay their tax bill), it is noteworthy that not one executive or board member has purchased shares on the open market since December 2020.\nLastly, billionaire asset managers might be concerned about what history tells us. Since the advent of the internet roughly three decades ago, every next-big-thing trend has worked its way through an early-stage bubble. It's unlikely that AI is going to be the exception.\nBut while billionaires were showing Nvidia to the door, they were busy scooping up shares of two other high-growth stock-split stocks.\nThe first stock-split stock that struck the fancy of six billionaire money managers during the second quarter is Super Micro Computer (NASDAQ: SMCI), a specialist in customizable rack server and storage solutions. These billionaire buyers were:\nIsrael Englander of Millennium Management (553,323 shares)\nJeff Yass of Susquehanna International Group (508,814 shares)\nKen Griffin of Citadel (98,752 shares)\nSteven Cohen of Point72 Asset Management (45,066 shares)\nRay Dalio of Bridgewater Associates (15,777 shares)\nCliff Asness of AQR Capital Management (1,040 shares)\nWith the stock catapulting to north of $1,200 during the first quarter, it's not in the least bit surprising to see Supermicro's board approving a 10-for-1 forward split, to take effect after trading ends on Sept. 30.\nHowever, the prospect of a stock split isn't the primary draw for billionaires to Supermicro. The lure is the seemingly insatiable demand from businesses wanting to be among the first to capitalize on the AI revolution by training large language models and running generative Ai solutions. To do so, they'll need the necessary infrastructure in place, which Supermicro can provide.\nThe company's operating results have also given billionaires reason to be excited. Net sales jumped 110% to $14.9 billion in fiscal 2024 (the company's fiscal year ends on June 30), and the midpoint of its guidance calls for $28 billion in net revenue for the current year. This forecast screams that demand is exceptional at the moment.\nBut it won't be an easy ride. With its use of Nvidia's H100 GPUs in its customizable data-center rack servers, and the H100 backlogged, Supermicro finds itself at the mercy of its suppliers.\nFurthermore, the company is the target of a short-seller report from Hindenburg Research, which has alleged accounting manipulation. Despite denying these allegations, management did delay the annual filing of its operating results, which did little to soothe investor concerns.\nDespite its relatively inexpensive valuation, Super Micro Computer has a lot to prove to Wall Street and investors.\nThe other stock-split stock that billionaires very clearly favored over Nvidia in the June-ended quarter is AI networking solutions and services providers Broadcom (NASDAQ: AVGO). Seven billionaire investors took the plunge in the second quarter, including:\nOle Andreas Halvorsen of Viking Global Investors (2,930,970 shares)\nJeff Yass of Susquehanna International Group (2,347,500 shares)\nIsrael Englander of Millennium Management (2,096,440 shares)\nKen Griffin of Citadel (1,880,740 shares)\nJohn Overdeck and David Siegel of Two Sigma Investments (1,332,230 shares)\nKen Fisher of Fisher Investments (865,090 shares)\nKeeping with the theme of this list, Broadcom also announced a 10-for-1 forward split (the first in the company's history), which was completed in mid-July.\nBroadcom's AI ties have certainly been the fuel behind its recent uptick in growth. In particular, the company's networking solutions are responsible for connecting large numbers of AI GPUs in order to reduce tail latency and maximize the computing potential of AI-accelerating hardware. Presumably, demand for its AI networking solutions will remain robust as long as businesses keep gobbling up AI GPUs.\nHowever, billionaires might be equally excited about Broadcom having a solid foundation that extends well beyond artificial intelligence. It generates a significant amount of revenue and profits from the wireless chips and accessories it provides for next-generation smartphones. And it's a key provider of optical components used in automated industrial equipment, as well as networking solutions for next-gen vehicles.\nLastly, billionaires might be impressed with the company's track record of earnings-accretive acquisitions. For example, the $69 billion purchase of cloud-based virtualization software company VMware in November 2023 perfectly positions Broadcom to be an important player in helping businesses with their private- and hybrid-cloud needs.\nWith a more diverse revenue stream than Nvidia or Super Micro Computer, Broadcom would be best-positioned to navigate an AI bubble-bursting event, should one occur.\nBefore you buy stock in Super Micro Computer, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Super Micro Computer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $716,375!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of September 9, 2024\nSean Williams has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy.\nStep Aside, Nvidia: Billionaires Are Selling It in Favor of 2 Other High-Growth Stock-Split Stocks was originally published by The Motley Fool\n"
    }
]