[
    {
        "Date": "2024-10-10T12:56:57.000Z",
        "Title": "Here’s Why Alphabet Inc (GOOG) is on the Bottom Performers List of Alphyn Capital Management",
        "Author": "  Soumya Eswaran ",
        "Text": "Alphyn Capital Management, an investment management firm, released its third-quarter 2024 investor letter. A copy of the letter can be downloaded here. The Master Account of the fund returned 8.9% net in the third quarter compared to 5.9% for the S&P500 Index. As of September 30, 2024, the top ten holdings accounted for approximately 71% of the portfolio, and approximately 9% of the portfolio was held in cash. In addition, please check the fund’s top five holdings to know its best picks in 2024.\nAlphyn Capital Management highlighted stocks like Alphabet Inc. (NASDAQ:GOOG) in its Q3 2024 investor letter. Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, offers various platforms and services operating through Google Services, Google Cloud, and Other Bets segments. The one-month return of Alphabet Inc. (NASDAQ:GOOG) was 4.83%, and its shares gained 16.23% of their value over the last 52 weeks. On October 9, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $163.06 per share with a market capitalization of $1.999 trillion.\nAlphyn Capital Management stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its Q3 2024 investor letter:\n\"Alphabet Inc.'s (NASDAQ:GOOG) solid quarterly performance, with revenue growth of 14% and improved margins improving from 29% to 32%, has been overshadowed by ongoing investor concerns regarding future capital expenditures for AI and antitrust risks.\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 165 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of the second quarter which was 165 in the previous quarter. While we acknowledge the potential of Alphabet Inc. (NASDAQ:GOOG) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Alphabet Inc. (NASDAQ:GOOG) and shared the list of trending AI stocks in October. In addition, please check out our hedge fund investor letters Q3 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-14T12:00:23.000Z",
        "Title": "Unlocking Intrinsic Value: Analysis of Alphabet Inc",
        "Author": "  GuruFocus News ",
        "Text": "In this article, we will take a look into Alphabet Inc's (NASDAQ:GOOGL) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 5 Warning Sign with META.\nAs of 2024-10-14, Alphabet Inc's intrinsic value as calculated by the Discounted Earnings model is $220.03. It's currently trading at a price of $163.24. Therefore, the margin of safety based on the DCF model is 25.81%. The company is modestly undervalued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Alphabet Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$7.04\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.1%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 21.80% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n121.55\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n126.72\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n220.03\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $148.13. This valuation indicates that the Alphabet Inc is fair valued, accompanied by a margin of safety of -10.2%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-10-10T13:45:10.000Z",
        "Title": "Why Alphabet (GOOGL) is a Top Growth Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\nDifferent than value or momentum investors, growth-oriented investors are concerned with a stock's future prospects, and the overall financial health and strength of a company. Thus, they'll want to focus on the Growth Style Score, which analyzes characteristics like projected and historical earnings, sales, and cash flow to find stocks that will see sustainable growth over time.\nAlphabet is one of the most innovative companies in the modern technological age. Over the last few years, the company has evolved from primarily being a search-engine provider to cloud computing, ad-based video and music streaming, autonomous vehicles, healthcare providers and others. In the online search arena, Google has a monopoly with more than 94% of the online search volume and market. Over the years, the company has witnessed increase in search queries, resulting from ongoing growth in user adoption and usage, primarily on mobile devices, continued growth in advertiser activity, and improvements in ad formats.\nGOOGL boasts a Growth Style Score of B and VGM Score of B, and holds a Zacks Rank #3 (Hold) rating. Its bottom-line is projected to rise 31.7% year-over-year for 2024, while Wall Street anticipates its top line to improve by 14%.\nOne analyst revised their earnings estimate upwards in the last 60 days, and the Zacks Consensus Estimate has increased $0.02 to $7.64 per share for 2024. GOOGL boasts an average earnings surprise of 9.6%.\nOn a historic basis, Alphabet has generated cash flow growth of 15.1%, and is expected to report cash flow expansion of 16.7% this year.\nInvestors should take the time to consider GOOGL for their portfolios due to its solid Zacks Rank rating, notable growth metrics, and impressive Growth and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-04T10:02:15.000Z",
        "Title": "Alphabet's Waymo to expand robotaxi fleet with Hyundai EVs",
        "Author": "  Abhirup Roy ",
        "Text": "By Abhirup Roy\nSAN FRANCISCO (Reuters) - Alphabet's Waymo will add electric vehicles from South Korea's Hyundai Motor to its robotaxi fleet, the companies said on Friday, as Waymo expands in the United States.\nOn-road testing for IONIQ 5 SUVs - assembled at Hyundai's Georgia facility and equipped with Waymo's autonomous technology - will begin by late 2025, they said.\nWaymo has about 700 vehicles in its fleet and is the only U.S. firm operating uncrewed robotaxis that collect fares.\nThe partnership with Hyundai comes days before Tesla CEO Elon Musk is set to unveil plans for a robotaxi product that is expected to use a custom-built vehicle. Musk may also discuss plans for his company to run a ride-hailing platform that will allow Tesla owners to list their vehicles when not in use.\nWaymo now uses I-PACE vehicles from Jaguar Land Rover, owned by India's Tata Motors. Waymo is also testing its technology using vehicles from Zeekr, the EV brand of China's Geely. A spokesperson for Waymo said the Hyundai partnership will not directly replace any of its current vehicle platforms.\nThis year, Waymo opened its service to everyone in San Francisco, without the need to join a waitlist, while expanding its operations in metro Phoenix. It also extended services to the San Francisco Peninsula and to certain parts of Los Angeles.\n\"The team at our new manufacturing facility is ready to allocate a significant number of vehicles for the Waymo One fleet as it continues to expand,\" Jose Munoz, global COO of Hyundai Motor said in a statement. \"We are actively exploring additional opportunities for collaboration.\"\nDespite widespread skepticism, tight regulatory scrutiny and federal investigations on AV technology, Alphabet said this year it was planning a multi-year $5 billion investment in Waymo.\nIn August, Waymo said it had doubled its paid rides to 100,000 per week in just over three months as it expanded its areas of service and allowed more people to ride its robotaxis.\nOthers in the race include General Motors' Cruise, which is testing cars with human safety drivers after an accident last year led it to pull all vehicles from the road, and Amazon's Zoox, which is expanding testing for its vehicles built without steering wheels and pedals.\n(Reporting by Abhirup Roy in San Francisco; Editing by Peter Henderson and Jacqueline Wong)\n"
    },
    {
        "Date": "2024-10-16T13:36:05.000Z",
        "Title": "Is Alphabet Inc. (GOOG) the Best Internet Content Stock to Buy?",
        "Author": "  Fatima Gulzar ",
        "Text": "We recently compiled a list of 10 Best Internet Content Stocks to Buy. In this article, we will look at where Alphabet Inc. (NASDAQ:GOOG) ranks among the best internet content stocks.\nAccording to Grand View Research, The global digital content creation market value stood at $25.6 billion in 2022 and is projected to grow at a CAGR of 13.5% from 2023 to 2030. In 2023, North America dominated the digital content market. The primary drivers are the increasing use of social media and the digital change occurring across different industries. According to a study by Kepios, 62.3% of individuals in the entire globe use social media. As of April 2024, the average daily usage is 2 hours and 23 minutes per this study. Kepios analysis reveals that the number of people using social media grew meaningfully during the first three months of 2024, and annual growth rates are still significantly more than 5%.\nContent creation is also being transformed by artificial intelligence. According to Custom Market Insights, the global market for AI-powered content creation was valued at $2.3 billion in 2024 and is projected to grow at a compound annual growth rate of 7.7% to reach USD 7.9 billion by 2033. Moreover, AI programs like GPT-4 are being used to generate graphics, music, and text. Gartner projects that 30% of all digital content will be artificial intelligence generated by 2025. This facilitates hyperpersonalization, which allows material to be personalized to specific consumers while also streamlining the content creation process.\nSecondly, the popularity of short-form video material is skyrocketing, emerging as a major trend in the content production industry. Platforms like Instagram Reels and TikTok have paved the way for this movement. In 2024, 85% of marketers anticipate short-form videos to be the most successful type of social media content, according to a HubSpot survey. The snackable aspect of this format makes it ideal for grabbing the attention spans of increasingly transient internet consumers.\nThirdly, digital content is projected to become more interactive in the future. Advancements in virtual reality (VR) and augmented reality (AR) are opening up greater opportunities for immersive experiences. The AR and VR market is expected to reach $1.5 trillion by 2030, according to a PwC report.\nIf we take a broader view, according to the PWC’s Global Entertainment & Media Outlook 2024-2028, there are a number of significant growth prospects in the industry, which is expected to reach US$3.4 trillion by 2028. Notwithstanding persistent upheavals and the necessity of reinventing company models, the industry presents substantial income opportunities. Growth is anticipated to be driven by advertising, with spending forecast to reach US $1 trillion by 2026 because of connected TV and internet advertisements. Due to market saturation, streaming services are being forced to investigate ad-supported business models and creative content. Revenues from gaming are predicted to surpass $300 billion by 2028, particularly in Asia Pacific. The industry is still thriving. Companies navigating shifting market dynamics will find more opportunities in high-growth regions and market categories.\nWe sifted through holdings of Internet Content ETFs and online rankings to form an initial list of 20 Internet Content stocks. Then we selected the 10 stocks that were the most popular among institutional investors. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q2 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here)\nNumber of Hedge Fund Holders: 165\nAlphabet Inc. (NASDAQ:GOOG), a holding company, owns all of Google, the biggest online company. Slightly less than 90% of the overall revenue generated by the California-based company is derived from the sales of adverts on Google services. Google services also include online advertisements and sales from Google’s platforms (Play Store sales and in-app purchases), devices (Chromebooks, Pixel smartphones, and smart home products like Chromecast), and subscription services (YouTube TV, YouTube Music, among others). Google Cloud, the company’s cloud computing platform, generates about 10% of Alphabet’s revenue. The remaining amount is derived from the company’s investments in cutting-edge technologies, such as Waymo, Google Fiber, and internet and health access.\nAlphabet Inc. (NASDAQ:GOOG) is viewed by analysts as a group of exceptional enterprises. It has become a dominant force in the technology industry, generating tens of billions of dollars in free cash flow annually, with offers ranging from self-driving vehicles and cloud computing to advertising. Despite antitrust concerns surrounding Alphabet’s main search business, investors remain confident in the company’s overall strength and believe it will maintain its leadership position in multiple industries, including search, artificial intelligence, video, and cloud computing.\nDiamond Hill Large Cap Strategy stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its Q2 2024 investor letter:\n“Among our top individual contributors in Q2 were Amazon, Texas Instruments and Alphabet Inc. (NASDAQ:GOOG). Media and technology company Alphabet also continued delivering strong results in its search, YouTube advertising, YouTube subscription and cloud businesses. Shares rose amid an environment that continues favoring mega-cap technology companies.”\nOverall GOOG ranks 4th on our list of the best internet content stocks to buy. While we acknowledge the potential of GOOG as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than GOOG but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure: None. This article is originally published on Insider Monkey.\n"
    }
]