[
    {
        "Date": "2024-02-15T18:23:27.000Z",
        "Title": "Why Alphabet Stock Stumbled Thursday Morning",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "Shares of Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) slipped on Thursday morning, falling as much as 3.8%. As of 12:32 p.m. ET, the stock was still down 2.7%.\nThe catalyst that sent the tech giant lower was troubling reports involving collisions within the company's Waymo self-driving car unit.\nReports emerged late yesterday that Waymo was forced to recall the software that controls its self-driving cars. The company noted that all the cars in its current fleet had been updated, but the cause of the recall was equal parts humorous and troubling.\nWaymo filed a voluntary recall report with the National Highway Traffic Safety Administration for software that had previously powered its fleet. The company cited two separate \"incidents\" that occurred in Phoenix, Arizona, on Dec. 11.\nIt seems that a Waymo self-driving car \"made contact\" (read \"crashed\") with a pickup truck that was being hauled by a tow truck. The company notes that the truck was being \"improperly towed,\" which caused it to consistently veer between lanes of traffic. Following the collision, the tow truck driver failed to stop, and another Waymo vehicle crashed into the pickup just moments later.\nThe company was quick to note that neither Waymo vehicle had passengers at the time, resulting in no injuries and only \"minor vehicle damage.\"\nSelf-driving cars have been making headlines in recent months -- and not in a good way. Earlier this month, a Waymo vehicle had a collision with a cyclist in San Francisco, who suffered only minor injuries. A week later, a crowd surrounded and set fire to a Waymo vehicle in the same city -- presumably in response to the earlier incident, though the matter is still under investigation.\nThis all comes just months after General Motors recalled all 950 of its Cruise robotaxis. A pedestrian, who was the victim of a hit-and-run accident, had been catapulted into an adjacent lane where they were struck by a Cruise self-driving car and dragged after the vehicle wasn't able to stop.\nSelf-driving cars don't move the needle for Alphabet, but some investors believe the technology has the potential to be a significant growth driver in the future.\nThere are plenty of reasons to buy Alphabet stock, but it's clear self-driving isn't yet ready for prime time.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy.\nWhy Alphabet Stock Stumbled Thursday Morning was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-27T12:00:14.000Z",
        "Title": "Alphabet (NASDAQ:GOOGL) Has A Rock Solid Balance Sheet",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Howard Marks put it nicely when he said that, rather than worrying about share price volatility, 'The possibility of permanent loss is the risk I worry about... and every practical investor I know worries about.' It's only natural to consider a company's balance sheet when you examine how risky it is, since debt is often involved when a business collapses. As with many other companies Alphabet Inc. (NASDAQ:GOOGL) makes use of debt. But the more important question is: how much risk is that debt creating?\nGenerally speaking, debt only becomes a real problem when a company can't easily pay it off, either by raising capital or with its own cash flow. If things get really bad, the lenders can take control of the business. While that is not too common, we often do see indebted companies permanently diluting shareholders because lenders force them to raise capital at a distressed price. Of course, the upside of debt is that it often represents cheap capital, especially when it replaces dilution in a company with the ability to reinvest at high rates of return. The first thing to do when considering how much debt a business uses is to look at its cash and debt together.\n Check out our latest analysis for Alphabet \nThe chart below, which you can click on for greater detail, shows that Alphabet had US$12.9b in debt in December 2023; about the same as the year before. However, its balance sheet shows it holds US$110.9b in cash, so it actually has US$98.0b net cash.\nAccording to the last reported balance sheet, Alphabet had liabilities of US$81.8b due within 12 months, and liabilities of US$37.2b due beyond 12 months. Offsetting this, it had US$110.9b in cash and US$48.0b in receivables that were due within 12 months. So it actually has US$39.9b more liquid assets than total liabilities.\nThis surplus suggests that Alphabet has a conservative balance sheet, and could probably eliminate its debt without much difficulty. Succinctly put, Alphabet boasts net cash, so it's fair to say it does not have a heavy debt load!\nAlso good is that Alphabet grew its EBIT at 18% over the last year, further increasing its ability to manage debt. There's no doubt that we learn most about debt from the balance sheet. But it is future earnings, more than anything, that will determine Alphabet's ability to maintain a healthy balance sheet going forward. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\nFinally, while the tax-man may adore accounting profits, lenders only accept cold hard cash. While Alphabet has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance. During the last three years, Alphabet generated free cash flow amounting to a very robust 81% of its EBIT, more than we'd expect. That puts it in a very strong position to pay down debt.\nWhile we empathize with investors who find debt concerning, you should keep in mind that Alphabet has net cash of US$98.0b, as well as more liquid assets than liabilities. And it impressed us with free cash flow of US$69b, being 81% of its EBIT. So we don't think Alphabet's use of debt is risky. Over time, share prices tend to follow earnings per share, so if you're interested in Alphabet, you may well want to click here to check an interactive graph of its earnings per share history.\nIf, after all that, you're more interested in a fast growing company with a rock-solid balance sheet, then check out our list of net cash growth stocks without delay.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-24T19:49:31.000Z",
        "Title": "Alphabet (NASDAQ:GOOGL): Undervalued and Overlooked Magnificent Seven Stock",
        "Author": "  TipRanks ",
        "Text": "Magnificent Seven stocks have attracted plenty of buzz as investors gravitate toward their vast market share and exceptional returns. Every Magnificent Seven stock has more than doubled over the past five years. These assets have significantly outperformed the market during that time. However, Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) has been a largely underappreciated stock.\nThe corporation has amassed a $1.75 trillion market cap and is up by 56% over the past year. Still, that gain falls behind most of the Magnificent Seven stocks. New opportunities and a good valuation can help Alphabet gain momentum and accumulate long-term returns for investors. Those catalysts make me bullish on the stock.\nAlthough the company owns the largest search engine in the world, it’s fallen behind the Magnificent Seven stocks in recent years. These are the one-year and five-year returns for each stock within the cohort.\nOne-year returns:\nNvidia: 223%\nMeta Platforms: 171%\nAmazon: 77%\nMicrosoft: 58%\nAlphabet: 56%\nApple: 22%\nTesla: -2%\nFive-year returns:\nNvidia: 1,579%\nTesla: 882%\nApple: 320%\nMicrosoft: 260%\nMeta Platforms: 187%\nAlphabet: 157%\nAmazon: 106%\nThese are still impressive returns and outpace the S&P 500 (SPX) and Nasdaq 100 (NDX). However, Alphabet has been outclassed by every Magnificent Seven stock except Amazon (NASDAQ:AMZN) over the past five years.\nWhile the stock has underperformed its peers within the cohort, Alphabet has a better valuation than most tech companies. The stock trades at a 24.5 P/E ratio and has solid profit margins. The company’s net profit margin usually exceeds 20% and should get a big boost in future quarters.\nAlphabet has three components on its side: rising revenue, more profits, and cost-cutting measures. The tech giant reported 13% year-over-year revenue growth and 51.8% year-over-year net income growth in Q4 2023. Alphabet’s efforts to trim its workforce contributed to higher margins and seem to be ongoing.\nA contributing factor to Alphabet’s rising net income is the recent profitability of Google Cloud. The cloud computing segment has been taking up a larger percentage of revenue and attributed to more than 10% of Q4-2023 revenue. Google Cloud generated $9.2 billion of the company’s $86.3 billion in revenue. Google Cloud swung from a $186 million operating loss in Q4 2022 to generating $864 million in operating income in Q4 2023.\nGoogle Cloud’s margins should improve significantly in future quarters and reduce the company’s P/E ratio by increasing its earnings.\nWhile it’s nice to see Alphabet expanding in other verticals, it’s no secret that advertising is the main engine for this corporation. Advertising sales slowed down in 2022 but came back to life in 2023. Its fourth-quarter results further highlight this fact and suggest that Alphabet has more to gain.\nThe fourth quarter featured $76.3 billion in Google Services revenue. This segment mainly consists of the company’s advertising and grew by 12.5% year-over-year. Advertising should receive an additional boost from the Olympic Games and the upcoming Presidential Election.\nHigher advertising revenue also translates into more profits. While the same can be said about most businesses, Alphabet achieved a 35.0% operating margin with its Google Services segment in Q4.\nAmong the Magnificent Seven stocks, Nvidia (NASDAQ:NVDA) and Microsoft (NASDAQ:MSFT) are the clear leaders in the artificial intelligence industry. However, Alphabet is also poised to gain a meaningful slice of the pie by using its existing technology and making new investments.\nAlphabet recently launched Gemini in a bid to bolster its AI presence. The tech firm also invested over $2 billion into an OpenAI competitor. Alphabet has been using artificial intelligence to improve its search results and cloud platform, but these investments represent the next steps to gain market share.\nAlphabet can close the gap in the AI race with Microsoft. The company started Google Cloud two years after Amazon got a head start with Amazon Web Services. Now, Google Cloud is a critical component of the company’s business. Alphabet has invested in many ventures known as Other Bets that are growing at a high rate. While this segment makes up a small part of total revenue, it’s worth monitoring the collection of businesses under the umbrella term.\nMost analysts are bullish on Alphabet stock. The stock sports 29 Buys and eight Hold ratings from analysts, giving it a Strong Buy consensus rating. The average GOOGL stock price target of $164.59 implies 14.3% upside potential.\nAlphabet is an under-the-radar stock (relatively) due to the impressive performances of other Magnificent Seven stocks. The tech giant has outperformed the market but has underperformed most of the corporations in its cohort.\nRising revenue and profits from advertising and cloud computing present a great opportunity. Alphabet also seems determined to gain more market share in artificial intelligence, which is a great long-term move for the corporation.\nDisclosure\n"
    },
    {
        "Date": "2024-02-16T14:35:00.000Z",
        "Title": "Alphabet (GOOGL) Boosts YouTube TV With Shortcut Feature",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL Google recently rolled out the “Last Channel Shortcut” feature for YouTube TV users.Notably, the shortcut feature enables users to easily switch between their last-viewed channels, allowing them to do so without interacting with the on-screen UI.Further, the feature pops up with a small animation and a message and can be accessed by long-pressing the \"Select\" or \"OK\" button on their remote. It works across live, on-demand and DVR content.The company also partnered with Roku ROKU to bring this feature to all Roku devices.Alphabet is likely to expand its YouTube TV subscriber base on the back of its latest move.\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nApart from the “Last Channel Shortcut” feature, Alphabet introduced the \"Build a Multiview\" feature for YouTube TV, allowing users to create their own combos with up to four pre-selected games, exclusively for subscribers with NBA League Pass and can be accessed from the Home tab.The company also extended its Roku partnership to bring a clock icon in the live guide of all Roku devices. The clock is a convenient addition that was commonplace among traditional TV services.Alphabet also launched a new Channel Guide for YouTube TV, aligning with Google TV's Live tab. The new feature enables users to view free built-in channels from the Live tab, allowing them to inject their favorite channels into the page.Further, Google, via YouTube TV, recently partnered with Peloton Interactive’s PTON streaming service platform, Peloton Entertainment, in a bid to expand its subscriber base.Per the terms of the partnership, Peloton All-Access members can stream their favorite television content from their Peloton Bike, Peloton Row or Peloton Tread. It would also require Peloton All-Access members to have a YouTube TV subscription.All the above-mentioned endeavors will likely strengthen the company’s footing in the global video streaming space, presenting a significant growth opportunity for Alphabet.Per a Fortune Business Insights report, the video streaming market is expected to reach $1.9 trillion by 2030, indicating a CAGR of 19.3% between 2023 and 2030.Moreover, growing momentum in YouTube TV will aid Alphabet in competing well with industry peers like Disney DIS, which is also making concerted efforts to capitalize on the growth opportunities in the video streaming space.Disney is riding on the success of its streaming service business, Hulu.Notably, the company’s Hulu Plus Live TV offers East and West Coast feeds for various channels, allowing viewers in the West to watch with their friends in the East.Recently, Hulu partnered with Fox News to bring Fox Weather on Hulu Plus Live TV, expanding the Live TV platform’s 95-channel core lineup.\nGrowing YouTube TV efforts will likely aid this Zacks Rank #3 (Hold) company to bolster its Google Services segment, which remains the key growth driver for the company. Its shares have rallied 51.3% in the past year compared with the Zacks Computer & Technology sector’s growth of 48%.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.In the fourth quarter of 2023, Google Services revenues increased 12.5% year over year to $76.31 billion, accounting for 88.4% of total revenues.The strengthening Google Services segment will likely bolster the company’s overall top-line performance in the near term.The Zacks Consensus Estimate for first-quarter 2024 revenues is pegged at $65.88 billion, indicating growth of 13.5% year over year.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Walt Disney Company (DIS) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nRoku, Inc. (ROKU) : Free Stock Analysis Report\nPeloton Interactive, Inc. (PTON) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-06T10:01:00.000Z",
        "Title": "Alphabet's AI Model Gemini Can Do a Lot. Here's What Could Be Most Valuable.",
        "Author": "  Adria Cimino, The Motley Fool ",
        "Text": "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has spent about eight years focusing on artificial intelligence (AI), a market forecast to soar in the double digits this decade. This technology may revolutionize everything from work to daily life, making it an area tech companies can't ignore.\nLate last year, Alphabet took a particularly big step forward in the area of AI. The technology giant introduced Gemini, its strongest AI model yet and one that could help the company progress across its businesses, from Google Search to cloud computing. In fact, Alphabet says it's integrating Gemini in all of its products and services. Gemini can indeed do a lot -- from powering features in the company's Pixel 8 Pro smartphone to offering developers a building platform.\nBut, for Alphabet, Gemini and the company's overall AI work may be most valuable in one particular area.\nAs mentioned above, Alphabet has more than one business. The company offers clients cloud computing services through Google Cloud and also sells hardware such as phones and watches. But Alphabet's biggest business of all -- and the one most people are probably familiar with -- is Google Search.\nGoogle holds a 91% share of the worldwide search market, leaving even its closest rival, Microsoft's Bing, in the dust with a share of less than 4%. This leadership isn't likely to end thanks to Alphabet's solid moat, or competitive advantage, which is its comfortable position in our daily routines. Proof of that is its entrance into our language -- when you don't know something, the common reflex is to say, \"I'll Google it.\"\nNow, let's get back to Gemini and where it could be most valuable for Alphabet -- and that's in the area of search. The company has made the smart decision to aggressively work to improve its search engine and not just ride those waves of success.\nAlphabet has started to experiment with Gemini in search, and the result is it's speeding up the company's Search Generative Experience (SGE). With Gemini on board, search latency has dropped 40% in the English language, and that means searches are considerably faster.\nThe tech giant has been developing SGE as a search platform using generative AI -- so that when you search for something, you're immediately served a general overview of the particular topic, along with links to find more in-depth information and different perspectives. All of this offers you the opportunity to gain a broader knowledge of the topic you're interested in and discover a wider range of content related to it.\nToday, Alphabet generates most of its revenue through Google advertising, with businesses aiming to sell their products or services to users as they use the search engine. In the most recent quarter, Google advertising represented 75% of total revenue.\nAI, by making searches faster and better, will keep users loyal, ensuring advertisers will keep coming back. Gemini is also directly helping advertisers build better ad campaigns through an AI-powered chat experience.\nOf course, this new AI model also may help Alphabet score wins across its businesses and lift revenue in both its cloud and hardware segments. But considering the company's leadership in search and the ad revenue linked to that, search is where Gemini truly could make its mark, becoming a key element to drive future revenue growth.\nWhat does this mean for investors? Alphabet has a solid track record of earnings increases and has displayed dominance in the search business and growth in its other businesses over time.\nAnd even in difficult economic environments, such as the past two years, revenue has gained.\nAt the same time, the shares trade for only 21x forward earnings estimates, down from 30 a year ago, a bargain considering the whole picture. And that's why today is a great time to buy Alphabet -- and benefit as Gemini makes the company's top business even better.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool has a disclosure policy.\nAlphabet's AI Model Gemini Can Do a Lot. Here's What Could Be Most Valuable. was originally published by The Motley Fool\n"
    }
]