[
    {
        "Date": "2024-03-13T13:00:15.000Z",
        "Title": "Alphabet Inc. (GOOGL) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet (GOOGL) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nShares of this internet search leader have returned -4.6% over the past month versus the Zacks S&P 500 composite's +3.2% change. The Zacks Internet - Services industry, to which Alphabet belongs, has lost 5.7% over this period. Now the key question is: Where could the stock be headed in the near term?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nAlphabet is expected to post earnings of $1.49 per share for the current quarter, representing a year-over-year change of +27.4%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.6%.\nThe consensus earnings estimate of $6.77 for the current fiscal year indicates a year-over-year change of +16.7%. This estimate has changed +0.2% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $7.75 indicates a change of +14.5% from what Alphabet is expected to report a year ago. Over the past month, the estimate has changed -0.3%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nRevenue Growth Forecast\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Alphabet, the consensus sales estimate for the current quarter of $65.95 billion indicates a year-over-year change of +13.6%. For the current and next fiscal years, $286.48 billion and $318.3 billion estimates indicate +11.7% and +11.1% changes, respectively.\nLast Reported Results and Surprise History\nAlphabet reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago.\nCompared to the Zacks Consensus Estimate of $70.77 billion, the reported revenues represent a surprise of +2.19%. The EPS surprise was +2.5%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-13T13:00:10.000Z",
        "Title": "Is It Time To Consider Buying Alphabet Inc. (NASDAQ:GOOGL)?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Alphabet Inc. (NASDAQ:GOOGL) received a lot of attention from a substantial price movement on the NASDAQGS over the last few months, increasing to US$154 at one point, and dropping to the lows of US$129. Some share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price. A question to answer is whether Alphabet's current trading price of US$139 reflective of the actual value of the large-cap? Or is it currently undervalued, providing us with the opportunity to buy? Let’s take a look at Alphabet’s outlook and value based on the most recent financial data to see if there are any catalysts for a price change.\n See our latest analysis for Alphabet \nGood news, investors! Alphabet is still a bargain right now. According to our valuation, the intrinsic value for the stock is $211.45, which is above what the market is valuing the company at the moment. This indicates a potential opportunity to buy low. However, given that Alphabet’s share is fairly volatile (i.e. its price movements are magnified relative to the rest of the market) this could mean the price can sink lower, giving us another chance to buy in the future. This is based on its high beta, which is a good indicator for share price volatility.\nFuture outlook is an important aspect when you’re looking at buying a stock, especially if you are an investor looking for growth in your portfolio. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. With profit expected to grow by 48% over the next couple of years, the future seems bright for Alphabet. It looks like higher cash flow is on the cards for the stock, which should feed into a higher share valuation.\nAre you a shareholder? Since GOOGL is currently undervalued, it may be a great time to increase your holdings in the stock. With an optimistic outlook on the horizon, it seems like this growth has not yet been fully factored into the share price. However, there are also other factors such as capital structure to consider, which could explain the current undervaluation.\nAre you a potential investor? If you’ve been keeping an eye on GOOGL for a while, now might be the time to enter the stock. Its prosperous future outlook isn’t fully reflected in the current share price yet, which means it’s not too late to buy GOOGL. But before you make any investment decisions, consider other factors such as the track record of its management team, in order to make a well-informed investment decision.\nSince timing is quite important when it comes to individual stock picking, it's worth taking a look at what those latest analysts forecasts are. At Simply Wall St, we have the analysts estimates which you can view by clicking here.\nIf you are no longer interested in Alphabet, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-04-01T11:00:00.000Z",
        "Title": "Better AI Buy: Microsoft vs. Alphabet Stock",
        "Author": "  Jeremy Bowman and Anders Bylund, The Motley Fool ",
        "Text": "After the launch of ChatGPT, Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) emerged as top rivals, and that battle has persisted. Microsoft has aligned itself with ChatGPT parent OpenAI, while Alphabet has sought to challenge its leadership with products like Bard and later Gemini. So which artificial intelligence (AI) stock is the better buy?\nJeremy Bowman (Microsoft): The question of whether to build or buy is a common one in technology, and in generative AI, Microsoft and Alphabet have largely gone in different directions in this regard.\nMicrosoft has tied its fortunes to OpenAI, the ChatGPT parent, through a reported $13 billion investment, and that has enabled Microsoft to essentially use OpenAI's technology as its own. As a result, the tech giant has been able to implement OpenAI's technology in products like its Azure cloud infrastructure services, GitHub code repository, Office productivity suite, and Bing search engine.\nThose moves are already having an impact as Microsoft said that AI added 6 percentage points to Azure's growth in the most recent quarter.\nMicrosoft's diversification also acts as a competitive advantage here. Unlike Alphabet, which makes a majority of its revenue from search advertising, Microsoft has a wide array of products that span enterprise software, video games, cloud computing, social media, and more, and that gives it more opportunities to leverage the power of AI.\nMicrosoft has also been more aggressive in AI than Alphabet has. CEO Satya Nadella has apparently been planning for this moment for years, as Microsoft first invested in back in 2019.\nAlphabet has also been investing in AI for several years, but the company has been more hesitant to release new products, and when it has it hasn't always gone well. The initial presentation for Bard was sloppy and widely panned, and Gemini has been criticized for historical inaccuracies.\nMicrosoft shows no intention of slowing down in AI; it just hired Deepmind co-founder Mustafa Suleyman, who also co-founded the recently shuttered Inflection AI. Microsoft stock may be expensive, but it deserves to trade at a premium. It will be hard to catch the AI leader.\nAnders Bylund (Alphabet): I have nothing but respect for Microsoft, but Redmond's finest can't measure up to Alphabet's ultimate long-term planning.\nAlphabet's visionary approach and unwavering commitment to pushing the boundaries of innovation make it a compelling choice for investors seeking long-term growth. The company's core business -- online search and advertising under the Google banner -- dominates the search engine market. However, Alphabet's ambitions extend far beyond search, with the company consistently investing in cutting-edge technologies that have the potential to reshape entire industries.\nOne such area is artificial intelligence, where Alphabet's research and development efforts have produced groundbreaking advancements. From natural language processing to computer vision, Alphabet's AI technologies are being applied in diverse fields, from healthcare research to self-driving vehicles.\nMoreover, Alphabet's commitment to moonshot projects through its X division showcases its willingness to take calculated risks in pursuit of revolutionary innovations. Projects like Intrinsic, Alphabet's industrial robotics project, and Loon, which aims to provide internet access to remote areas via high-altitude balloons, exemplify the company's audacious vision and long-term thinking.\nLong story short, Alphabet is ready to roll with the punches as the tech market evolves. Furthermore, the stock is much more affordable than Microsoft, whose stock has soared on the wings of its deep OpenAI partnership. You can pick up Alphabet shares at the reasonable price of 6 times sales or 27 times free cash flow today. Double those numbers to get an estimate of Microsoft's ratios.\nIn my view, Microsoft's stock looks overdue for a correction while Alphabet is getting ready to run higher. That's an easy choice.\nWhere to invest $1,000 right now\nWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.*\nThey just revealed what they believe are the 10 best stocks for investors to buy right now… and Microsoft made the list -- but there are 9 other stocks you may be overlooking.\nSee the 10 stocks\n*Stock Advisor returns as of March 25, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Anders Bylund has positions in Alphabet. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nBetter AI Buy: Microsoft vs. Alphabet Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-22T09:50:00.000Z",
        "Title": "Billionaire David Tepper Is Selling Alphabet and Nvidia Hand Over Fist, but Is Buying These \"Magnificent Seven\" Stocks",
        "Author": "  Keith Speights, The Motley Fool ",
        "Text": "Billionaire David Tepper likes artificial intelligence (AI) stocks -- the bigger, the better. Pick a megacap AI stock, and there's a pretty good chance that it's in the portfolio of his hedge fund, Appaloosa Management.\nTepper isn't as big of a fan of some of these stocks as he is of others, though. The successful hedge fund manager has been selling shares of Nvidia (NASDAQ: NVDA) and Google parent Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) hand over fist, but he has been buying two other \"Magnificent Seven\" stocks.\nIn the fourth quarter of 2023, Tepper slashed Appaloosa's stake in Nvidia by nearly 23%. While the GPU maker still ranks as the hedge fund's fourth-largest holding, Tepper clearly isn't as bullish about it as he once was.\nWhy would the billionaire sell such a big chunk of his position in Nvidia? The most likely answer is its valuation. Nvidia's share price skyrocketed by nearly 240% last year. Tepper could have been concerned, as quite a few other investors were, that the stock's valuation was becoming frothy.\nAppaloosa also reduced its stake in Alphabet by more than 16%. Again, Tepper hasn't thrown in the towel on the tech giant. Alphabet remains the seventh-largest position in his hedge fund.\nValuation probably wasn't the overriding factor behind the decision to sell some of the stake in Alphabet. It's possible, though, that Tepper might have been concerned that Alphabet's revenue from Google Search could be threatened by the development of AI-powered virtual assistants.\nSo which Magnificent Seven stocks is Tepper more enthusiastic about? He added to Appaloosa's stakes in two of them.\nAmazon (NASDAQ: AMZN) already ranked as Appaloosa's third-biggest holding. In Q4, the hedge fund added another 200,000 shares, increasing its stake by more than 5%.\nIt's not hard to think of reasons why Tepper might have decided to invest more heavily in the e-commerce and cloud services leader. Its profitability has been improving significantly, and Tepper could expect this trend to continue in 2024.\nHe also remains a fan of Microsoft (NASDAQ: MSFT). The technology giant held the No. 2 spot in Appaloosa's portfolio going into Q4. During the quarter, Tepper bought an additional 65,000 shares of Microsoft -- enough to boost the hedge fund's stake by nearly 4%.\nMicrosoft continues to fire on all cylinders. The company's integration of OpenAI's GPT-4 model throughout its product lineup appears to be paying off handsomely. Customers are flocking to Microsoft's Azure cloud platform and the AI tools that it offers. Microsoft's acquisition of Activision Blizzard also puts it in a stronger position in the gaming market.\nWere these buy-and-sell transactions of Magnificent Seven stocks smart moves on Tepper's part? So far, the verdict is mixed.\nBoth stocks that Appaloosa sold have risen since the end of Q4. Nvidia has soared by nearly 80%, while Alphabet is up close to 6%. Adding to his fund's stakes in Amazon and Microsoft, though, has paid off: Each has jumped by a double-digit percentage thus far in 2024.\nI wouldn't be surprised if the valuations of Nvidia and Microsoft eventually catch up with them. However, any sell-off of those stocks would likely only be temporary.\nMy view is that Tepper -- and other investors -- would be wise to scoop up more shares of all four of these Magnificent Seven stocks on pullbacks. I expect that AI will serve as a major long-term tailwind for each of them.\nShould you invest $1,000 in Amazon right now?\nBefore you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 21, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nBillionaire David Tepper Is Selling Alphabet and Nvidia Hand Over Fist, but Is Buying These \"Magnificent Seven\" Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-21T15:20:00.000Z",
        "Title": "Alphabet (GOOGL) Boosts Healthcare Efforts With Latest AI Move",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL division Google revealed a few of its latest AI-backed efforts to deepen its penetration into the multi-trillion healthcare industry at its annual health event, which took place in New York City.Reportedly, a new AI feature powered by the company’s advanced AI model called Gemini is being developed by Google Research and Fitbit. The feature will help train Fitbit users on their personal health by leveraging data collected from their wristbands.Further, the search giant intends to provide AI-powered screenings for tuberculosis, lung cancer and breast cancer in India in collaboration with Apollo Radiology International. This initiative, which is currently subject to regulatory approvals, is meant to deliver 3 million free scans over the next 10 years.Google is also making efforts to enhance health information on its search engine and YouTube.\n \nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nThe latest initiatives are in sync with Alphabet’s aggressive efforts to revolutionize the healthcare industry with the help of AI.Apart from these endeavors, Google recently launched Vertex AI Search for Healthcare, a generative AI-powered tool intended for the healthcare industry. The tool utilizes generative AI to assist clinicians search for information from patient notes, scanned documents and other clinical data. The tool's understanding of medical terminology and specific data points provides transparency and reduces hallucinations.Further, the company’s launch of MedLM, a family of generative AI models designed for the healthcare industry, remains a major positive. These models offer medical documentation testing, drug development research and chatbot provider identification.Google intends to expand MedLM capabilities with MedLM for Chest X-rays to help with their classification for operational, screening and diagnostics use cases, and a Condition Summary feature to enhance task-specific API capabilities.The company also offers Healthcare Data Engine, which provides interoperable patient data and clinical insights in FHIR format.The above-mentioned endeavors will aid the company in capitalizing on the growing demand for generative AI in the healthcare industry.Per a Global Market Insights report, generative AI in the healthcare market is expected to reach $22.1 billion by 2032, witnessing a CAGR of 32.6% between 2024 and 2032.\nA Precedence Research Report shows that the market is expected to hit $21.74 billion by 2032, seeing a CAGR of 35.1% over 2023-2032.\nAlphabet, which currently carries a Zacks Rank #3 (Hold), has intensified the healthcare battle with its above-mentioned efforts for its peers like Amazon AMZN, Microsoft MSFT and Oracle ORCL, which are also making concerted efforts to expand their footprints in the promising healthcare space.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.In this regard, Amazon’s extended collaboration with Philips to improve digital workflow integration and AI/ML capabilities in pathology labs and healthcare organizations with the support of its cloud computing platform, Amazon Web Services, remains noteworthy.This partnership will enhance digital pathology solutions, enabling labs to efficiently manage and analyze growing data, optimize workflows and integrate with existing healthcare systems for holistic patient care.Meanwhile, Microsoft’s partnership with Epic, which is about developing and integrating generative AI into healthcare by combining the scale and power of Azure OpenAI Service with the latter’s electronic health record (EHR) software, is a positive.Microsoft Azure’s introduction of the latest capabilities to free up clinicians' information, including patient timelines and clinical report simplification using generative AI, enabling healthcare professionals to extract and organize unstructured data for better understanding, is noteworthy.Oracle recently enhanced its Health Data Intelligence suite by introducing a generative AI service to boost care management efficiency. The suite enables healthcare stakeholders to use data for patient health improvement, care delivery and operational efficiency.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]