[
    {
        "Date": "2024-05-26T11:15:00.000Z",
        "Title": "Is Alphabet a Good Dividend Stock?",
        "Author": "  Robert Izquierdo, The Motley Fool ",
        "Text": "Dividend-paying tech stocks were once a rare breed. But this year big names in tech have suddenly started offering dividends. For example, Salesforce and Facebook parent Meta Platforms both initiated dividends in February.\nJoining them is Google owner Alphabet (NASDAQ: GOOGL)(NASDAQ: GOOG), which implemented a dividend for the first time in April. As one of the largest companies in the world, with a market cap over $2 trillion, Alphabet possesses the ability to make this move, especially in light of its smaller tech brethren doing so.\nNow that it's paying dividends, does Alphabet make a good income stock? Considering an investment in the tech giant based on its dividend requires taking a deeper look into the company.\nOne reason why Alphabet can afford to pay a dividend is its remarkable ability to generate free cash flow (FCF). A company uses FCF for activities such as investing in its business, paying debt, performing share buybacks, and funding a dividend.\nIn the first quarter, Alphabet produced FCF of $16.8 billion. To get a sense of how much this is, let's contrast Alphabet against tech veteran IBM, which paid dividends since 1916.\nIBM's Q1 FCF was $1.9 billion, and it produced a total of $11.8 billion over the trailing 12 months. This is dwarfed by Alphabet's massive FCF in Q1 alone.\nNot only that, Alphabet's impressive FCF generation has only grown stronger in recent years.\nThis is thanks to the company's slew of successful businesses fueled primarily by advertising dollars. In Q1, ad sales accounted for $61.7 billion of Alphabet's $80.5 billion in total revenue.\nAlphabet's FCF generation is likely to remain strong, helping to ensure its dividend remains in place. After all, it owns Google, but the corporation also has a potent streaming service in YouTube, and a thriving cloud computing business in Google Cloud.\nYouTube achieved revenue of $8.1 billion from advertising in Q1, an increase over the previous year's $6.7 billion. It also generates an undisclosed sum from subscription fees to services such as YouTube Music.\nGoogle Cloud is one of the top three cloud computing vendors in the world, and its market share has steadily risen in recent years. It pulled in $9.6 billion in Q1 sales, up from $7.5 billion in 2023.\nWith ownership of several multi-billion dollar businesses, Alphabet's financials are strong. It exited Q1 with $402.4 billion in total assets on its balance sheet versus $119 billion in total liabilities. Cash, cash equivalents, and marketable securities were $110.9 billion.\nAlphabet's financial strength means its dividend is reliable, but there's another component to consider with an income investment: the dividend yield.\nAlphabet initiated a $0.20-per-share dividend, currently yielding 0.5%. For comparison, IBM pays $1.67 per share with a yield of 3.8%. So in comparison, Alphabet's dividend is lacking.\nIn addition, because Alphabet only began dividend payments this year, there's no history to gauge whether those payments will increase in the future, or how often. Typically, companies raise dividends annually, but every business is different.\nRight now, all that's known about how the firm will approach its dividend is Alphabet stating, \"The company intends to pay quarterly cash dividends in the future.\"\nThat said, its dividend isn't the only consideration for an investment in Alphabet stock. Factors such as its growth prospects and competitive strength should also play a role in a decision to invest.\nFor instance, IBM possesses the superior dividend payout compared to Alphabet, but this rival to Google Cloud has a 2% share of the cloud computing market. Meanwhile, Google Cloud holds a far greater 11% share.\nAdding to the strength of its products, Alphabet is now investing in artificial intelligence. It included AI in its search engine. YouTube uses AI to check its vast video catalog for policy violations. Google Cloud serves as a distribution mechanism for Alphabet's AI products, allowing customers to use the technology for their own businesses.\nSo while Alphabet is not among the best dividend stocks, with many other choices serving as superior sources of passive income, it is still a good overall investment. Its strong suite of products, fantastic financials and FCF generation, and rising revenue make Alphabet an excellent growth stock.\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $652,342!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Robert Izquierdo has positions in Alphabet, International Business Machines, Meta Platforms, and Salesforce. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, and Salesforce. The Motley Fool recommends International Business Machines. The Motley Fool has a disclosure policy.\nIs Alphabet a Good Dividend Stock? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-31T16:43:00.000Z",
        "Title": "Alphabet (GOOGL) Rides on Solid Momentum in Google Services",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL shares have rallied 26% in the year-to-date period, outperforming the Zacks Computer & Technology sector’s growth of 15.7%. The company is benefiting from strong momentum in Google Services segment on the back of search, YouTube and Android. Hence, Alphabet’s Google is constantly making efforts to bolster the segment further.In this regard, Google’s latest roll-out of “Minimized Custom Tabs” for Google Chrome on Android remains noteworthy.These tabs shrink webpages into Picture-in-Picture windows featuring site favicon, page name and domain, enabling multitasking and seamless transition between native apps and web content.The custom tabs are expected to improve the user experience and functionality of the Chrome browser, which, in turn, will likely increase the company's web browsing traffic.Moreover, Alphabet is expected to gain solid traction among Android users on the back of its latest move.\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nAlphabet added generative AI features, namely “Tab Organizer” and a theme maker, to Chrome 121. The Tab Organizer feature automatically creates tab groups based on open tabs by tapping the downward-facing icon in the top-left corner on Windows. The theme maker feature allows users to create custom themes in Chrome using a generative AI text-to-image diffusion model, offering six suggested options and recent creations.The company added a Gemini shortcut in Google Chrome’s address bar, allowing faster search through bookmarks, history and tabs.Alphabet also introduced an Incognito mode in Google Chrome, which allows users to browse the web without any trace, removing browsing history and tracking data after closing the browser, a feature that some interpret as private browsing.Google is developing a built-in \"Listen to this page\" text-to-speech capability for Chrome on Android. The users will get a new \"Listen to this page\" option, which will open on Android’s three-dot overflow menu, launching a mini-player with a circular play/pause button, page title, site name, progress bar and close button.\nPer a Dataintelo report, the global search engine market size is expected to reach $507.4 billion by 2032, indicating a CAGR of 11% between 2024 and 2032.Growing Chrome capabilities will continue to aid Google in strengthening its foothold in the global search engine market.A report from GlobalStats states that Google continued to enjoy its dominant position in the global search engine market, with a market share of 91.5% in 2023.Strength in Google’s search business will continue to drive growth in the Google Services segment.In the first quarter of 2024, the Google Services segment increased 13.6% year over year to $70.4 billion, which accounted for 87.4% of the total revenues.The strengthening Google Services segment is expected to aid Alphabet’s overall financial performance in the near term.The Zacks Consensus Estimate for 2024 total revenues stands at $295.53 billion, indicating year-over-year growth of 15.2%.The consensus mark for 2024 earnings is pegged at $7.61 per share, indicating a 31.2% rise from the year-ago figure. The figure has been revised upward by 0.5% in the past 30 days.\nCurrently, Alphabet sports a Zacks Rank #1 (Strong Buy).Some other top-ranked stocks in the broader technology sector are Arista Networks ANET, Badger Meter BMI and Dropbox DBX, each sporting a Zacks Rank #1 at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Arista Networks’ shares have gained 30.6% in the year-to-date period. The long-term earnings growth rate for ANET is 15.68%.Badger Meter’s shares have gained 27% in the year-to-date period. The long-term earnings growth rate for BMI is currently projected at 15.57%.Shares of Dropbox have declined 22.6% in the year-to-date period. The long-term earnings growth rate for DBX is 11.44%\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBadger Meter, Inc. (BMI) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nArista Networks, Inc. (ANET) : Free Stock Analysis Report\nDropbox, Inc. (DBX) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-23T18:41:51.000Z",
        "Title": "Alphabet, Meta Offer Millions to Partner With Hollywood on AI",
        "Author": "  Lucas Shaw ",
        "Text": "(Bloomberg) -- Alphabet Inc. and Meta Platforms Inc. have held discussions with major Hollywood studios about licensing content for use in the tech giants’ artificial intelligence video generation software, according to people familiar with the matter.\nMost Read from Bloomberg\nWall Street Returns to T+1 Stock Trading After a Century\nWorld’s Largest Nuclear Plant Sits Idle While Energy Needs Soar\nNew BYD Hybrid Can Drive Non-Stop for More Than 2,000 Kilometers\n‘Not Gonna Be Pretty:’ Covid-Era Homebuyers Face Huge Rate Jump\nTreasuries Hit as US Sales Struggle to Lure Buyers: Markets Wrap\nBoth companies are developing technology that can create realistic scenes from a text prompt, and have offered tens of millions of dollars to partner with studios in some capacity. Rival OpenAI, backed by Microsoft Corp., is having similar conversations. Alphabet, Meta and OpenAI declined to comment on the talks.\nHollywood studios are keen to discuss ways to use AI to reduce costs while also protecting themselves from having their work stolen. They are wary of giving films and TV shows to tech companies without control over how that content is used. Just this week, the actress Scarlett Johansson demanded OpenAI stop using a voice that sounded like her to power its chatbot after she refused to work with the company.\nBig money is at stake. On Wednesday, News Corp., parent of the Wall Street Journal and other media outlets, agreed to allow OpenAI to use content from more than a dozen of its publications in a deal that could be worth more than $250 million over five years.\nWarner Bros. Discovery Inc. has expressed a willingness to license some of its programs to train the models, but only for specific divisions — not its entire library. Walt Disney Co. and Netflix Inc. aren’t willing to license their content to these companies, but have expressed an interest in other types of collaborations.\nHollywood studios are already using artificial intelligence in production, as are many filmmakers. Tyler Perry has used the technology to re-create the makeup he wears for his Madea character in movies. Director Robert Zemeckis has deployed artificial intelligence to de-age Tom Hanks in an upcoming film.\nBut a new crop of tools, including OpenAI’s Sora and Alphabet’s Veo, go a step further by promising to help filmmakers quickly create vivid, hyper-realistic clips based on just a few words of description. Their capabilities have elicited excitement and anxiety in Hollywood, where actors and writers staged a monthslong strike last year over concern about how AI could take their jobs.\nPerry, an actor, filmmaker and studio owner, was so amazed by a demonstration of Sora that he put plans for an $800 million studio expansion on hold earlier this year. He has been vocal about the opportunities AI represents for studios, but also in raising the alarm about the technology’s impact on labor. He has called for the industry to rally together and formulate some sort of regulations. “If not, I just don’t see how we survive,” he told the Hollywood Reporter in February.\nThe music industry has adopted a tough stance against AI use. Universal Music Group NV sued Anthropic, a budding AI startup, for copying song lyrics and temporarily pulled its music from TikTok in part to secure protections for its artists. Sony Music Group sent letters to hundreds of partners this month warning them not to train any AI models on its music.\nNo major studio has so far sued a tech company over AI, despite fears that many of these models have already been trained on their copyrighted material. They would like to find a way to make AI work for them rather than fight a new technology that could help significantly reshape the industry. But studios have yet to agree to major commercial relationships around the use of AI with the largest technology companies.\nHollywood executives worry that licensing conversations will lead to tension between studios and their creative partners. For example, studios believe they have the rights to license a movie they own to an AI company. But if that company uses the movie to train its AI model on the face or voice of an actor in that movie, the actor would also want the opportunity to approve of it or not. A few actors have already struck deals with AI companies.\nMost Read from Bloomberg Businessweek\nNew York’s Biggest Produce Market Is at a Breaking Point\nWhy Dave & Buster’s Is Transforming Its Arcades Into Casinos\nElon Musk Still Has Friends in Silicon Valley\nWhen Business Is Just a Game\nThe Six Choke Points That Can Upend Global Trade\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-05-28T20:29:02.000Z",
        "Title": "Generative AI is in the crosshairs at Meta and Alphabet annual meetings as shareholders vote for detailed reports",
        "Author": "  Sharon Goldman ",
        "Text": "Generative AI is on the ballot at Big Tech companies like Meta and Alphabet, as shareholders vote on proposals calling for detailed reports by the companies about how the technology is being used to create and spread misinformation. The shareholder proposals, which will be voted on at each company’s upcoming annual general meeting, reflect growing concerns about the power and prevalence of generative AI.\nThe votes come as Google has faced massive blowback over the past week for its new search AI features, which has produced false and often bizarre responses, including telling users to put glue on pizza. Audio and video deepfakes created by AI technology are also proliferating online, raising concerns in an election year.\nShareholders in Meta, the parent company of Facebook and Instagram, will vote at the company’s annual meeting on Wednesday, while investors in Google-parent company Alphabet will weigh in at the company’s annual meeting on June 7. The resolutions come just a few months after a similar proposal at Microsoft’s AGM on December 7, 2023, which was presented by Nirvana co-founder and bassist Krist Novoselic and garnered 21% of the shareholder vote.\nThe three proposals were led by ESG activist investor group Arjuna Capital and focus on concerns that generative AI threatens to amplify misinformation and disinformation around the world, particularly during a critical election year in countries like the US and India. A separate shareholder proposal brought to Apple focused on the risks of AI to workers, which was filed by the AFL-CIO Equity Index Funds, the largest labor union federation in the US. While the proposal was ultimately voted down by Apple shareholders at its annual meeting in February, proponents of AI transparency won a victory beforehand when the SEC ruled that companies like Apple could not bar shareholders from voting on such matters.\nIn the proxy statement for Meta's annual meeting, the shareholder proposal states that \"with Meta’s recent development of gAI products, including conversational assistants and advertising tools, the company is increasingly at risk from misinformation and disinformation generated through its own products.\"\nThe proposal calls for the Meta board to “issue a report, at reasonable cost, omitting proprietary or legally privileged information, to be published within one year of the Annual Meeting and updated annually thereafter, assessing the risks to the Company’s operations and finances, and to public welfare, presented by the Company’s role in facilitating misinformation and disinformation disseminated or generated via generative Artificial Intelligence; what steps the Company plans to take to remediate those harms; and how it will measure the effectiveness of such efforts.”\nIn its response urging shareholders to reject the proposal, Meta pointed to its “five pillars of Responsible AI” which are overseen by its board of directors, as well as its investments in safety and security efforts to combat misinformation and disinformation.\n“Given our ongoing efforts to address this topic, the board of directors believes that the requested report is unnecessary and would not provide additional benefit to our shareholders,” the Proxy Report said.\nIn a response to a similar proposal, Alphabet said that its Board of Directors recommended a vote against the stockholder proposal because “Our enterprise risk frameworks, product policies, and tools provide a foundation for identifying and mitigating AI-generated mis/disinformation and other potential risks,” adding that “we continually strive to improve the quality of our generative AI models and applications through both pre-launch testing and ongoing fine-tuning, and we are transparent about our ongoing work via public reporting.”\nThe proposals for AI reports at Meta and Alphabet are unlikely to be approved, as both companies have dual class stock that concentrates the voting power in the hands of the founders. Still, the proposals carry symbolic power and have the potential to send a message to management if they earn widespread support from shareholders.\nAt December’s Microsoft AGM, Novoselic served as the spokesperson for the shareholder initiative, describing himself as a long-time shareholder. He accused the company of racing forward, “releasing this nascent technology without the appropriate guardrails.” Generative AI, he continued, “is a game-changer, there’s no question, but the rush to market seemingly prioritizes short term profits over long-term success.”\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-05-01T16:45:10.000Z",
        "Title": "3 Reasons Growth Investors Will Love Alphabet (GOOG)",
        "Author": "  Zacks Equity Research ",
        "Text": "Growth stocks are attractive to many investors, as above-average financial growth helps these stocks easily grab the market's attention and produce exceptional returns. But finding a growth stock that can live up to its true potential can be a tough task.\nBy their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss.\nHowever, it's pretty easy to find cutting-edge growth stocks with the help of the Zacks Growth Style Score (part of the Zacks Style Scores system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.\nAlphabet Inc. (GOOG) is one such stock that our proprietary system currently recommends. The company not only has a favorable Growth Score, but also carries a top Zacks Rank.\nResearch shows that stocks carrying the best growth features consistently beat the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better.\nWhile there are numerous reasons why the stock of this company is a great growth pick right now, we have highlighted three of the most important factors below:\nEarnings Growth\nEarnings growth is arguably the most important factor, as stocks exhibiting exceptionally surging profit levels tend to attract the attention of most investors. And for growth investors, double-digit earnings growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration.\nWhile the historical EPS growth rate for Alphabet is 23.4%, investors should actually focus on the projected growth. The company's EPS is expected to grow 32.1% this year, crushing the industry average, which calls for EPS growth of 30%.\nCash Flow Growth\nWhile cash is the lifeblood of any business, higher-than-average cash flow growth is more important and beneficial for growth-oriented companies than for mature companies. That's because, growth in cash flow enables these companies to expand their businesses without depending on expensive outside funds.\nRight now, year-over-year cash flow growth for Alphabet is 16.7%, which is higher than many of its peers. In fact, the rate compares to the industry average of -19.4%.\nWhile investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 15.1% over the past 3-5 years versus the industry average of 12.5%.\nPromising Earnings Estimate Revisions\nBeyond the metrics outlined above, investors should consider the trend in earnings estimate revisions. A positive trend is a plus here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nThere have been upward revisions in current-year earnings estimates for Alphabet. The Zacks Consensus Estimate for the current year has surged 13.1% over the past month.\nBottom Line\nWhile the overall earnings estimate revisions have made Alphabet a Zacks Rank #1 stock, it has earned itself a Growth Score of B based on a number of factors, including the ones discussed above.\nYou can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\nThis combination indicates that Alphabet is a potential outperformer and a solid choice for growth investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]