[
    {
        "Date": "2024-06-06T14:21:00.000Z",
        "Title": "Eli Lilly (LLY) Veteran Anat Ashkenazi to Join Alphabet as CFO",
        "Author": "  Zacks Equity Research ",
        "Text": "Eli Lilly and Company LLY announced that its executive vice president and chief financial officer (CFO) Anat Ashkenazi has resigned after serving for 23 years at the company. Ashkenazi has joined Google’s parent company Alphabet GOOGL as CFO and senior vice president, effective Jul 31, 2024. Until then, she will continue to serve in her present role at Lilly.\nUntil Ashkenazi joins in her new role as CFO of Google and Alphabet, Ruth Porat, the present CFO of Alphabet will continue as CFO. In July last year, Alphabet announced that Ruth Porat would move into a new role as president & chief investment officer of Alphabet and Google, effective from September 2023, but remain CFO until a successor was hired. Anat will be based in the San Francisco Bay Area and will report directly to Google and Alphabet CEO Sundar Pichai.\nAshkenazi has been Lilly’s CFO since 2021. Before she assumed the position of CFO, Ashkenazi served as senior vice president, controller, and chief financial officer of Lilly Research Laboratories, as well as CFO for Lilly’s several global business areas. Lilly has begun its search for a new CFO, both internally and externally.\nLilly’s stock has risen 42.7% year to date compared with an increase of 18.5% for the industry.\nImage Source: Zacks Investment Research\nIn the last three years of her tenure as CFO, Lilly experienced tremendous growth. Its stock rose 273.8% in the last three years. Lilly’s revenue growth is being driven by higher demand for drugs like Mounjaro, Verzenio, Jardiance Taltz and others. Lilly’s new tirzepatide medicines, diabetes drug Mounjaro and weight loss medicine, Zepbound, have become key top-line drivers for Lilly despite a short time on the market. Mounjaro was launched in mid-2022. Zepbound was launched in November 2023.\nTirzepatide is a dual GIP and GLP-1 receptor agonist (GIP/GLP-1 RA). The GLP-1 segment is an important class of drugs for multiple cardiometabolic diseases and is gaining significant popularity with the demand for weight loss drugs rising rapidly. Lilly launched Mounjaro and Zepbound during Ashkenazi's time as CFO.\nIt is believed that Ashkenazi’s deep experience at Lilly will be good for Google and Alphabet, which is investing heavily in generative artificial intelligence, growing rapidly in the booming cloud-computing market and cutting costs through layoffs. However, investors are surprised about Ashkenazi’s transition from the healthcare sector to the tech industry. Nonetheless, her experience in healthcare can help a tech giant like Alphabet push into the healthcare industry.\nLilly currently has a Zacks Rank #3 (Hold).\nEli Lilly and Company price-consensus-chart | Eli Lilly and Company Quote\n \nSome better-ranked stocks in the healthcare sector are Acrivon Therapeutics ACRV and Heron Therapeutics HRTX, with a Zacks Rank of 2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nIn the past 60 days, loss estimates for Acrivon Therapeutics have narrowed from $3.51 per share to $2.47 per share for 2024. For 2025, loss estimates have narrowed from $3.41 per share to $2.55 per share over the same timeframe.\nACRV beat estimates in three of the trailing four quarters and missed the mark once, delivering an average earnings surprise of 3.56%. Year to date, shares of ACRV have risen 50.2%.\nIn the past 60 days, loss estimates for Heron Therapeutics have narrowed from 22 cents per share to 10 cents per share for 2024. For 2025, estimates have improved from a loss of 9 cents per share to earnings of 1 cent per share over the same timeframe. Year to date, shares of HRTX have risen 124.7%.\nEarnings of Heron Therapeutics beat estimates in three of the last four quarters while missing in one, delivering a four-quarter average earnings surprise of 30.33%.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nHeron Therapeutics, Inc. (HRTX) : Free Stock Analysis Report\nAcrivon Therapeutics, Inc. (ACRV) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-04T11:01:15.000Z",
        "Title": "Alphabet (NASDAQ:GOOG.L) Has A Rock Solid Balance Sheet",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Legendary fund manager Li Lu (who Charlie Munger backed) once said, 'The biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. We note that Alphabet Inc. (NASDAQ:GOOG.L) does have debt on its balance sheet. But is this debt a concern to shareholders?\nDebt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price. In the worst case scenario, a company can go bankrupt if it cannot pay its creditors. However, a more usual (but still expensive) situation is where a company must dilute shareholders at a cheap share price simply to get debt under control. Of course, the upside of debt is that it often represents cheap capital, especially when it replaces dilution in a company with the ability to reinvest at high rates of return. When we examine debt levels, we first consider both cash and debt levels, together.\n See our latest analysis for Alphabet \nAs you can see below, Alphabet had US$11.9b of debt, at March 2024, which is about the same as the year before. You can click the chart for greater detail. However, its balance sheet shows it holds US$108.1b in cash, so it actually has US$96.2b net cash.\nZooming in on the latest balance sheet data, we can see that Alphabet had liabilities of US$77.0b due within 12 months and liabilities of US$37.5b due beyond that. Offsetting these obligations, it had cash of US$108.1b as well as receivables valued at US$44.6b due within 12 months. So it actually has US$38.1b more liquid assets than total liabilities.\nHaving regard to Alphabet's size, it seems that its liquid assets are well balanced with its total liabilities. So it's very unlikely that the US$2.14t company is short on cash, but still worth keeping an eye on the balance sheet. Simply put, the fact that Alphabet has more cash than debt is arguably a good indication that it can manage its debt safely.\nOn top of that, Alphabet grew its EBIT by 34% over the last twelve months, and that growth will make it easier to handle its debt. When analysing debt levels, the balance sheet is the obvious place to start. But it is future earnings, more than anything, that will determine Alphabet's ability to maintain a healthy balance sheet going forward. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\nFinally, while the tax-man may adore accounting profits, lenders only accept cold hard cash. Alphabet may have net cash on the balance sheet, but it is still interesting to look at how well the business converts its earnings before interest and tax (EBIT) to free cash flow, because that will influence both its need for, and its capacity to manage debt. Over the most recent three years, Alphabet recorded free cash flow worth 80% of its EBIT, which is around normal, given free cash flow excludes interest and tax. This free cash flow puts the company in a good position to pay down debt, when appropriate.\nWhile it is always sensible to investigate a company's debt, in this case Alphabet has US$96.2b in net cash and a decent-looking balance sheet. And we liked the look of last year's 34% year-on-year EBIT growth. So we don't think Alphabet's use of debt is risky. Above most other metrics, we think its important to track how fast earnings per share is growing, if at all. If you've also come to that realization, you're in luck, because today you can view this interactive graph of Alphabet's earnings per share history for free.\nIf, after all that, you're more interested in a fast growing company with a rock-solid balance sheet, then check out our list of net cash growth stocks without delay.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-06-10T08:35:00.000Z",
        "Title": "How Nvidia Could Help Alphabet, Amazon, and Microsoft Stocks Soar Even More",
        "Author": "  Keith Speights, The Motley Fool ",
        "Text": "It's been a great time to own shares of Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL), Amazon (NASDAQ: AMZN), and Microsoft (NASDAQ: MSFT). All three stocks delivered strong gains last year and are up by double-digit percentages so far in 2024.\nBut it's been a spectacular time to own shares of Nvidia (NASDAQ: NVDA). The chip stock skyrocketed nearly 240% in 2023 and has vaulted more than 140% higher year to date.\nYou've probably heard the adage that \"success begets success.\" I think we'll see this proved in a convincing manner, with one company's success translating to success for others. Here's how Nvidia could help Alphabet, Amazon, and Microsoft stocks soar even more.\nTo understand how Nvidia could help Alphabet, Amazon, and Microsoft, we first need to know something important about the three companies. Their cloud units are key growth drivers.\nIn the first quarter of 2024, Alphabet's Google Cloud revenue jumped 28.4% year over year. This business generated nearly 20% of the company's total revenue growth despite making up less than 12% of total revenue.\nIt was a similar story for Amazon. Revenue for the company's Amazon Web Services (AWS) unit increased 17% year over year in the first quarter, almost 39% of total revenue growth. AWS was an even bigger driver of Amazon's earnings growth.\nWhat about Microsoft? Its cloud business delivered revenue growth in the fiscal second quarter (which ended March 31) of 23% -- roughly 73% of total revenue growth.\nAnything that drives more customers to the cloud will directly help sales and earnings growth for Alphabet, Amazon, and Microsoft. And over the long term, that should translate to increasing stock prices for each company.\nThis is where Nvidia comes into the picture. Its technology is helping all three giant cloud service providers to attract more customers and more business from existing customers.\nNvidia chief financial officer Colette Kress explained how the company is helping cloud service providers grow in its first-quarter earnings call. She said that organizations that use Nvidia's GPUs are able to train their large language models (LLMs) more quickly and more cost-effectively than with other chips. They can also deploy those models at the lowest cost with Nvidia's GPUs, Kress said.\nAlphabet, Amazon, and Microsoft enjoy exceptional returns on investment when they use Nvidia's AI technology. Kress said that cloud providers can earn $5 in hosting revenue with Nvidia's GPUs over four years for every $1 invested in the company's AI infrastructure.\nThese big cloud service providers also have ample motivation to adopt new technology introduced by Nvidia. In his company's first-quarter call, Nvidia CEO Jensen Huang emphasized the importance of organizations being able to train AI models quickly.\nFor example, the company's forthcoming Blackwell GPU architecture enables training that is four times faster than with its wildly popular H100 GPUs. The new platform supports 30 times faster AI inference. It's not surprising that Alphabet, Amazon, and Microsoft are among the early buyers of Blackwell -- even before it ships later this year.\nHaven't Alphabet, Amazon, and Microsoft developed their own AI chips? Could Nvidia's top customers become its rivals over time? Yes and yes.\nHuang was asked about this by an analyst in the first-quarter call. He responded by pointing out how Nvidia's technology differs from the custom chips the big cloud service providers offer. He believes that the scope, versatility, and low total cost of ownership of Nvidia's accelerated computing architecture; its pervasiveness across all types of computers, and the company's AI factories stand out as key competitive advantages.\nFor now, Nvidia and its big cloud customers enjoy a symbiotic relationship. Nvidia's sales grow as it launches new and improved AI technology. Alphabet's, Amazon's, and Microsoft's sales grow as they use Nvidia's latest products to attract customers. It's a win-win proposition for all four companies -- and their investors.\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $740,688!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nHow Nvidia Could Help Alphabet, Amazon, and Microsoft Stocks Soar Even More was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-13T11:48:26.000Z",
        "Title": "Is Alphabet Inc. (NASDAQ:GOOG) the Best Undervalued Tech Growth Stock in 2024?",
        "Author": "  Attiya Zainib ",
        "Text": "We recently published a list entitled Billionaire Israel Englander's Top 10 Stock Picks for 2024. Since Alphabet Inc. (NASDAQ:GOOG) ranks 8th in the list, it deserves a deeper look.\nBillionaire Israel Englander is one of the most notable hedge fund managers in America. He founded Millennium Management back in 1989. Today, the fund’s portfolio is worth over $234 billion. Englander nabbed the top spot in Bloomberg’s list of highest-earning hedge fund managers in 2023, with a whopping $2.8 billion in net earnings including gains from personal investments and fees. Earlier this year, Bloomberg reported that Izzy Englander’s Millennium Management earned $600 million from commodities investments last year. However, in a separate report, the publication said despite installing a new chief of its commodities and making big changes, Millennium’s commodities business is lagging behind Citadel (of billionaire Ken Griffin) which made a whopping $8 billion from commodities in 2022. Bloomberg said, citing sources, that part of the reason why Millennium is struggling to post big gains is billionaire Englander’s imposition of “tight guardrails” to limit losses.  To make money in the commodities business, experts say, you have to take risks and give some freedom to traders. But Englander likes to be in control.  A Financial Times report earlier this year said Millennium Management manages a whopping $60 billion in assets, employs 5,400 people and has 17 offices. Yet Englander owns 100% of the firm.\nThe report said, citing a person who works at the fund, that this major concentration is “not a good idea.”\nThe FT report said Englander’s fund was up 8.3% in 2023 through October, while it returned 12.5% in 2022,  13.6% in 2021 and an impressive 25.9% in 2020.\nFor this article, we scanned Millennium Management’s Q1 portfolio and picked the fund’s top 10 holdings. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nIsrael Englander of Millennium Management\nBillionaire Israel Englander’s Stake Value: $820,337,453\nAlphabet Inc. (NASDAQ:GOOG) is apparently in a no-holds-barred fight against competitors in the AI race that according to many threatened the bread and butter of Google its search business. However, many analysts believe Alphabet Inc. (NASDAQ:GOOG) is making a big turn and will continue to grow. Alex Kantrowitz, Big Technology founder, while talking to CNBC last month, said that the present for Alphabet Inc. (NASDAQ:GOOG) is looking “real good” amid revenue growth, leadership’s harsh stance against those “making trouble” insider the company, dividends and buybacks.\nLatest data analyzed by Bank of America shows that across all devices, Alphabet Inc.’s (NASDAQ:GOOG) market search in search actually gained half a percentage point in May on a MoM basis. BofA analyst Justin Post said this shows Alphabet Inc.’s (NASDAQ:GOOG) AI Overviews are “aiding query growth and usage.”\nAnalysts also believe Alphabet Inc. (NASDAQ:GOOG) is in a strong position to offset any headwinds or lost market share in Google search with YouTube, which saw its ads revenue reach $8.1 billion in the first quarter, a 21% growth. Alphabet Inc.’s (NASDAQ:GOOG) net income in the period came in at $23.66 billion, up 57%, or $1.89 per share.\nAlphabet Inc. (NASDAQ:GOOG) bulls believe the market is not incorporating the company’s growth in Cloud, Other Bets, Video and other high growth initiatives. The stock is trading 20x Alphabet’s 2025 EPS estimate of $8.57. This multiple makes the stock look attractively valued since the Wall Street expects Alphabet Inc. (NASDAQ:GOOG) earnings to grow by 13.40% in 2025 and by 19% over the past five years on a per annum basis.\nLakehouse Global Growth Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its April 2024 investor letter:\n“Alphabet Inc. (NASDAQ:GOOG) delivered a strong quarterly result that came in well ahead of analysts’ expectations. Revenue grew 15.4% (16.0% constant currency) to $80.5 billion and operating income grew 46.0% to $25.5 billion. Revenue growth accelerated across Search, YouTube Ads, and Google Cloud, all whilst the company delivered its highest operating margin since 2021 – showing meaningful progress in the company’s efforts to durably re-work their cost structure. On the Generative AI front, management emphasised the company’s infrastructure advantages including 5th generation TPUs(chips developed by Google specifically for AI training and inference), high performance data centre architecture, and AI models that are 100x more efficient versus 18 months ago. Overall, we believe that Alphabet is well placed for the AI opportunity ahead and still has significant latent earnings power. When combined with a relatively undemanding valuation of 21x forward net profit and over $100 billion of cash on the balance sheet, it’s not hard to see why we remain positive on the range of outcomes in the years ahead.”\nOverall, Alphabet Inc. (NASDAQ:GOOG) ranks 8th on Insider Monkey’s list of Billionaire Israel Englander's Top 10 Stock Picks for 2024. You can visit Billionaire Israel Englander's Top 10 Stock Picks for 2024 to see other stocks in the list. While we acknowledge the potential of Alphabet Inc. (NASDAQ:GOOG), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than Alphabet Inc. (NASDAQ:GOOG) but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-06-07T16:45:05.000Z",
        "Title": "Alphabet (GOOGL) is an Incredible Growth Stock: 3 Reasons Why",
        "Author": "  Zacks Equity Research ",
        "Text": "Growth investors focus on stocks that are seeing above-average financial growth, as this feature helps these securities garner the market's attention and deliver solid returns. But finding a great growth stock is not easy at all.\nIn addition to volatility, these stocks carry above-average risk by their very nature. Also, one could end up losing from a stock whose growth story is actually over or nearing its end.\nHowever, the task of finding cutting-edge growth stocks is made easy with the help of the Zacks Growth Style Score (part of the Zacks Style Scores system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.\nAlphabet (GOOGL) is on the list of such stocks currently recommended by our proprietary system. In addition to a favorable Growth Score, it carries a top Zacks Rank.\nStudies have shown that stocks with the best growth features consistently outperform the market. And for stocks that have a combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy), returns are even better.\nWhile there are numerous reasons why the stock of this internet search leader is a great growth pick right now, we have highlighted three of the most important factors below:\nEarnings Growth\nEarnings growth is arguably the most important factor, as stocks exhibiting exceptionally surging profit levels tend to attract the attention of most investors. And for growth investors, double-digit earnings growth is definitely preferable, and often an indication of strong prospects (and stock price gains) for the company under consideration.\nWhile the historical EPS growth rate for Alphabet is 23.4%, investors should actually focus on the projected growth. The company's EPS is expected to grow 31.1% this year, crushing the industry average, which calls for EPS growth of 28.1%.\nCash Flow Growth\nCash is the lifeblood of any business, but higher-than-average cash flow growth is more beneficial and important for growth-oriented companies than for mature companies. That's because, high cash accumulation enables these companies to undertake new projects without raising expensive outside funds.\nRight now, year-over-year cash flow growth for Alphabet is 16.7%, which is higher than many of its peers. In fact, the rate compares to the industry average of -15.4%.\nWhile investors should actually consider the current cash flow growth, it's worth taking a look at the historical rate too for putting the current reading into proper perspective. The company's annualized cash flow growth rate has been 15.1% over the past 3-5 years versus the industry average of 12.5%.\nPromising Earnings Estimate Revisions\nSuperiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nThere have been upward revisions in current-year earnings estimates for Alphabet. The Zacks Consensus Estimate for the current year has surged 0.4% over the past month.\nBottom Line\nWhile the overall earnings estimate revisions have made Alphabet a Zacks Rank #1 stock, it has earned itself a Growth Score of B based on a number of factors, including the ones discussed above.\nYou can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\nThis combination indicates that Alphabet is a potential outperformer and a solid choice for growth investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]