[
    {
        "Date": "2024-07-16T14:00:50.000Z",
        "Title": "Alphabet Inc. (GOOG) Earnings Expected to Grow: What to Know Ahead of Next Week's Release",
        "Author": "  Zacks Equity Research ",
        "Text": "Wall Street expects a year-over-year increase in earnings on higher revenues when Alphabet Inc. (GOOG) reports results for the quarter ended June 2024. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.\nThe stock might move higher if these key numbers top expectations in the upcoming earnings report, which is expected to be released on July 23. On the other hand, if they miss, the stock may move lower.\nWhile the sustainability of the immediate price change and future earnings expectations will mostly depend on management's discussion of business conditions on the earnings call, it's worth handicapping the probability of a positive EPS surprise.\nZacks Consensus Estimate\nThis company is expected to post quarterly earnings of $1.85 per share in its upcoming report, which represents a year-over-year change of +28.5%.\nRevenues are expected to be $70.55 billion, up 13.7% from the year-ago quarter.\nEstimate Revisions Trend\nThe consensus EPS estimate for the quarter has remained unchanged over the last 30 days. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\nInvestors should keep in mind that an aggregate change may not always reflect the direction of estimate revisions by each of the covering analysts.\nEarnings Whisper\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. Our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction) -- has this insight at its core.\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\nHow Have the Numbers Shaped Up for Alphabet?\nFor Alphabet, the Most Accurate Estimate is the same as the Zacks Consensus Estimate, suggesting that there are no recent analyst views which differ from what have been considered to derive the consensus estimate. This has resulted in an Earnings ESP of 0%.\nOn the other hand, the stock currently carries a Zacks Rank of #3.\nSo, this combination makes it difficult to conclusively predict that Alphabet will beat the consensus EPS estimate.\nDoes Earnings Surprise History Hold Any Clue?\nAnalysts often consider to what extent a company has been able to match consensus estimates in the past while calculating their estimates for its future earnings. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\nFor the last reported quarter, it was expected that Alphabet would post earnings of $1.49 per share when it actually produced earnings of $1.89, delivering a surprise of +26.85%.\nOver the last four quarters, the company has beaten consensus EPS estimates four times.\nBottom Line\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\nAlphabet doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-16T10:00:00.000Z",
        "Title": "Alphabet Reportedly Canceled Its Buyout of HubSpot. Does That Make HubSpot Stock a Buy?",
        "Author": "  Will Healy, The Motley Fool ",
        "Text": "HubSpot (NYSE: HUBS) saw significant action in recent days as Google parent Alphabet reportedly dropped its plans to buy the company, according to a report by Bloomberg. With HubSpot set to continue as an independent entity, the stock fell by nearly 20% in the second week of July.\nNow, investors should consider whether to buy the discounted shares. Let's examine whether a position in HubSpot can pay off for its shareholders.\nAdmittedly, HubSpot's core competencies are of interest to media companies and businesses alike. HubSpot offers an inbound marketing tool for small and medium-size businesses. Rather than harassing customers with unwanted ads, HubSpot markets through content creation and information sharing.\nThis approach offers \"freemium\" content, differentiating itself from Salesforce and other customer relationship management tools. Between its free tools and paid platforms that cost as little as $20 per month, its technology is accessible to nearly any enterprise.\nAdditionally, it accomplishes many of its tasks through artificial intelligence (AI). AI helps its customers with functions such as writing emails, building customer lists, or creating reports.\nIt was likely such capabilities that initially attracted interest from a company like Alphabet. Still, according to anonymous sources, HubSpot and Alphabet had never conducted detailed discussions related to the due diligence of a potential deal.\nAlso, such a deal would have probably faced considerable regulatory scrutiny, as HubSpot's $24 billion market cap would have made it a major buyout. That factor alone reduces the odds of such a deal winning approval from regulators.\nNonetheless, the failure of such a deal may please HubSpot bulls. The stock is up more than 1,400% since its 2015 initial public offering, and despite more recent struggles, it has outperformed the S&P 500 over the last five years.\nAlso, the company continues to show robust financial growth. Revenue in the first quarter of 2024 was $617 million, a yearly increase of 23%. In comparison, revenue grew by around 25% in 2023.\nEven though it lost money in 2023, it earned a net income of $5.9 million in Q1 2024. Admittedly, the operational losses continue, and the profit came from income from investment. Nonetheless, such improvements indicate that it is close to an operational profit.\nGiven the losses in past years, it does not have a P/E ratio. However, its price-to-sales (P/S) ratio of 10.3 places it below its all-time average sales multiple of 12 and near yearly lows. Such a valuation seems to validate that HubSpot indeed trades at a discount.\nGiven HubSpot's current state, the recent sell-off looks like a buying opportunity in the software-as-a-service (SaaS) stock. Although the deal's failure prompted many investors to sell, it is clear that HubSpot's software meets a critical need for SMBs, leading businesses to spend more on its platform.\nMoreover, its 10.3 P/S ratio takes the sales multiple close to a yearly low, allowing new investors to buy this stock at a discount. With this opportunity, investors can profit over time, and a lower price increases the likelihood it will outperform the S&P 500.\nBefore you buy stock in HubSpot, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and HubSpot wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Will Healy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, HubSpot, and Salesforce. The Motley Fool has a disclosure policy.\nAlphabet Reportedly Canceled Its Buyout of HubSpot. Does That Make HubSpot Stock a Buy? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-19T09:50:10.000Z",
        "Title": "Alphabet (GOOG) Surged After Strong Performance",
        "Author": "  Soumya Eswaran ",
        "Text": "Madison Investments, an investment advisor, released its “Madison Investors Fund” second-quarter 2024 investor letter. A copy of the letter can be downloaded here. In the second quarter, the fund (Class Y) fell by 1.03% compared to a 4.28% return for the S&P 500 index. YTD the fund returned 8.50% compared to a 15.29% return for the index. In addition, please check the fund’s top five holdings to know its best picks in 2024.\nMadison Investors Fund highlighted stocks like Alphabet Inc. (NASDAQ:GOOG) in its Q2 2024 investor letter. Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, offers various platforms and services operating through Google Services, Google Cloud, and Other Bets segments. The one-month return of Alphabet Inc. (NASDAQ:GOOG) was 0.85%, and its shares gained 49.94% of their value over the last 52 weeks. On July 18, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $179.22 per share with a market capitalization of $2.204 trillion.\nMadison Investors Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its Q2 2024 investor letter:\n\"Shares in Alphabet Inc. (NASDAQ:GOOG) appreciated nicely in the quarter as investors applauded results that reflected strong performance across Search, YouTube, and Cloud. Importantly, margins also expanded considerably as management makes meaningful progress on ‘durably reengineering the cost structure’.\"\nPhoto by Kai Wenzel on Unsplash\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 165 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of the first quarter which was 166 in the previous quarter. While we acknowledge the potential of Alphabet Inc. (NASDAQ:GOOG) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Alphabet Inc. (NASDAQ:GOOG) and shared Wedgewood Partners' views on the company. Alphabet Inc. (NASDAQ:GOOG) was the top contributor to Oakmark Funds' performance during the second quarter of 2024. In addition, please check out our hedge fund investor letters Q2 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-07-24T15:33:39.000Z",
        "Title": "Why Alphabet Stock Is Sinking Today",
        "Author": "  Keith Noonan, The Motley Fool ",
        "Text": "Alphabet (NASDAQ: GOOGL)(NASDAQ: GOOG) stock is losing ground Wednesday. The tech giant's share price was down 3.4% as of 10:30 a.m. ET, according to data from S&P Global Market Intelligence.\nAlphabet published second-quarter results after the market closed yesterday. Despite strong sales and earnings beats in the quarter, investors are selling out of the stock in response to the company's forward guidance.\nAlphabet posted earnings per share of $1.89 on revenue of $84.74 billion in the second quarter. Meanwhile, the average analyst estimate had called for the business to record per-share earnings of $1.85 on sales of $84.29 billion.\nEven though the company's share price is dipping today, the company's Q2 results were very strong -- and most key segments put up impressive performances. Overall revenue rose 15% year over year on a currency-adjusted basis, and the company's operating income margin hit 32% -- up from the 29% margin it posted in last year's quarter and exceeding the 31% margin predicted by Wall Street.\nAlphabet's \"Google search and other\" segment saw revenue increase roughly 14% year over year to hit $48.5 billion. The company's cloud business also delivered another quarter of strong growth, with revenue rising roughly 29% year over year to hit $10.35 billion. Along with strong sales momentum for most of its segments, efficiency initiatives at the company helped push diluted earnings per share up roughly 31% compared to last year's quarter.\nWhile Alphabet's Q2 results were roundly better than Wall Street had anticipated, company management made comments on the quarterly earnings call that have triggered an uptick in bearish sentiment. Third-quarter operating margins will likely be pressured due to increases in depreciation and expenses related to the company's investment in artificial intelligence (AI) and other tech infrastructure.\nWhile margins could see some uneven movement in the near term, the long-term trajectory points to continued margin expansion for the company. Alphabet still expects that this year's operating margins will be up on an annual basis, and the software leader is likely still in the very early stages of benefiting from the AI revolution.\nWith Alphabet now trading at roughly 23 times this year's expected earnings, shares look attractively valued given the company's sales and earnings momentum. If you're a long-term investor interested in building a position in the tech giant's stock, today's pullback appears to present a worthwhile buying opportunity.\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $751,180!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 22, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy.\nWhy Alphabet Stock Is Sinking Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-24T13:46:09.000Z",
        "Title": "Alphabet’s Shares Drop as Investors Wait for AI to Pay Off",
        "Author": "  Davey Alba and Julia Love ",
        "Text": "(Bloomberg) -- Alphabet Inc. shares fell after the Google parent sunk more resources into its drive to outmatch rivals in artificial intelligence, fueling spending higher than analysts expected.\nMost Read from Bloomberg\nVenezuela’s Opposition Disputes Claim of Maduro Election Victory\nHarris’ Running-Mate Search Zeroes In on Three Top Contenders\nTraders Fret as 32-Hour Central Bank Spree Hangs Over Market\nFrench Internet Lines Cut in Latest Attack During Olympics\nApple's AI Features Rollout Will Miss Upcoming iPhone Software Overhaul\nCapital spending rose to $13.2 billion in the second quarter, supporting Google’s AI programs and computing power needs, the company said Tuesday. That exceeded analysts’ estimates of $12.2 billion.\nGoogle once had a head start in the AI race because it developed much of the technology underpinning popular chatbots. Now, the company is under pressure to prove that it can withstand competition from the likes of OpenAI and Microsoft Corp. as they try to draw people away from traditional web search, pushing chatbots that can answer users’ questions in a conversational fashion.\nGoogle has rushed to weave artificial intelligence into all of its widely used products, including Gmail, Google Docs and search, while boosting its own AI capabilities — an expensive initiative with mixed results. Some investors are looking for clearer evidence of return on investment for all the billions in spending on AI progress, said Daniel Morgan, senior portfolio manager at Synovus Trust.\n“How much revenue are you getting from that?” he said. “When I look at this report what I see is Google as it’s always been. They generate money from advertising and search.”\nAlphabet shares fell 4% at 9:45 a.m. in New York on Wednesday. The stock had closed at $181.79 and is up 30% this year.\nInvestor concerns around Alphabet’s spending detracted from better-than-expected sales in the quarter, which were boosted by demand for cloud-computing services and serch advertising revenue.\nSales, excluding partner payouts, were $71.36 billion in the second quarter, the company said in the statement. Analysts had projected $70.7 billion, according to data compiled by Bloomberg. Net income was $1.89 per share, compared with Wall Street’s $1.84 per-share estimate.\nGoogle Cloud brought in profit of $1.17 billion, beating analysts’ estimates for operating income of $982 million. Google still trails Amazon.com Inc. and Microsoft in the cloud computing market, but in the past year, the unit has attracted business from artificial intelligence startups. Investors are also eyeing Google Cloud as the unit with the most potential to boost growth at Alphabet overall, especially as its search business matures.\n“We’ve certainly seen the benefit of our strength in AI, AI infrastructure, as well as generative AI solutions for cloud customers,” Alphabet Chief Investment Officer Ruth Porat said on a call with media. “There is no question customers are turning to us as they are building out their capabilities.”\nIn May, Google announced AI Overviews for search written by generative artificial intelligence technology, but the launch of the feature didn’t go well. Some AI Overviews offered embarrassing suggestions, advising people to eat rocks or to put glue on pizza, for example. Still, quarterly search advertising revenue was $48.5 billion, compared with the average analyst projection for $47.6 billion.\n“If it takes more effort for consumers to go anywhere else to search,” said Evelyn Mitchell-Wolf, an analyst with EMarketer, “Google is going to keep monetizing search traffic higher than any of its competitors.”\nYouTube reported $8.66 billion in revenue, compared with analysts’ average estimate of $8.95 billion. Of Alphabet’s various businesses, YouTube has been the most vulnerable to swings in the digital-ad market.\nAlphabet’s Other Bets — a collection of moonshot units that includes the life sciences business Verily and the self-driving car effort Waymo — brought in $365 million in revenue while posting an operating loss of $1.13 billion. That was steeper than analysts’ projection for a loss of $1.07 billion. Alphabet has recently put pressure on its bets to spin off as independent startups, rather than becoming business units of their parent company.\nIn its latest report, Alphabet indicated that it has $100.7 billion in cash, equivalents and marketable investments, down from the $108 billion it reported in the first quarter. In recent months, Google showed interest in acquiring two companies, either of which would have been the biggest-ever purchase for the internet giant — but both times, the deals fell apart. The acquisitions, for HubSpot Inc. and Wiz Inc., would have strengthened the company’s cloud and cybersecurity offerings, helping it to compete with its tech rivals.\n“We are always looking for good opportunities to diversify the portfolio and will continue to do so if we find the right combination of factors, including value,” Porat said, without commenting on the Wiz talks. “Regulatory scrutiny is not new for us, and we have successfully managed regulatory reviews of many large deals in the past.”\nLater this month, Anat Ashkenazi, a veteran Eli Lilly & Co. executive, will join the search giant as chief financial officer. Porat, Alphabet’s longest serving CFO, will stay on as president and chief investment officer, spending more time working on the company’s portfolio of other bets.\n--With assistance from Ed Ludlow and Shona Ghosh.\n(Updates share price.)\nMost Read from Bloomberg Businessweek\nThe Miseducation of America’s Nurse Practitioners\n‘Dancing With Death’: What It’s Like to Dismantle a Ship\nJoe Rogan Invaded Austin and Became Comedy’s New Kingmaker\nDisney Bets on Deadpool, Wolverine and Dirty Jokes to Save Marvel\nThe $12,000 Harvard Class Celebrities Are Fighting to Get Into\n©2024 Bloomberg L.P.\n"
    }
]