[
    {
        "Date": "2024-08-22T15:24:00.000Z",
        "Title": "Is Alphabet's (GOOGL) Stock Still a Millionaire Maker 20 Years After its IPO?",
        "Author": "  Shaun Pruitt ",
        "Text": "This week marks 20 years since Alphabet GOOGL went public with the holding company being one of the most innovative firms of the 21st Century.\nFormerly known as Google, the iconic search engine pioneer has evolved to cloud computing, ad-based video and music streaming, autonomous vehicle production, and healthcare developments among other endeavors.\nAlphabet has also made significant investments in artificial intelligence and machine learning technologies through its Google research team Brain.\nLucrative acquisitions have fueled Alphabet’s growth with its stock up +19% year to date and skyrocketing over +6,000% since going public in 2004 which has dwarfed the gains of the S&P 500 and Nasdaq.\nImage Source: Zacks Investment Research\nAlphabet’s Acquisition History\nAlong the way to being a tech behemoth, Alphabet has acquired over 200 companies with the largest being the $12.5 billion acquisition of Motorola Mobility in 2012. This acquisition was aimed at accelerating innovation and choice in mobile computing and played a crucial role in implementing the Google Android ecosystem, the largest rival to Apple’s AAPL iPhone iOS.\nOther Lucrative Acquisitions\nWhere 2 Technologies (Acquired in 2004 for an estimated $400 million and led to the creation of Google Maps)\nYouTube (Acquired in 2006 for $1.65 billion) - Video and music streaming platform\nDoubleClick (Acquired in 2007 for $3.1 billion and implemented into Google Marketing)\nWaze (Acquired in 2013 for $966 million) -Traffic and navigation app\nNest Labs (Acquired in 2014 for $3.2 billion) - Smart home products\nDeepMind (Acquired in 2014 for $500 million and merged with Brain in regards to AI development)\nTwitch (Acquired in 2014 for $970 million) - Live streaming platform for gamers\nLooker (Acquired in 2019 for $2.6 billion to provide business intelligence software and data analytics in Google Cloud)\nFitbit (Acquired in 2019 for $2.1 billion) - Wearable fitness devices and app\nMandiant (Acquired in 2022 for $5.4 billion) - Independent cybersecurity services also implemented in Google Cloud\nStock Split History \nAlphabet’s brilliant performance has led to the company splitting its stock twice in its history, the most recent being a 20-1 stock split in July of 2022.\nThe first stock split was a 2-1 split in March of 2014. This split also created two classes for shareholders, Class C shares with no voting rights under the ticker symbol GOOG and Class A for shareholders with voting rights under the new ticker symbol GOOGL. \nImage Source: Macrotrends\nGrowth Trajectory\nBased on Zacks estimates, Alphabet’s total sales are now projected to rise 15% in fiscal 2024 and are slated to increase another 11% in FY25 to $330.36 billion. Annual earnings are expected to soar 31% this year to $7.63 per share versus EPS of $5.80 in 2023. Alphabet’s bottom line is projected to expand another 13% in FY25 to $8.64 per share.\nImage Source: Zacks Investment Research\nAlphabet’s Dividend \nAlphabet recently paid its first-ever dividend in June, which it plans to pay out quarterly with a current yield of 0.48%.  \nImage Source: Zacks Investment Research\nMonitoring Alphabet’s Valuation\nAt current levels, Alphabet’s stock trades at 21.9X forward earnings which is slightly beneath its Zacks Internet-Services Industry average of 23.2X and the S&P 500’s 23.6X. Notably, Alphabet trades nicely beneath its decade-long high of 37X forward earnings and at a discount to the median of 26X during this period.\nImage Source: Zacks Investment Research\nRecent Headwinds & Average Zacks Price Target \nAttributed to its dominance, some of the headwinds Alphabet has faced pertain to regulatory issues. Recently, the U.S. Department of Justice (DOJ) ruled that Google has illegally monopolized the online search and text advertising markets. Implementations of such could potentially lead to forcible actions against Alphabet to break up its businesses or the restriction of certain services.\nStill, the Average Zacks Price Target of $204.71 a share suggests 22% upside in Alphabet’s stock from current levels.\nImage Source: Zacks Investment Research\nConclusion\nOver the years, Alphabet’s stock has taken its shareholders on a wonderful ride and has certainly been a millionaire maker for early investors. That said, GOOGL currently lands a Zacks Rank #3 (Hold) as the next wave of gains may take some time considering potential antitrust headwinds from the DOJ although Alphabet remains one of the most innovative companies to invest in.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-08-15T13:30:00.000Z",
        "Title": "Alphabet's (GOOGL) YouTube Music Efforts Boost Google Services",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet GOOGL is benefiting from strength in the Google Services segment, which is mainly driven by Search, YouTube and Android.The company is continuously expanding YouTube’s capabilities to strengthen the Google Services segment.Per a 9to5Google report, Alphabet recently announced its plans to add a “personal radio” feature to YouTube Music, enabling users to publicly share their personal radio on their profile/channel page. Users can enable this feature by navigating to YouTube Music, selecting their profile icon, and then enabling public stats or public personal radio.This apart, the company added a “Mark as played” feature to YouTube Music, allowing podcasters to mark an episode as played or unplayed, with confirmation messages appearing in the overflow menu.Alphabet’s partnership with Garmin GRMN in a bid to boost YouTube Music’s adoption rate by expanding its reach to more platforms remains noteworthy.The YouTube Music app is now available on Garmin IQ Connect smartwatches. The app experience is similar to Wear OS watches, with users able to search their library for music and podcasts and a slick playing page with physical buttons for play, pause, and skip.Growing YouTube Music efforts will enable Alphabet to capitalize on the solid growth opportunity present in the music streaming market, which, per a Grand View Research report, is expected to witness a CAGR of 14.4% between 2023 and 2030.Moreover, it would also aid Alphabet in narrowing down its gap with Spotify SPOT and Amazon AMZN. Per a Statista report, Spotify maintained its dominant position in the music streaming space in 2023, with a market share of 32%.Amazon, on the other hand, is making continuous efforts to strengthen its foothold in the music streaming market with Amazon Music. It recently introduced Maestro, an AI playlist generator, in Amazon Music, enabling users to create any and all playlists, with the feature currently in beta for select U.S. customers.\nGoogle rolled out an updated version of YouTube’s \"Erase Song\" tool, which allows content creators to remove copyrighted songs from videos without affecting other audio.The company also added a Cast menu redesign to the YouTube app. The updated Cast icon now features a floating bottom sheet with rounded corners, allowing users to control volume and voice search, and also provides remote control options for televisions.In addition to YouTube, Alphabet is making concerted efforts to enhance its search and Android capabilities in a bid to further boost the Google Services segment.Alphabet bolstered its search capabilities with the addition of a “Listen to this page” text-to-speech feature on Google Chrome, enabling users to hear texts on web pages. This new feature will support several languages, including Arabic, Bengali, English, French, Chinese, German, Hindi and Portuguese, to name a few.The company recently introduced an “Everything else” feature in Google Wallet for Android to create digital passes for its users. This option allows users to scan a photo of any pass to create a digital version in Google Wallet.Google upgraded the Locked Folder for Google Photos to bolster its Android offerings. With this new upgrade, a “Locked” option appears directly next to the Favorites, Archive and Trash options in the Google Photos app for much faster access.All the above-mentioned endeavors are expected to drive the performance of the Google Services segment, which is the key growth catalyst for the company. In the second quarter of 2024, revenues from the Google Services business increased 11.5% year over year to $73.93 billion, accounting for 87.2% of the total revenues.The strengthening Google Services segment will, in turn, likely contribute to the overall financial performance of the company in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nGarmin Ltd. (GRMN) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nSpotify Technology (SPOT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-08-13T20:16:45.000Z",
        "Title": "4 Takeaways From Alphabet's 'Made By Google' Launch Event",
        "Author": "  Naomi Buchanan ",
        "Text": "Alphabet's Google (GOOGL) unveiled its Pixel 9 lineup, showcased how it's integrating artificial intelligence (AI) into its devices with Gemini, and more at its Made By Google launch event Tuesday.\nAt the event, Google demoed Gemini Live, its AI assistant that the company introduced at its developers' conference to equip users with generative AI.\nGemini Live is rolling out Tuesday in English to Gemini Advanced subscribers on Android phones and is expected to expand to Apple's (AAPL) iOS and other languages.\nThe new Google AI assistant could help the company better compete with Microsoft-backed (MSFT) OpenAI's ChatGPT voice features and the upcoming iPhone 16 with AI-supercharged Siri.\nGoogle highlighted the improved capabilities of the Pixel 9 phone lineup, including its camera bar, display capabilities, and the integration of AI capabilities.\nThe company said the Pixel devices, which are powered by the new Google Tensor G4, a custom silicon chip, are \"twice as durable\" as the earlier generation and bring \"the best of Google AI.\"\nThe Pixel 9 comes in four different variations, the Pixel 9, Pixel 9 Pro, Pixel 9 Pro XL, and Pixel 9 Pro Fold. Google said the foldable Pixel 9 Pro Fold offers the same features as the other Pixel 9 Pro models on Google's \"biggest ever display on a phone,\" and that the device is thinner than previous models.\nThe Pixel 9 devices are available for pre-order as of Tuesday, with the Pixel 9 and Pixel 9 Pro XL set to be in stores on Aug. 22, and the Pixel 9 Pro and Pixel 9 Pro Fold coming on Sept. 4.\nThe company also announced the Google Pixel Watch 3, which integrates features from Google, Pixel, and Fitbit, and comes in two size options.\nThe next-generation Pixel watch has a \"first-of-its-kind loss of pulse detection that could potentially save lives,\" Google said. The feature can automatically place a call to emergency services with location information if it detects pulse loss.\nThe watch, which competes with Apple's watch line, is available for pre-order Tuesday and for purchase on Sept. 10.\nGoogle announced the Pixel Buds Pro 2 as well, which are equipped with new custom Tensor A1 chips.\nThe new Bluetooth earbuds are lighter and smaller than the Pixel Buds Pro and are made to connect with Google devices and integrate AI capabilities, Google said.\nThe earbuds are available for preorder on Tuesday and will be in stores on Sept. 26.\nAlphabet shares finished 1.2% higher at $164.16 Tuesday and have gained over 17% since the start of the year.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-08-03T22:00:00.000Z",
        "Title": "1 Unstoppable Stock That Could Join Apple, Microsoft, Nvidia, Alphabet, Amazon, and Meta in the $1 Trillion Club",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "It's hard to overstate the degree to which artificial intelligence (AI) has altered the technology landscape since early last year, and nowhere is that more apparent than in the ranks of the world's most valuable businesses.\nWhile the No. 1 position has changed hands several times over the past 12 months, it's currently occupied by Apple. The company's recent AI announcements have energized the Apple faithful, driving its market cap to $3.4 trillion.\nWith its full-court press into AI, Microsoft takes up the No. 2 spot at $3.1 trillion. Nvidia, with its industry-leading AI chip, has doubled over the past year to earn the No. 3 spot at $2.9 trillion. Alphabet, Amazon, and Meta Platforms -- each with solid AI game plans of their own -- are also members of this exclusive fraternity, with market caps of $2.1 trillion, $1.9 trillion, and $1.2 trillion, respectively (as of market close on Wednesday).\nWith a market cap of just $41 billion, it might seem like an exaggeration to suggest that Super Micro Computer (NASDAQ: SMCI), also called Supermicro, might have a shot at joining the $1 trillion club. However, the strong, accelerating demand for servers designed to harness the power of AI -- and the company's years of experience in the field -- suggest Supermicro might have the qualities needed for membership.\nWhile Supermicro has only recently caught the attention of AI-centric investors, the company has been serving up custom-designed servers for more than three decades. This track record of experience served Supermicro well when those wanting to harness the power of generative AI came calling.\nThe company's claim to fame is its track record of developing power-miserly, rack-scale servers that boast a lower cost of ownership. Yet these cost-efficient systems are still able to provide the computational horsepower necessary to harness the power of AI and hyperscale data centers.\nFurthermore, Supermicro's building-block architecture ensures it can create a system to accommodate any budget or technology level. Finally, partnerships with the most important names in AI chips, including Nvidia, Advanced Micro Devices, and Intel, among others, ensure a steady supply of the most in-demand processors.\nThis successful strategy has helped generate meteoric growth. For its fiscal 2024 third quarter (ended March 31), revenue surged 200% year over year to $3.8 billion, while its earnings per share (EPS) of $6.56 soared 329%. Management is forecasting its triple-digit growth will continue, raising its full-year revenue guidance to $14.9 billion, which would represent growth of 109%.\nManagement said Supermicro grew 5 times faster than the industry average over the preceding 12 months, suggesting the company is gaining market share. Analysts at Northland came to the same conclusion, noting the company has increased its market share from 8% to 11%, with \"plenty of room for future share gains.\"\nFinally, in a nod to Supermicro's importance within the broader market, the stock was added to the Nasdaq-100 Index on July 22.\nSupermicro has the inside track when compared to its rivals. When demand for AI servers ratcheted up last year, the company was nimble enough to adjust on the fly. Its strong relationships with all the top AI chipmakers gave Supermicro a steady supply of the processors needed to outfit its high-end servers. That said, it will be some time before Supermicro achieves the title of trillionaire.\nAccording to Wall Street, Supermicro is on track to deliver revenue of $14.9 billion in 2024, giving it a forward price-to-sales (P/S) ratio of roughly 2.75. Assuming its P/S remains constant, Supermicro would have to grow its revenue to about $363 billion annually to support a $1 trillion market cap. Still, those days are a long way off, as Supermicro is scrambling to increase its production capacity to support sales of $25 billion.\nIf the company can keep up its triple-digit year-over-year growth, Supermicro could reach the $1 trillion market cap as soon as 2029. However, even the bulls concede that maintaining growth of that magnitude is unlikely to happen. What's more likely is that the growth rate tapers off to a more manageable 50%, in which case Supermicro could reach a $1 trillion market cap by 2032.\nSome on Wall Street believe the demand for AI-capable servers will continue for years. Bank of America analyst Ruplu Bhattacharya calculates the market will increase at a compound annual growth rate of 50% over the next three years, maintaining that Supermicro's revenue could \"grow even faster.\"\nThis helps underscore the massive opportunity. If Supermicro captures just a small part of that windfall, the company will be a member of the $1 trillion club in short order.\nBefore you buy stock in Super Micro Computer, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Super Micro Computer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $657,306!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 29, 2024\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Bank of America is an advertising partner of The Ascent, a Motley Fool company. Danny Vena has positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Super Micro Computer. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Bank of America, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short August 2024 $35 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n1 Unstoppable Stock That Could Join Apple, Microsoft, Nvidia, Alphabet, Amazon, and Meta in the $1 Trillion Club was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-08-23T09:00:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Taiwan Semiconductor, Intel, Apple, Alphabet, NVIDIA, iShares Semiconductor ETF, Advanced Micro Devices and Arm",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – August 23, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Taiwan Semiconductor Manufacturing Company Ltd. TSM, Intel Corp. INTC, Apple Inc. AAPL, Alphabet Inc. GOOGL, NVIDIA Corporation NVDA, iShares Semiconductor ETF SOXX, Advanced Micro Devices, Inc. AMD and Arm Holdings plc ARM.\nThe semiconductor industry has witnessed stupendous growth over the past four decades, with chips becoming an integral part of electronic devices like computers and smartphones, to name a few. An increase in acceptance of emerging technologies like the Internet of Things (IoT) and artificial intelligence (AI) is expected to fuel demand for semiconductors.\nManufacturing, healthcare, and retail sectors have already integrated digital technologies that require robust semiconductor solutions. Thus, the global semiconductor industry is likely to witness a CAGR of 14.9% from 2024 to 2032, hitting $2062.59 billion by 2032, per Fortune Business Insights.\nHowever, despite the positive trend, picking the top semiconductor stocks is challenging since their sales fluctuate incessantly. So, here is one chip stock to buy right away — Taiwan Semiconductor Manufacturing Company Ltd. — and one industry bigwig to shun — Intel Corp.\nTaiwan Semiconductor Manufacturing expects healthy demand for its chips as more companies begin to implement AI features in smartphones. Apple Inc.’s initiative to launch the iPhone 16 this fall should boost demand for Taiwan Semiconductor Manufacturing’s chips. The new “Apple Intelligence” system has already benefited Taiwan Semiconductor Manufacturing. Apple is one of the biggest clients of Taiwan Semiconductor Manufacturing and accounts for around one-fourth of TSM’s revenues.\nDemand for AI applications like Alphabet Inc.’s Gemini and Open AI’s ChatGPT has increased noticeably. But such applications require huge data, kept in data centers, which rely on graphic processing units (GPUs) that NVIDIA Corporation manufactures. And without TSM’s manufacturing prowess, the GPUs can’t be operative. So, in a way, the surging demand for AI applications would continue to boost Taiwan Semiconductor Manufacturing’s sales over the next several years and help its shares soar.\nNo doubt, Taiwan Semiconductor Manufacturing’s earnings outlook for the current year remains promising, with the $6.45 Zacks Consensus Estimate for earnings per share up 11.4% from a year ago.\nTaiwan Semiconductor Manufacturing’s shares have already outperformed the iShares Semiconductor ETF this year (+64.6% vs. +22.6%).\nIntel, regrettably, is losing its competitive edge over its rival Advanced Micro Devices, Inc. Intel is in a fix after failing to make much progress in its foundry business. AMD has progressed significantly in producing high-performance processing machinery. Intel’s failure to take advantage of the ever-growing AI applications industry is alarming against the strong growth posted by Taiwan Semiconductor Manufacturing, which is currently the industry standard.\nOn the other hand, Arm Holdings plc is disrupting Intel’s server, storage, and networking space. ARM’s designs in the micro server segment have witnessed espousal by quite a lot of Intel’s competitors. As a result, Intel’s earnings outlook for the current year remains bleak, with the $0.38 Zacks Consensus Estimate for earnings per share down a massive 77.5% from a year ago.\nIntel’s shares have underperformed SOXX year to date, down 57.4%. Notably, both Taiwan Semiconductor Manufacturing and Intel are listed in SOXX.\nTaiwan Semiconductor Manufacturing, by the way, has generated profits more competently than Intel. This is because TSM has a return on equity (ROE) of 25.5%, while Intel’s is around 4.4%. As a thumb rule, any reading above 20% is primarily considered very strong.\nMeanwhile, Taiwan Semiconductor Manufacturing is a solid dividend payer, which is indicative of a stable business model. Its dividend payout ratio sits at 31% of earnings, a low payout that indicates the company is reinvesting the bulk of its earnings in research and development, a must for growth. Whereas, Intel’s dividend payout ratio is 109% of earnings, which is unsustainable.\nTaiwan Semiconductor Manufacturing’s shares are less expensive than Intel’s, which has given the integrated circuit foundry an edge over the world’s largest semiconductor company. After all, buying INTC’s shares will burn a larger hole in your wallet than the TSM stock.\nThis is because, per the Price/Earnings ratio, TSM stock presently trades at 26.5X forward earnings. However, INTC’s forward earnings multiple is 56.6X.\nTaiwan Semiconductor Manufacturing, rightfully, is a better buy than Intel as it is well-positioned to make the most of the growth in AI, can generate profit consistently, and has a lower valuation.\nProminent brokers have also increased the average short-term price target of TSM by almost 19% from the company’s last closing price of $172.04. The analysts’ highest price target is at $250.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nARM Holdings PLC Sponsored ADR (ARM) : Free Stock Analysis Report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\niShares Semiconductor ETF (SOXX): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]