[
    {
        "Date": "2024-09-08T23:47:22.000Z",
        "Title": "Alphabet Inc. (GOOGL): Among the Unrivaled Stocks of the Next 10 Years",
        "Author": "  Bob Karr ",
        "Text": "We recently compiled a list of the 10 Unrivaled Stocks of the Next 10 Years. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against the other unrivaled stocks of the next 10 years.\nGrowing a business is not an easy task. Several factors come into the picture when you talk about growth. In 2019, McKinsey reported that ~50% of the companies that enjoyed healthy and stable shareholder returns but didn’t see top-line growth were either acquired or delisted. Growth is getting tougher amidst new market dynamics such as higher consumer expectations, competitive intensity, and digital disruption. Growth can only be rewarded to businesses that spot opportunities at hyper-granular levels and then seize them quickly.\nWarren Buffett, the billionaire CEO of Berkshire Hathaway Inc., mentioned that he tends to rate businesses based on their ability to increase prices. He pays so much attention to the pricing power that he sometimes doesn’t even consider the people who are managing the business. Buffett has had a successful career of stock picking and takeovers.\nThe veteran investor has bought companies in the business of railroads and electricity producers, whose pricing power comes from a dearth of competitive options available to their clients. Buffett has also built stakes in several consumer discretionary companies relying on the appeal of their brands to bring in customers.\nWall Street analysts expect that S&P 500 companies are expected to report steady earnings growth in 2024. They anticipate a ~5.4% earnings growth in 3Q 2024 and over ~15% earnings growth in 4Q 2024. The S&P 500’s forward price-to-earnings ratio sits at ~22.40x as of August 30. The 10-year average forward price-to-earnings ratio came at ~17.9x, suggesting that the stock valuations might be slightly stretched.\nMoving forward, the US presidential election remains the most significant potential market catalyst for 2H 2024. Landsberg Bennett Private Wealth Management believes that inflation numbers might surprise to the upside towards the end of 2024 and into 2025. This is because year over year comparables might become more difficult and the effects of increased Chinese shipping rates start reflecting in the inflation data points.\nA “higher-for-longer” backdrop favoured larger and higher-quality companies that are less cyclical and rate-sensitive. Such companies were supported by mania in Artificial Intelligence/Large Language Models (AI/LLM) stocks. JPMorgan believes that, in the US equities, momentum crowding and stock market concentration reached multi-decade extremes.\nMarket volatility in the US remains low, with VIX averaging only ~14 for the year to July 2024. This was mainly because of fundamental and technical factors, such as rising markets, risk complacency, and lower realized correlation, among others.\nIn Europe and other areas, the broader equities were supported by improved economic activity and the expectation of multiple Fed cuts at the start of 2024. However, the growth-policy trade-off might worsen in 2H 2024. JPMorgan believes that “there is a risk of disappointment.” The large bank expects that the Fed might stay ‘higher-for-longer,’ US activity momentum might decelerate and there can be a softening of pricing and top-line growth. Collectively, this might hurt earnings delivery in 2H 2024. Therefore, investing in stocks with wide economic moats and companies having significant market share should help offset the losses in the remainder of 2024.\nOur methodology\nTo list 10 unrivaled stocks of the next 10 years, we sifted through wide moat ETFs and checked online rankings. Next, we narrowed our list by filtering out the companies that have held a near-monopoly status for years or decades. Finally, we ranked the stocks in ascending order of the number of hedge funds that hold them, as of 2Q 2024\nAt Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nNumber of hedge fund holders: 216\nAlphabet Inc. (NASDAQ:GOOGL) is a holding company and the internet media giant, Google, is its wholly-owned subsidiary.\nThe internet giant enjoys a wide economic moat given its durable competitive advantages, which are derived from its intangible assets, and its network effect. Alphabet Inc. (NASDAQ:GOOGL) possesses significant intangible assets with its overall technological expertise concerning algorithms and AI (machine learning and deep learning), and access to and accumulation of valuable data for advertisers. Regardless of its actual technological competency, the company’s search engine is regarded as being the most advanced in the industry. As a result of these factors, Alphabet Inc. (NASDAQ:GOOGL) retains an impressive share of just over ~80.0% of the global desktop search market.\nMoving forward, Alphabet Inc. (NASDAQ:GOOGL)’s revenues are expected to be primarily supported by continued growth in digital ad spending from Asia-based retailers. Also, YouTube should benefit from strong reach and usage frequency. Its video-only content format is attractive to the brand advertisers.\nAlphabet Inc. (NASDAQ:GOOGL) should be able to defend its search dominance over the next decade with its own AI technology. The company is focused on investing in AI to drive growth throughout its offerings, such as advertising and Cloud.\nAnalysts at Wolfe Research initiated coverage on the shares of Alphabet Inc. (NASDAQ:GOOGL) on 16th July. They gave an “Outperform” rating, with a price target of $240.00 per share.\nPatient Capital Management, a value investing firm, released its 2Q 2024 investor letter and mentioned Alphabet Inc. (NASDAQ:GOOGL). Here is what the fund said:\n“Alphabet Inc. (NASDAQ:GOOGL) was a top contributor in the second quarter, finally catching up to its peers in the Magnificent 7. The company gained 20.8% in the period following strong first-quarter earnings, a new $70B repurchase program (3% of shares outstanding), and the initiation of a cash dividend ($0.20 per share; 0.42% yield). We continue to believe the market underappreciates Google’s exposure to AI with its Gemini model being integrated into search results, YouTube advertising, and its cloud offering. We continue to think that the cloud players will be the AI winners in the long-term, with Google being well-positioned to take advantage. While the company trades at 24x 2024 earnings, if you remove the money-losing and under-earning businesses, you realize that you are paying below a market multiple for the core Google business. We do not believe there are many other AI winners trading at such an attractive multiple.”\nOverall GOOGL ranks 1st on our list of the unrivaled stocks of the next 10 years. While we acknowledge the potential of GOOGL as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a deeply undervalued AI stock that is more promising than GOOGL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-09-30T16:29:25.000Z",
        "Title": "Alphabet Inc. (GOOGL): Dominating AI and Cloud Markets with $50 Billion Investment Strategy",
        "Author": "  Maham Fatima ",
        "Text": "We recently published a list of 10 Best Major Stocks to Invest In According to Analysts. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against the other best major stocks to invest in according to analysts.\nThe current economic landscape presents a mix of signals as market participants assess the necessity of additional interest rate cuts. Despite overall economic strength, the Fed has hinted at potential rate reductions due to weaknesses in specific sectors. Currency dynamics are also shifting, with the US dollar weakening against the euro, adding another layer of complexity to the market environment. Amidst this backdrop, major stock indices, including the Dow Jones, continue to hover near record highs.\nAs analysts and market participants navigate these developments, they must consider how these factors may influence investment strategies in the coming months. Recently, discussions have emerged regarding the implications of potential rate cuts and their effects on various sectors of the economy. Some experts argue that further cuts may be necessary to support smaller businesses and consumers who are still adjusting to previous interest rate hikes.\nStephanie Link, Chief Investment Strategist and Portfolio Manager at Hightower thinks that a soft landing for the economy despite market volatility is anticipated, which is a contrasting perspective amidst market volatility and uncertainty. While there are concerns regarding the performance of small-cap stocks and their ability to keep pace with larger assets, she thinks the economy may stabilize without entering a recession. We talked about this in more detail in our article on the 10 Best Young Stocks To Buy Now, here’s an excerpt from it:\n“….She believes that the Fed is skillfully guiding the economy towards a soft landing, even amidst the expected market fluctuations before the elections.\nJohn Stoltzfus from Oppenheimer Asset Management joined CBNC’s ‘Squawk on the Street’ on September 25 to discuss the difference the Fed’s recent rate cut makes. It was highlighted that the S&P 500 is experiencing a remarkable moment, having just achieved its 41st record close of the year. Oppenheimer’s Chief Investment Strategist has set a target of 5,900 for the index, attributing this optimistic outlook to the recent rate cuts by the Fed.\nStoltzfus explained that the significance of these cuts lies in their actual implementation after a long period of rate hikes and pauses. He described the rate cut as a down payment from the Fed to both Wall Street and Main Street, signaling that further cuts could be on the horizon if necessary. Since this announcement, the market has shown mixed reactions, with defensive stocks performing well at times while technology stocks have also seen gains.\nWhen discussing consumer discretionary stocks, Stoltzfus expressed that this sector is one of their favorites despite its underperformance earlier in the year. He noted that there has been a noticeable improvement in performance over recent months as investors recognize consumer resilience. However, he emphasized that within consumer discretionary, investors should focus on select companies rather than expecting a broad rally across the sector. Retailers leveraging e-commerce effectively are likely to perform better during the upcoming holiday season.\nThe conversation also touched on concerns regarding discounts in various sectors, particularly electronics. Stoltzfus acknowledged that value has become a key focus for consumers, which has led to increased competition among retailers. This competition allows consumers more options but may also pressure profit margins for some retailers. Nonetheless, he pointed out that many businesses within consumer discretionary, beyond just retail, are likely to maintain healthy margins.\nStoltzfus’ discussion highlighted the positive impact of the Fed’s rate cuts on market sentiment and consumer behavior while recognizing challenges in specific sectors. The outlook remains optimistic as investors navigate through these transitions and prepare for potential opportunities in consumer discretionary stocks and other sectors.\nMethodology\nWe used stock screeners to look for mega cap stocks. We then selected the top 10 stocks with the highest upside potential (more than 15%), that were also the most popular among elite hedge funds, as of Q2 2024. The stocks are ranked in ascending order of their upside potential.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nAverage Upside Potential: 26.68%\nMarket Cap as of September 26: $1989.17 billion\nNumber of Hedge Fund Holders: 216\nAlphabet Inc. (NASDAQ:GOOGL) is a multinational technology conglomerate holding company, best known for its subsidiary, Google, focusing on technology-related products and services, including internet search, cloud computing, artificial intelligence, hardware, and software development, and is known for its innovative products, strong brand recognition, and commitment to advancing technology.\nGoogle maintains a dominant position in the search engine market, with approximately 91.06% market share, and is continually improving Gemini and developing AI hardware.  While Google’s TPUs (Tensor Processing Units) only hold about 20% of the market, their advancements promise increased market share. Additionally, Google’s 6th generation chips are 67% more energy efficient than their predecessors.\nThe company is investing heavily in AI, with plans to spend $50 billion by the end of 2024. Its strong competitive advantages, including its algorithms, AI expertise, and valuable data access, position it well for future growth in this segment. Over 60% of GenAI startups and 90% of GenAI unicorns are customers of the Google Cloud.\nAlphabet Inc. (NASDAQ:GOOGL) is anticipated to reach $100 billion in combined revenue from YouTube Ads and Google Cloud by the end of 2024. In Q2, Google Cloud revenue grew 28.8%, contributing to an overall revenue increase of 13.59%.\nIts Waymo division is a major player in the autonomous driving industry, with 700+ cars operating in San Francisco alone. It has faced criticism for incidents like fires, crashes, and traffic violations. Despite these challenges, Waymo offers robotaxi services and has reported providing 100,000 rides in San Francisco, Los Angeles, and Phoenix.\nThe company’s strong competitive advantages, including its AI expertise and valuable data, combined with its dominant position in search and mobile, make it a leading beneficiary of the growing AI market. Alphabet’s focus on innovation and cost efficiency positions it for long-term success.\nPatient Capital Management stated the following regarding Alphabet Inc. (NASDAQ:GOOGL) in its Q2 2024 investor letter:\n“Alphabet Inc. (NASDAQ:GOOGL) was a top contributor in the second quarter, finally catching up to its peers in the Magnificent 7. The company gained 20.8% in the period following strong first quarter earnings, a new $70B repurchase program (3% of shares outstanding) and the initiation of a cash dividend ($0.20 per share; 0.42% yield). We continue to believe the market underappreciates Google’s exposure to AI with its Gemini model being integrated into search results, YouTube advertising and its cloud offering. We continue to think that the cloud players will be the AI winners in the long-term, with Google being well positioned to take advantage. While the company trades at 24x 2024 earnings, if you remove the money-losing and under-earning businesses, you realize that you are paying below a market multiple for the core Google business. We do not believe there are many other AI winners trading at such an attractive multiple.”\nOverall GOOGL ranks 3rd on our list of best major stocks to invest in according to analysts. While we acknowledge the potential of GOOGL as an investment, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than GOOGL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-09-30T12:00:23.000Z",
        "Title": "Unlocking Intrinsic Value: Analysis of Alphabet Inc",
        "Author": "  GuruFocus Research ",
        "Text": "In this article, we will take a look into Alphabet Inc's (NASDAQ:GOOGL) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 5 Warning Sign with META.\nAs of 2024-09-30, Alphabet Inc's intrinsic value as calculated by the Discounted Earnings model is $242.28. It's currently trading at a price of $163.95. Therefore, the margin of safety based on the DCF model is 32.33%. The company is significantly undervalued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Alphabet Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$7.04\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n10%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 3.78%, rounded up to the nearest whole number, which is 4%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 21.80% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n128.67\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n145.15\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n242.28\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $163.10. This valuation indicates that the Alphabet Inc is fair valued, accompanied by a margin of safety of -0.52%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-09-05T17:34:16.000Z",
        "Title": "Alphabet Remains Core Tech Bet But Regulatory Risks and AI Uncertainties Loom: Analysts",
        "Author": "  Anusuya Lahiri ",
        "Text": "Analysts re-rated Google parent Alphabet Inc (NASDAQ:GOOGL) Thursday.\nCantor Fitzgerald analyst Deepak Mathivanan initiated coverage on Alphabet with a Neutral rating and a price target of $190.\nWedbush analyst Scott Devitt reiterated Alphabet with an Outperform rating and a $205 price target.\nCantor Fitzgerald: Mathivanan noted that Google should remain at the core of a growth-oriented technology, media, and telecom (TMT) portfolio. However, the analyst noted limited upside to both Street estimates and valuation multiples in the next 12-18 months.\nGoogle’s core Search revenue growth has accelerated over the last five quarters to exceed +15% in constant currency in the second quarter. As per the analyst, while growth should decelerate from here, Search should steadily benefit from query volume growth and monetization gains over the next few years.\nHe said that share loss to competition, directly and indirectly, appears minimal so far. Early feedback on generative AI User experience (UX) appears positive and enables Google to mitigate use-case erosion.\nAccording to fundamentals, the core search business has several levers to grow, plus double digits in fiscals 2024 and 2025, Mathivanan writes.\nHowever, recent regulatory setbacks bring plenty of medium-long-term uncertainties while search UX transforms with expensive AI deployments.\nAdditionally, fiscal 2023 EPS growth will likely face headwinds from accelerating infrastructure costs and headcount additions.\nGoogle stock is currently trading at 19x fiscal 2025 EPS, a discount to mega-cap peers, which he noted as unlikely to change while near-term regulatory and AI-related uncertainties linger. Mathivanan projects third-quarter revenue of $85.5 billion and EPS of $1.86.\nWedbush: On September 9, the second antitrust trial against Google in 2024 will commence in the U.S. District Court, Devitt noted.\nThe U.S. DOJ complaint primarily focuses on Google’s ad tech stack, specifically Google Ad Manager. Devitt flagged the DOJ’s complaint proposing the divestiture of the Google Ad Manager Suite but does not identify other areas of the ad tech stack as specific targets for divestiture.\nThe analyst noted that Google Ad Manager represented only 4.1% of revenue and 1.5% of the operating profit of the consolidated Alphabet business in 2020.\nWhile the analyst acknowledged near-term headline risk associated with the pending trial, he noted the overall risk to the industry is limited based on the company’s recent financial disclosures related to its ad tech products.\nPrice Action: GOOGL stock is up 0.20% at $156.77 at the last check on Thursday.\nImage via Shutterstock\nDate\nFirm\nAction\nFrom\nTo\nFeb 2022\nMKM Partners\nMaintains\nBuy\nFeb 2022\nMizuho\nMaintains\nBuy\nFeb 2022\nPiper Sandler\nMaintains\nOverweight\nView More Analyst Ratings for GOOGL\nView the Latest Analyst Ratings\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nALPHABET (GOOGL): Free Stock Analysis Report\nThis article Alphabet Remains Core Tech Bet But Regulatory Risks and AI Uncertainties Loom: Analysts originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-10-01T07:15:44.000Z",
        "Title": "Alphabet Inc. (GOOGL): A Cheap Internet Stock to Invest In Now",
        "Author": "  Talha Qureshi ",
        "Text": "We recently compiled a list of the 7 Cheap Internet Stocks To Invest In Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against the other cheap Internet stocks.\nRecently, China’s stock market has seen a sharp rally, driven by some aggressive measures by the government to revive the economy. China is the world’s second-largest economy and one of the key players in the technology industry. This huge economy has faced a series of challenges for the past few years in the shape of a sharp property market downturn and a lack of consumer confidence.\nThe government measures include interest rate cuts and liquidity injection into the market. On September 24, Reuters reported China’s central bank cut bank reserve requirement by 50 basis points and it also reduced interest rate by 20 basis points to 1.5%. Moreover, the bank also plans to issue 2 trillion yuan in special sovereign bonds.\nThese measures resulted in the CSI 300 index trading higher. The index closed 4.5% higher after the announcement whereas the Hong Kong Index gained 3.6%. This move by the Chinese central bank is said to have a positive effect around the globe. Analysts in the United States are already discussing the news as “China Boost”. While many analysts are calling this boost to be short-lived, others are confident that this is a positive mood and will benefit the market in the long term.\nDavid Tepper, Appaloosa Management founder and president and Carolina Panthers owner joined CNBC for an interview recently to talk about the global impact of the Chinese stimulus.\nWhile drawing a comparison between the Chinese and the United States stock markets, Tepper pointed out that Chinese stocks have been trading at single-digit multiples with earnings expected to grow in double digits for major stocks at least. On the other hand, the United States S&P average is sitting at more than 20 times.\nTepper believes that China has exceeded expectations with the recent move and while quoting the government officials of China he pointed out that they are willing to do more if needed. He further emphasized that the central bank is encouraging buybacks of stocks and they are even lending money to do that at very cheap rates. This is an internal stimulus that is going to encourage consumption and Tepper believes that the Chinese government is doing everything it can to revive the economy.\nWhile talking about the global impact of this move, Tepper mentioned that the European market is already making cuts, the United States market has seen one cut already with more expected during the year, and with the Chinese making cuts Japan is expected to follow suit. Tepper thinks this is a very good scenario for undervalued stocks in China and around the world in general. As an American investor as well, Chinese stocks look cheap when compared to the market average. Moreover, Tepper thinks that the United States is not a cheap market currently, he thinks it is slightly overvalued. Though it is a tough comparison, if you compare the price-to-earnings ratio of global stock markets, the United States will find itself slightly overvalued.\nOur Methodology\nTo compile the list of 7 cheap internet stocks to invest in now we used the Finviz stock screener and ETFs. Using these sources we aggregated a list of 15 internet stocks. From these stocks we selected stocks that are trading below the Forward Price-to-Earning ratio of 23.98 (the market’s forward P/E as per the Wall Street Journal) and earnings expected to grow during the year. Once we had the list of cheap internet stocks, we then ranked them based on the number of hedge funds that held stakes in them in Q2 2024, which we took from Insider Monkey's database of over 900 hedge funds. The list is ranked in ascending order of the number of hedge fund holders.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nForward P/E Ratio: 21.14 \nEarnings Growth This Year: 31.90% \nNumber of Hedge Fund Holders: 216\nAlphabet Inc. (NASDAQ:GOOGL) is one of the leaders when it comes to internet stocks. At its basics, the company is an international technology hub with operations running in cloud computing, internet search, artificial intelligence, software development, and hardware as well. Its search engine Google has gone on to become a synonym for internet search engine.\nWhile Google continues to maintain it's market-leading position with more than 91% market share, Alphabet Inc. (NASDAQ:GOOGL) is continuously developing its AI technology. The company has launched its large language model Gemini to compete in the generative AI race. And has plans to invest more than $50 billion in AI development. The company also runs YouTube, which is a video streaming platform.\nApart from this, its cloud business is also soaring with more than 60% of GenAI startups using its Google Cloud. The cloud revenue of the company grew 28.8% year-over-year during the second quarter of 2024. Overall, Alphabet Inc. (NASDAQ:GOOGL) was able to grow its revenue by 14% to reach $84.7 billion.\nBy the end of the year, management anticipates the company’s revenue to reach $100 billion. What’s truly impressive is its cheap valuation. GOOGL is trading at a forward P/E of 21 and analysts expect its earnings to grow by 32% during the year, making it one of the cheapest internet stocks to invest in now.\nPatient Capital Opportunity Equity Strategy stated the following regarding Alphabet Inc. (NASDAQ:GOOGL) in its Q2 2024 investor letter:\n“Alphabet Inc. (NASDAQ:GOOGL) was a top contributor in the second quarter, finally catching up to its peers in the Magnificent 7. The company gained 20.8% in the period following strong first quarter earnings, a new $70B repurchase program (3% of shares outstanding) and the initiation of a cash dividend ($0.20 per share; 0.42% yield). We continue to believe the market underappreciates Google’s exposure to AI with its Gemini model being integrated into search results, YouTube advertising and its cloud offering. We continue to think that the cloud players will be the AI winners in the long-term, with Google being well positioned to take advantage. While the company trades at 24x 2024 earnings, if you remove the money-losing and under-earning businesses, you realize that you are paying below a market multiple for the core Google business. We do not believe there are many other AI winners trading at such an attractive multiple.”\nOverall GOOGL ranks 1st on our list of the cheap Internet stocks to buy. While we acknowledge the potential of GOOGL as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for a promising AI stock that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    }
]