[
    {
        "Date": "2024-10-06T15:01:47.000Z",
        "Title": "Amazon closes more of its cashierless convenience stores",
        "Author": "  Maxwell Zeff ",
        "Text": "Amazon has shut down three more stores featuring its Just Walk Out technology, but the company says it remains committed to building out that technology as an offering for third-party merchants.\nThe e-commerce giant closed three of its Go convenience stores in New York last week, The Information confirmed on Friday, leaving just 17 across the nation. (Amazon notes it recently opened one in Washington.) These convenience stores use AI systems to track what customers pick up, allowing them to buy items without ever having to formally check out with a cashier. Since 2023, Amazon has cut the number of Go storefronts it operates nearly in half. In a statement, the company said it closed these particular stores for economic reasons. \"In this case, while these three stores were performing well, we couldn't make the economics work with the lease cost, so we've decided not to renew and have closed these locations,\" a spokesperson said.\nAmazon pulled Just Walk Out technology from its next-generation grocery stores earlier this year, saying at the time it would focus more on smaller grab-and-go shops – but maybe not its own. Amazon licenses Just Walk Out technology to lots of third party convenience stores, and Amazon says it's still committed to the Go format and technology as a whole.\nUpdate: This story has been updated to reflect the reason Amazon closed these stores. \nThis article originally appeared on TechCrunch at https://techcrunch.com/2024/10/04/amazon-closes-more-of-its-cashierless-convenience-stores/\n"
    },
    {
        "Date": "2024-10-05T10:12:00.000Z",
        "Title": "Sonia Borrell Celebrates Book Launch, Art in Real-Time, Hitting Amazon Bestseller List In Just Days",
        "Author": "  Tryson Collection ",
        "Text": "Art Collector, Curator, and Advisor Sonia Borrell shares 16 years of experience in the contemporary art world through her debut book.\nLONDON, UK / ACCESSWIRE / October 5, 2024 / Internationally renowned art collector and curator Sonia Borrell recently launched her first book, Art in Real-Time: Collecting Tomorrow's Masters, in mid-September. Becoming an Amazon bestseller and quickly capturing the attention of art collectors and enthusiasts worldwide, she further bagged number one bestseller position in various categories, including Business in Art and Women in Art, for both Kindle and hardcover formats, within two days of its launch, making her the top author in this genre across Europe and the USA. The book is a part-guide, part-memoir aimed towards young collectors and artists to learn how to develop their taste, get involved in collecting, and navigate the industry. It embodies Sonia Borrell's philosophy of art collecting-viewing art as a way of living and believing that these young artists are, and will be, as impactful as those before them.\nAvailable for purchase on Amazon, it offers a comprehensive guide for art collectors, curators, and enthusiasts who want to deepen their understanding of the Ultra-Contemporary Art movement, also known as the \"New-Now.\" With contributions from leading figures in the art world, Art in Real-Time provides unique insights into the fast-paced and ever-evolving art industry.\nBorrell, whose extensive collection includes works from some of the world's most acclaimed contemporary artists, such as Takashi Murakami and Yoshitomo Nara, brings her decades-long expertise into a detailed and practical format for readers. Her career has seen her curating exhibitions worldwide, advising high-profile clients, and contributing to the development of art scenes in regions like the Middle East, where she has been actively involved in nurturing artistic talent.\nArt in Real-Time is not only a guide but also a memoir that highlights Borrell's personal experiences as she navigated the art world, built relationships with artists, and developed an influential collection. Readers will find step-by-step advice on how to start their own art collections, no matter the budget-whether starting at minimum or extending into six figures. In addition, Borrell addresses essential topics such as recognizing market trends, engaging with galleries, and the importance of building relationships with artists.\nThe book features an eclectic array of chapters that weave together Sonia Borrell's personal insights and the expertise of distinguished contributors from across the global art community.\nIt begins with introspective discussions on learning, cultural exposure, and the profound impact of art in real-time, before exploring the intricacies of building meaningful collections with various budgets. The chapters provide a roadmap for collectors of all levels, diving deep into practical aspects such as navigating art galleries, engaging with artists, and understanding the dynamics of the art market. Contributions from industry experts enrich the narrative, offering diverse perspectives on everything from collecting wishlists and social networks within galleries to mastering artistic collaborations and navigating the often hidden challenges of art flipping. The book also tackles contemporary issues such as the pandemic's impact on the art world and the importance of preserving art through contracts. Each chapter serves as a nuanced exploration into the multifaceted world of art collecting, culminating in a masterclass for both aspiring artists and collectors.\nA Collaborative Effort from the Art World's FinestThe book also includes contributions from notable art professionals such as Géraldine Zberro, Carl Kostyál, and August Vilella. These voices offer a rich array of perspectives, covering everything from understanding the inner workings of galleries to protecting the integrity of the art market.\nBorrell's own journey has spanned global art markets and trends, and her work has been featured in museums such as the Thyssen-Bornemisza National Museum in Madrid and the Kyoto City KYOCERA Museum of Art. She has also garnered significant media attention, with features in publications like GQ Middle East and Harper's Bazaar. Her deep involvement in fostering contemporary art in Saudi Arabia, particularly through her advisory role at The Althari Group, further positions her as a prominent figure in today's art scene.\nArt in Real-Time will be officially launched on Amazon in mid-September 2024. The digital version will be available for worldwide shipping, ensuring access to readers and art lovers globally.\n\"I wanted to create a resource that would resonate with anyone who has a passion for art,\" says Borrell. \"The book is designed for collectors, curators, and anyone with a desire to learn more about the art world-whether you're just getting started or already deep in the scene.\"\nAbout Sonia BorrellSonia Borrell is an internationally recognized art collector, curator, advisor, and founder of the Tryson Collection, established in 2008. With a Master's degree in Law from the University of Barcelona (UAB), she has built a multifaceted career that bridges the legal, entrepreneurial, and creative worlds. Her brand is dedicated to discovering and uplifting new talent in the Ultra-Contemporary Art scene, making her a pivotal figure in the modern art community.\nMedia Contact\nOrganization: Tryson CollectionContact Person Name: Alexander Grindheim & Marwan KamelWebsite: http://www.trysoncollection.comEmail: admin@trysoncollection.com\nSOURCE: Tryson Collection\nView the original press release on accesswire.com\n"
    },
    {
        "Date": "2024-10-03T18:00:25.000Z",
        "Title": "Google Assures Employees It's Not About To Pull Off An Amazon On Them When It Comes To Work From Home",
        "Author": "  Kaustubh Bagalkote ",
        "Text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nAlphabet Inc’s (NASDAQ:GOOGL) (NASDAQ:GOOGL) subsidiary Google has confirmed it will not follow Amazon.com Inc’s (NASDAQ:AMZN) strict return-to-office policy.\nWhat Happened: During a recent town hall, Alphabet Inc. CEO Sundar Pichai emphasized that maintaining productivity while working remotely is key to continuing the current flexible work arrangement, reported Business Insider.\nDon’t Miss:\nThis billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nYour biggest returns may not come from the stock market. Invest the way colleges, pension funds, and the 1% do. Get started investing in commercial real estate today.\nAmazon’s recent decision to require employees to return to the office five days a week has sparked concern among its workforce and competitors. Google employees, who currently work in the office three days a week, sought reassurance about their hybrid work model during a “TGIF” all-hands meeting.\nJohn Casey, Google’s vice president of global compensation and benefits, informed staff that the existing system remains effective, according to the report. However, he stressed the importance of being in the office at least three days weekly. Pichai reiterated the need for productivity during remote work to maintain policy flexibility.\nDespite these reassurances, some Google employees remain apprehensive about potential future changes. Google has implemented measures like hot-desking and “neighborhoods” in some offices to adapt to the hybrid model. Meanwhile, other companies, like Dell Technologies Inc., have followed Amazon’s lead, requiring more in-office presence.\nA Google spokesperson confirmed the statements made by Pichai and Casey, according to the report.\nTrending: A billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today. This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nWhy It Matters: Amazon’s decision to enforce a full-time return to the office has led to significant unrest among its employees. A survey revealed that 73% of Amazon workers are considering leaving their jobs due to the new policy, with 80% aware of colleagues contemplating the same move. This shift has affected morale, especially among parents.\nMoreover, the return-to-office mandates have impacted housing markets, with cities like San Jose experiencing a surge in housing prices. This trend is attributed to the increased demand for housing near office locations.\nAdditionally, some companies have used RTO mandates as a strategy to encourage voluntary turnover, as revealed in a survey by Bamboo HR. This tactic has been part of the broader “Great Resignation” phenomenon, where employees have opted to leave rather than return to traditional office settings.\nWondering if your investments can get you to a $5,000,000 nest egg? Speak to a financial advisor today. SmartAsset’s free tool matches you up with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you.\nKeep Reading:\nInterest rates are falling but you can still make high yields in real estate. Find out how.\nOprah, Madonna and DiCaprio have turned to the alternative asset that is outperforming the S&P 500. Discover the potential of this market before other investors.\nThis article Google Assures Employees It's Not About To Pull Off An Amazon On Them When It Comes To Work From Home originally appeared on Benzinga.com\n"
    },
    {
        "Date": "2024-10-10T12:50:10.000Z",
        "Title": "Amazon.com price target lowered to $210 from $230 at Cantor Fitzgerald",
        "Author": "  TipRanks ",
        "Text": "Cantor Fitzgerald analyst Deepak Mathivanan lowered the firm’s price target on Amazon.com to $210 from $230 and keeps an Overweight rating on the shares. The firm expects Amazon’s Q3 revenues to be largely in-line with consensus estimates, though EBIT should be slightly above consensus, which has been the theme over the last two quarters, though Q4 guidance could be slightly below the Street on both the top-line and EBIT due to seasonal deceleration and margin headwinds, the analyst tells investors in a research note. The firm forecasts Q4 revenue and EBIT at $180B-$185B and $12B-$16.5B, respectively, and notes that the Kuiper rocket launch planned for December could also be a margin headwind incrementally. Cantor believes Amazon has several levers to expand its retail margins in the near- and medium- term.\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee the top stocks recommended by analysts >>\nRead More on AMZN:\nAmazon’s “Perfect 10” Smart Score Signals Strong Potential\nCathie Wood’s ARK ETFs Offload Robinhood Shares and Snap up Amazon, Coinbase Stocks\nCathie Wood’s ARK Investment buys 76.5K shares of Amazon.com today\nArk Invest: Palantir Can Take Market Share from Microsoft and Amazon\nDA Davidson software analysts hold an analyst/industry conference call\n"
    },
    {
        "Date": "2024-10-14T13:45:10.000Z",
        "Title": "Why Amazon (AMZN) is a Top Growth Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\nMany investors also have a go-to methodology that helps guide their buy and sell decisions. One way to find winning stocks based on your preferred way of investing is to use the Zacks Style Scores, which are indicators that rate stocks based on three widely-followed investing types: value, growth, and momentum.\nGrowth investors build their portfolios around companies that are financially strong and have a bright future, and the Growth Style Score helps take projected and historical earnings, sales, and cash flow into account to uncover stocks that will see long-term, sustainable growth.\nAmazon.com is one of the largest e-commerce providers, with sprawling operations in North America, now spreading across the globe.AMZN is a Zacks Rank #3 (Hold) stock, with a Growth Style Score of A and VGM Score of A. Earnings are expected to grow 63.5% year-over-year for the current fiscal year, with sales growth of 10.4%.One analyst revised their earnings estimate higher in the last 60 days for fiscal 2024, while the Zacks Consensus Estimate has increased $0.02 to $4.74 per share. AMZN also boasts an average earnings surprise of 31.1%.On a historic basis, Amazon has generated cash flow growth of 25.3%, and is expected to report cash flow expansion of 59.4% this year.With solid fundamentals, a good Zacks Rank, and top-tier Growth and VGM Style Scores, AMZN should be on investors' short lists.Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free reportAmazon.com, Inc. (AMZN) : Free Stock Analysis ReportTo read this article on Zacks.com click here.Zacks Investment Research\nAMZN is a Zacks Rank #3 (Hold) stock, with a Growth Style Score of A and VGM Score of A. Earnings are expected to grow 63.5% year-over-year for the current fiscal year, with sales growth of 10.4%.\nOne analyst revised their earnings estimate higher in the last 60 days for fiscal 2024, while the Zacks Consensus Estimate has increased $0.02 to $4.74 per share. AMZN also boasts an average earnings surprise of 31.1%.\nOn a historic basis, Amazon has generated cash flow growth of 25.3%, and is expected to report cash flow expansion of 59.4% this year.\nWith solid fundamentals, a good Zacks Rank, and top-tier Growth and VGM Style Scores, AMZN should be on investors' short lists.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]