[
    {
        "Date": "2024-01-19T12:24:17.000Z",
        "Title": "Roomba maker iRobot shares plunge on report Amazon deal faces EU block",
        "Author": "Reuters ",
        "Text": "(Reuters) — IRobot shares slumped 36% in premarket trading on Friday after a report the European Union antitrust regulator was planning to block Amazon.com's $1.4 billion buyout of the Roomba vacuum maker.\nAmazon was informed during its meeting on Thursday with the European Commission, the EU's executive arm, that the deal was likely to be rejected, the Wall Street Journal reported.\nAmazon declined to comment on the report.\nThe U.S. tech giant did not offer remedies until a Jan. 10 deadline to address the regulator's concerns the deal could reduce competition and reinforce Amazon's e-commerce platform dominance.\nAmazon disclosed plans to buy the robot vacuum company in August 2022 to add to its portfolio of smart devices, which include the Alexa voice assistant, smart thermostats, security devices and wall-mounted smart displays.\n\"If the objective is to have more competition in the home robotics sector, this makes no sense,\" said Matt Schruers, president of tech lobbying group Computer and Communications Industry Association.\n\"Blocking this deal may well leave consumers with fewer options, and regulators cannot sweep that fact under the rug,\" Schruers added.\nAny likely block will make it the second tech deal to hit regulatory hurdles in recent weeks. Adobe in December scrapped its $20 billion deal for design software maker Figma, citing \"no clear path\" for antitrust approvals in Europe and the UK.\nRegulators are worried that the acquisition of smaller rivals will result in a few companies accessing large pools of customer data and controlling the market.\nAmazon had in July slashed its offer by about 15% after iRobot incurred fresh debt.\nThat month, the EU also warned Amazon the deal, cleared by UK regulators, could reduce competition in the market.\nIRobot's shares have fallen 53% since the deal was announced.\nThe European Commission has until Feb. 14 to either approve or reject the deal.\n(Reporting by Harshita Mary Varghese and Chavi Mehta in Bengaluru; Foo Yun Chee in Brussels)\n"
    },
    {
        "Date": "2024-01-09T14:56:39.000Z",
        "Title": "Amazon and Generative AI - What's Going On?",
        "Author": "  Anusuya Lahiri ",
        "Text": "Amazon.Com Inc's (NASDAQ: AMZN) Chief Security Officer Stephen Schmidt sees generative artificial intelligence as a crucial tool in cybersecurity, striking a balance between enhancing security measures and supporting human staff.\nSchmidt, who transitioned to the top cybersecurity role at Amazon in 2022 after 12 years with Amazon Web Services, has been integrating generative AI tools into Amazon's cyber team, the Wall Street Journal cites an interview with Schmidt.\nThese tools, developed internally, include Code Whisperer, which identifies potential software vulnerabilities and suggests corrections.\nSchmidt emphasizes the importance of data protection, ensuring that corporate data in these AI tools remains secure and doesn't become part of a vendor's training model, WSJ writes.\n \nAlso Read: Amazon's AWS Pushes AI Boundaries With New Chips And Nvidia Partnership\nHe asserts that while generative AI is a powerful asset for security teams, it's not a replacement for human security engineers.\nThe technology is used at Amazon to prioritize findings, automate incident responses, and free up the security team for more strategic tasks.\nGenerative AI tools at Amazon can detect unusual behavior in customer accounts, helping to isolate and alert suspicious activities.\nThey also assist developers in scanning code for vulnerabilities and suggesting more secure coding practices.\nSchmidt told WSJ these tools amplify human abilities and address the cybersecurity talent shortage by increasing productivity and efficiency.\nHe added that generative AI tools can reduce operational expenses by making security operations more efficient.\nThese tools allow for less hiring, addressing both budget constraints and the challenge of finding skilled security engineers.\nHowever, Schmidt assures that generative AI is an accelerator, not a replacement, for security engineering, emphasizing its role as a tool to enhance, not eliminate, human expertise in cybersecurity.\nPrevious reports indicated Amazon placing its bets on AI-powered targeted ads to target the 2023 holiday season beyond its signature fast shipping and attractive discounts.\nThe company has also integrated advanced AI and robotics technologies in its warehouse operations to drive inventory identification efficiency and reduce delivery times.\nCEO Andy Jassy emphasized the transformative potential of generative AI in improving customer experiences across Amazon's enterprise and consumer businesses.\nJassy outlined plans to build a more expansive large language model for Alexa.\nAmazon stock closed higher by close to 3% Monday, and it gained 71% last year versus the broader sector ETF Invesco QQQ Trust, Series 1 (NASDAQ: QQQ), which gained 50%.\nPrice Action: AMZN shares traded lower by 0.48% at $148.44 premarket on the last check Tuesday.\nAlso Read: Amazon Ramps Up AI Game at AWS re:Invent to Tackle Microsoft and Google's Rise\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n \n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAMAZON.COM (AMZN): Free Stock Analysis Report\nThis article Amazon and Generative AI - What's Going On? originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-01-07T12:05:00.000Z",
        "Title": "Where Will Amazon Stock Be in 10 Years?",
        "Author": "  Demitri Kalogeropoulos, The Motley Fool ",
        "Text": "The best stock market returns accumulate over decades rather than quarters. That's why billionaire investor Warren Buffett cites his longevity as a key supporting factor in his portfolio's massive growth over the last several decades. \"It helps to start early and live into your 90's,\" he told Berkshire Hathaway shareholders in this year's annual report.\nGrowth-stock investors can seek to replicate some of his success by taking a much longer outlook on their investments. With that goal in mind, let's look at Amazon's (NASDAQ: AMZN) prospects for success in the coming decade. Where will the business, and the stock, be by early 2034?\nE-commerce will always be a big part of Amazon's business, but the future seems to be all about its services sales. That segment is anchored by the Amazon Web Services (AWS) platform and includes things like Prime subscriptions and advertising sales. Through the first three quarters of 2023, that unit clocked in at $226 billion, or 56% of sales, and was expanding at a much faster rate than the e-commerce segment.\nIt wouldn't be a stretch to think that in a decade, Amazon's business might look more like Microsoft's (NASDAQ: MSFT) does today. It will sell products, sure, but almost all its profits will come from cloud and software services.\nThis shift has a good shot at enhancing profitability and boosting cash flow, as investors have already seen in the last few quarters. Amazon likely won't have Microsoft's 40% profit margin by 2034 but should post much stronger results than its current 4% level. And positive stock returns will track along with those financial improvements.\nIf you don't think artificial intelligence (AI) is a priority for Amazon, consider that the term \"generative AI\" showed up 18 times in its most recent earnings release. That tech is now deeply embedded in the AWS platform, which is already helping many of its biggest customers with their own AI projects.\nAmazon is also using it to improve the shopping and selling experiences on its e-commerce store, for example by sifting through product reviews to highlight factors that previous buyers have frequently mentioned.\nThere's no telling how AI will develop over the next decade, but it appears likely that Amazon will join other tech giants like Microsoft in leading the shift into this computing era. It's also unclear right now what impact the technology will have on Amazon's finances.\nThe early signs are encouraging, though. Generative AI is popular because it is creating more value across a wide range of business processes. That makes it probable that the technology will lift Amazon's profit margins even as it helps accelerate sales growth in the next decade.\nAmazon is currently valued more like a retailer than a software-as-a-service stock. Its price-to-sales (P/S) ratio of 3 is closer to eBay's P/S of 2 than it is to Microsoft's ratio of 13 times annual sales.\nAmazon should close that gap with Microsoft over time if it continues shifting its business toward services sales while capitalizing on the AI boom. Many factors -- including a slowdown in spending on information technology, or a wider recession -- could delay or even derail these ambitions.\nBut Amazon stock seems primed to generate solid returns for patient investors over the next several years.\nWhere to invest $1,000 right now\nWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.*\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Amazon made the list -- but there are 9 other stocks you may be overlooking.\nSee the 10 stocks\n \n*Stock Advisor returns as of December 18, 2023\n \nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Demitri Kalogeropoulos has positions in Amazon and Berkshire Hathaway. The Motley Fool has positions in and recommends Amazon, Berkshire Hathaway, and Microsoft. The Motley Fool recommends eBay and recommends the following options: short January 2024 $45 calls on eBay. The Motley Fool has a disclosure policy.\nWhere Will Amazon Stock Be in 10 Years? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-22T06:06:17.000Z",
        "Title": "Here’s Why Amazon.com (AMZN) Shares Appreciated 88% in 2023",
        "Author": "  Soumya Eswaran ",
        "Text": "Polen Capital, an investment management company, released its “Polen Focus Growth Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the quarter the fund returned 14.43% (net) compared to 14.16% for the Russell 1000 Growth Index and 11.69% for the S&P 500 Index. For the full year, the fund returned 38.99% (net) compared to 42.68% and 26.29% returns for the indexes. The firm had the second-highest return in the Portfolio's 35-year history in 2023.  In addition, please check the fund’s top five holdings to know its best picks in 2023.\nPolen Focus Growth Strategy featured stocks such as Amazon.com, Inc. (NASDAQ:AMZN) in its Q4 2023 investor letter. Headquartered in Seattle, Washington, Amazon.com, Inc. (NASDAQ:AMZN) provides consumer products and subscriptions. On January 19, 2024, Amazon.com, Inc. (NASDAQ:AMZN) stock closed at $155.34 per share. One-month return of Amazon.com, Inc. (NASDAQ:AMZN) was 1.25%, and its shares gained 59.73% of their value over the last 52 weeks. Amazon.com, Inc. (NASDAQ:AMZN) has a market capitalization of $1.605 trillion.\nPolen Focus Growth Strategy stated the following regarding Amazon.com, Inc. (NASDAQ:AMZN) in its fourth quarter 2023 investor letter:\n\"For the full year, the top relative and absolute contributors were Amazon.com, Inc. (NASDAQ:AMZN), Salesforce, and ServiceNow. Amazon shares appreciated 88% in 2023, driven primarily by rapidly expanding operating profit margins and free cash flow growth. After the pandemic, Amazon experienced a period of inefficiency and overinvestment in its distribution and logistics infrastructure. Amazon is now leveraging these investments as growth returned to its e-commerce business in 2023 after a highly unusual 2022. At the same time, Amazon’s rapidly growing and high-margin advertising business is contributing strongly to the entire company’s operating profit growth. The AWS (Amazon Web Services) cloud infrastructure and services business continued to slow in 2023 as customers anticipating a more difficult economic environment looked to save money on their cloud spend, but these cloud spending optimizations began to stabilize in the second half of 2023. We now expect customer interest in generative AI will begin to contribute to growth.\"\nPhoto by Sunrise King on Unsplash\nAmazon.com, Inc. (NASDAQ:AMZN) is in second position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 286 hedge fund portfolios held Amazon.com, Inc. (NASDAQ:AMZN) at the end of third quarter which was 278 in the previous quarter.\nWe discussed Amazon.com, Inc. (NASDAQ:AMZN) in another article and shared the list of top-rated blue-chip stocks Wall Street analysts are in love within January 2024. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n20 Wines that aren’t Cheap but are Worth the Price\n30 Most Overweight and Obese Cities in the World\n20 Part-Time Jobs For Seniors That Pay Daily or Weekly\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-01-12T12:28:00.000Z",
        "Title": "DTC skin care brand Curology launches on Amazon",
        "Author": "  Howard Ruben ",
        "Text": "DTC skin care brand Curology has widened its reach by officially launching all non-RX products on its own Amazon storefront on Friday. The brand did a soft launch on the site beginning Dec. 28, per a company email.\nThe Amazon launch follows the brand’s first expansion into brick and mortar in December 2022 via a wholesale partnership with Target.\nCurology has launched 18 over-the-counter dermatologist-designed skin care products on Amazon, including its top-selling acne cleanser, gel moisturizer, cream moisturizer and emergency spot patch. The launch also includes three new products; Curology’s dark spot serum, liquid pore exfoliant and emergency spot patch clusters.\nCurology has been expanding its distribution in order to reach customers where they’re shopping.\n“Shifting to an omni-channel model enables Curology to reach incremental consumers who prefer to shop skincare at Target or Amazon. This growth in physical availability is a critical step in growing Curology’s household penetration,” CEO Heather Wallace said in an email, adding that the company expects this expansion to Amazon will help it increase sales of its non-RX products beyond its core audience, which is women between the ages of 18 to 34. \nWallace, who previously served as president of the Americas at Revlon, joined Curology in 2022.\nCurology achieved profitability in 2022 and generated revenue in excess of $200 million, per Wallace. The company in 2022 said it had a 75% compound growth rate over the past five years.\n“We expect our share of retail revenue to grow significantly in 2024 as our partnerships expand, and we remain committed to increasing accessibility to our great products wherever consumers prefer to shop. Our direct-to-consumer website will continue to be the largest driver of our business given our hero personalized RX solutions are exclusive to Curology.com,” Wallace said.\nSeveral DTC companies, seeking to broaden their consumer reach, have also launched on Amazon in recent years, including Care/of, Peloton, Allbirds and Our Place.\nThis story was originally published on Retail Dive. To receive daily news and insights, subscribe to our free daily Retail Dive newsletter.\n"
    }
]