[
    {
        "Date": "2024-03-26T17:55:47.000Z",
        "Title": "Kara Swisher talks predictions on technology, Facebook, Amazon",
        "Author": "  Jeffrey Quiggle ",
        "Text": "Kara Swisher, the author and journalist who covered technology and the early days of the Internet from San Francisco, has a new book.\nIn a recent exclusive interview with TheStreet, Swisher discussed a few predictions she has made over the years and the way she views how they turned out, both right and wrong.\nRelated: Cathie Wood buys $35 million of beaten-down tech stock\n\"Burn Book\" is Swisher's account of what publisher Simon and Schuster calls \"the inside story we've all been waiting for about modern Silicon Valley and the biggest boom in wealth creation in the history of the world.\"\nSara Silverstein, TheStreet's Editor-In-Chief, asked Swisher about her new book. \"In a lot of it you talk about a lot of the predictions you made in tech that have been right over and over again. Which of those are you most proud of, that was most shocking to the industry, that you were right about?\"\nAmanda Stronza/Getty Images\nSwisher began by looking about 25 years into the past, recalling what it was like trying to guess how the new technology would progress and affect other industries.\n\"A lot of them, I don't remember because we had a lot of scoops and things like that,\" Swisher said. \"But I think one thing is the very basic fact that everything that can be digitized would be digitized.\"\n\"I think it's kind of an obvious thing,\" she continued. \"But 25 years ago ... the idea that every industry would be changed by what was happening in tech.\"\nTo take a more recent instance, Swisher discussed a prediction she made about how social media might fuel former President Donald Trump's ability to communicate with his supporters — and what the repercussions of that fact might become.\n\"I think more recently when I wrote that column in the New York Times, sort of predicting the insurrection and how ... I talked about the lies Donald Trump would tell,\" Swisher said. \"It would shoot up and down the ecosystem, the digital ecosystem of the right.\"\n\"And then he'd ask them to do something to stop the election,\" she added. \"And when I did it, I got a lot of pushback from social media sites because I said, I called them handmaidens to sedition, essentially. And I think I felt good about being right about that, though I felt I wish I was wrong, I guess.\"\nShutterstock/TheStreet\nSilverstein asked Swisher about predictions she had been wrong about.\n\"You know, at first, when eBay  (EBAY) , when they visited me and I went to look at what they were doing, I thought it was a stupid idea,\" Swisher said. \"I just was like, I don't get this. I don't get it at all. And I think I was wrong about that.\"\n\"And now, look, eBay is not doing as well, but the idea was a great one, the idea of marketplaces,\" Swisher said. \"And for some reason in that case, I couldn't wrap my head around it.\"\nSwisher added another important marketplaces business she didn't support initially.\n\"I was not a supporter of Amazon  (AMZN) , but I thought they would do a lot better than most of the press thought at the time when they called them Amazon-dot-bomb,\" Swisher said. \"I thought Jeff Bezos was a great entrepreneur and directionally it was correct.\"\n\"Others, you know, Webvan, so many others failed,\" she added. \"But I did believe in commerce after that. But marketplace was something I missed.\"\nSwisher also discussed some early valuations that didn't make sense to her, including what happened after the 2007 Facebook  (META)  announcement that it would receive a $240 million investment from Microsoft  (MSFT) .\n\"When Facebook got a $15 billion valuation after the Microsoft investment, I was gobsmacked and I thought it was stupid and I said so,\" she recalled. \"And I was wrong because what they did is they grew into it. They sort of faked it till they made it kind of thing. And I just didn't think that the market would sustain these crazy valuations. But I should have known because they did it before.\"\nRelated: Veteran fund manager picks favorite stocks for 2024\n"
    },
    {
        "Date": "2024-03-20T20:13:37.000Z",
        "Title": "Amazon sharply upped ‘performance improvement plans’ for workers. Then came tens of thousands of layoffs",
        "Author": "  Paolo Confino ",
        "Text": "In the months before Amazon laid off tens of thousands of workers, it also put a large number of employees on performance improvement plans, known as PIPs, according to a new report.\nThe details were uncovered in a set of documents from Amazon’s HR department obtained by Business Insider. According to documents from early 2023, Amazon placed thousands of employees a month into the initial phase of its PIP process in the months leading up to multiple rounds of layoffs it conducted from November 2022 to March 2023, when the company cut a total of 27,000 employees.\nPerformance improvement plans, common at large companies, are a way to formally tell workers they need to improve, and being put on a PIP is commonly understood as a step toward termination. (When done correctly, though, PIPs can be an effective way to provide proper guidance to a struggling employee and help them keep their job.)\nIn April 2022, about six months before the layoffs started, Amazon placed less than 2,000 employees into the first phase of its PIP, which it internally calls Focus. At the end of the year, once the layoffs had commenced, upwards of 3,300 staffers a month were on such a plan. The following January the number continued to climb even higher, according to Business Insider.\nOver the same time period, the number of employees who entered into the second stage of Amazon’s PIP programs, called Pivot, doubled.\nStricter performance review policies have cropped up at other large tech firms that are looking to trim their workforce—either through layoffs or through other means. Firms often see performance reviews as a way to juice employee turnover at a time when employees are happy to stay put. Meta, which laid off 21,000 employees from November 2022 to May 2023, implemented stricter performance standards regarding employee bonuses. Once known for lavish stock bonuses for strong performers, Meta lowered the payout from 85% to 65% of their available bonuses for those with good, but not great, performance ratings. Meanwhile Google, which laid off about 13,000 employees over the course of last year, instructed managers to factor office attendance into performance reviews. The announcement came after Google executives pushed employees to return to the office, which was met with predictable reluctance from the rank and file.\nSome consider these changes in management policy to be an effort to push certain employees out the door without going through costly and morale-lowering layoffs—a practice known as “quiet firing.” If companies can create conditions that make some employees leave the company, they are likely to save money on severance costs. The risks of such a strategy are that talented employees may be pushed out of the company rather than offered the necessary coaching to thrive.\nAmazon is known for having a high-performing culture with demanding standards. It has a reputation for letting go of a certain percentage of its worst performing employees every year. Within Amazon the practice is called “unregretted attrition.” The concept was also mentioned in the memo detailing the number of employees on PIPs, according to Business Insider, which previously reported that Amazon aims for an annual “unregretted attrition” rate of 6%. If the company was falling behind that goal, managers were encouraged to put “underperforming employees to Focus, [resolve] Focus entries in a timely manner, and [move] employees to Pivot if they are unable to meet the performance bar,\" according to the documents.\nIn a statement to Fortune, Amazon denied the previous layoffs were connected to its PIP process. “To conflate the two is simply wrong, because role eliminations reflect the business need for a specific type of position,” a spokesperson said in an email. “That's unrelated to our performance management process which is in place to help individual employees who need support to meet expectations.”\nAmazon added that the way it reports the metrics used to calculate the numbers of employees on PIPs changed “more than a year ago,” meaning that the figures were “not reflective of accurate internal data.”\nA PIP, like those issued by Amazon, in and of itself isn’t a sign of “quiet firing” or of an effort to force workers out. The Amazon documents don’t reveal how many employees successfully completed the PIP, nor how many of those on PIPs were among the people laid off in the job cuts from 2022 to early 2023. Amazon did not respond to a question about how many employees successfully completed a PIP and therefore remained at the company.\nNonetheless, PIPs can be an uncomfortable part of work, a fact Amazon seemed to acknowledge as it asked managers to identify weaker performers.\n\"In order to maintain a high and rising performance bar, we plan to refresh part of the employee population each year,\" Amazon’s HR department said, according to the documents obtained by Business Insider. \"Managers, however, do not engage in performance management work eagerly. Therefore we cannot rely on good intentions and need to create accountability.\"\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-03-01T20:25:22.000Z",
        "Title": "Amazon collects $140 billion in annual fees from sellers. Now many are fuming over ‘crazy’ new fees they say tighten Amazon’s grip on their businesses",
        "Author": "  Jason Del Rey ",
        "Text": "Things are about to get more complicated for many Amazon sellers—and Amazon customers may pay the price, literally.\nOver the next month, Amazon is implementing the latest in a series of new fees for businesses that sell goods on Amazon, in changes that the company says are designed to speed up shipping speeds for Amazon customers while reducing the costs of such initiatives. But a half-dozen top Amazon sellers told Fortune this week that the new fees are complex and expensive, and may force them to overhaul their businesses and seriously consider ceding more control of their supply chain to the tech giant at a time when it is facing a government lawsuit that alleges the company is already abusing its power over these merchants.\nAll of these sellers told Fortune that at least one of the new fees—called “the inbound placement service fee”—appears designed to pressure merchants to utilize a new Amazon service called AWD, or Amazon Warehousing and Distribution. Some of these merchants also said that this fee, coupled with another that Amazon will soon charge for low inventory levels, will force them to pass on price increases to Amazon customers.\n“It’s becoming increasingly difficult to sell on Amazon,” said Albert Grazi, a highly-rated Amazon seller of seven years who sells around $5 million of water filtration products on Amazon each year through brands like the Mist filter line. “You are getting squeezed from all sides.”\nAn Amazon spokesperson, Mira Dix, said in a statement: “By splitting what was a combined outbound fee into an inbound and outbound fee and adding a low-inventory-level fee, we will more closely align fees for sellers with our underlying costs while also providing sellers with more choices for how they use our services, giving them more transparency and control over their fulfillment costs. This allows us to create incentives for sellers to use our network more efficiently so we can share the cost savings.”\nThe spokesperson said that “many” sellers will end up paying Amazon less per unit sold than they did previously, but none of the six top sellers who spoke to Fortune considered that a possibility for their business.\nWhile Amazon is increasingly thought of as a tech giant as much as a retailer—with significant AI investments, a massive cloud computing business in AWS, and a voice assistant that’s become a household name—about one-quarter of its total revenue, or $140 billion in 2023 alone—comes from the fees it charges these sellers to host their products and do the unsexy work of storing and shipping their goods. In exchange, small companies can build big businesses by easily accessing one of the largest customer bases in the world. But now Amazon wants even more.\nIn recent years, Amazon has extracted a greater cut of sales from the small and midsize merchants who sell through its site, even as Amazon’s reliance on these sellers continues to grow. During the final three months of 2023, the proportion of total goods sold through Amazon that come from these sellers—rather than Amazon’s own inventory—crossed the 60% mark for the first time in company history. At the same time, from 2017 to 2022, the cut of revenue that Amazon takes from these sellers increased from around 40% to around 50%, according to the e-commerce research firm Marketplace Pulse.\nSellers pay Amazon listing fees, advertising fees, and in many cases warehousing, shipping, and customer service fees through a service called Fulfillment by Amazon, or FBA, that assures their items will qualify for Prime shipping. Amazon’s third-party seller business—known as its Marketplace—is also highly profitable, the Federal Trade Commission has alleged, but just how profitable remains a secret that the company does not disclose.\nThe new inbound placement and low-inventory fees apply to sellers who already use FBA, but Amazon wants to play a role even earlier in their supply chain. In the past, an Amazon seller might import goods from overseas suppliers and then send all that inventory to a warehouse owned by a 3PL or third-party logistics company. From there, the 3PL will then ship out smaller segments of the seller’s inventory to Amazon fulfillment centers and potentially those of other retailers. But with Amazon Warehouse and Distribution, or AWD, Amazon is essentially trying to replace those 3PLs. (Amazon also runs another relatively new service called Amazon Global Logistics, or AGL, that charges sellers to transport a seller’s goods from overseas suppliers into a US Amazon fulfillment center.)\nOver the past two years, Amazon has also reorganized—or regionalized—its U.S. warehouse network to try to share inventory across eight regions to speed up delivery times and reduce transportation costs, in an effort to get more goods to customer doors faster and cheaper. With these new changes, if an Amazon seller is not willing to send goods from its own 3PL warehouse to at least four different Amazon fulfillment centers, Amazon will now charge an extra fee for every single item. The new placement fees will range anywhere from 21 cents to 68 cents per unit for standard-size goods, and 55 cents to $6 for bulky products. Pricing is based not only on the size and weight of an item, but also depending on how many fulfillment centers a seller will or won’t ship their items to. Of course, Amazon will waive these new fees if sellers decide to pay for AWD instead.\nGrazi, the Amazon seller, said it makes sense for Amazon to begin charging sellers to spread their inventory across the U.S. But, to him, the costs don’t net out.\n“It’s a very high fee,” he said. “It doesn't make sense how much money they are charging.”\nJudah Bergman, the CEO of Jool Baby, a baby-product company that does tens of millions in sales on Amazon annually, says the introduction of these new fees and others announced in December feel like “10 years’ worth of increases and changes in one.”\n“I’m very experienced on Amazon and I’ve spent so much time on this,” he said, “[but] for many items, I still don’t have clarity on how exactly I’m going to sell profitably yet. It’s crazy.”\nBeyond the new inbound placement fees that go into effect March 1, on April 1 Amazon will also begin charging many sellers a fee if they don’t have four weeks of inventory in Amazon fulfillment centers. One problem, sellers told Fortune, is that Amazon also charges sellers for storing too much inventory in Amazon facilities.\n“You gotta precisely thread the needle to not get completely killed,” Bergman, the Jool Baby CEO, said of the low-inventory charges.\nAmazon’s solution? Again, sellers can avoid the low-inventory fees by giving Amazon even more control of their supply chain by utilizing AWD to replace a seller’s existing 3PL warehouse relationship.\n“It’s very clear they are carrot-and-stick-ing us into using AWD,” said a longtime, eight-figure apparel seller who requested anonymity out of a fear of reprisal for speaking candidly about Amazon’s actions.\nDifferent sellers had different reasons for not wanting to use AWD. Some simply didn’t want to give more control to Amazon, while another said they believe their current 3PL relationship will be cheaper. Two others said they’ve heard from peers who felt the service was not yet ready for prime time.\nSeveral of the sellers who spoke to Fortune said that the company’s marketplace has become a safer place to do business over the past year or two, with the company doing a better job of policing nefarious merchants who sabotage competitor listings. But the recent fee changes have them feeling resigned to the fact that a significant power imbalance remains.\n“I’m gonna comply and send [my inventory] into AWD,” Grazi said. “And that’s it.”\nDo you have thoughts on this topic or a tip to share? Contact Jason Del Rey at jason.delrey@fortune.com, jasondelrey@protonmail.com, or through secure messaging app Signal at 917-655-4267. You can also message him on LinkedIn or at @delrey onX.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-03-21T16:00:45.000Z",
        "Title": "FCC confirms ‘several ongoing investigations’ into Amazon, other online retailers over wireless signal jammers sales",
        "Author": "  Chris Morris ",
        "Text": "Amazon and several other retailers are the target of an ongoing investigation by the Federal Communications Commission for selling wireless signal jammers and other unlawful electronic devices.\nIn an unusual statement acknowledging the investigation, spokesperson Will Wiquist told Fortune the FCC had \"several ongoing investigations into retailers, including Amazon, for potential violations of Commission rules related to the marketing and sale of equipment without proper FCC authorization.\"\nThe FCC did not disclose which other retailers it is investigating.\nAt issue are the sale of signal jammers, which can block or disrupt everything from cell phones to GPS systems to WiFi signals. Those products are illegal to use, sell or even advertise in the U.S. Authorities note they can prevent people from making 9-1-1 calls and security experts note thieves can use them to nullify wireless security cameras, which are popular for home security.\nEven local police forces are prohibited from using the technology. (Federal law enforcement officials can, under certain circumstances, the FCC says.)\nThe move comes following an NBC report which found nine independent Amazon sellers offering jamming devices. Amazon has since removed those listings and told NBC it has policies in place prohibiting the sale of jamming devices.\nAmazon did not respond to Fortune’s request for comment about the investigation.\nEven if the FCC is able to stop the retail sale of signal jammers, there is a flourishing online culture that revolves around the technology. Select websites show how to build a jammer that can easily be hidden, though you’ll need some technical knowledge to successful assemble the device.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-03-12T20:53:00.000Z",
        "Title": "Amazon (AMZN) and Angi (ANGI) Are Aggressive Growth Stocks",
        "Author": "  Brian Bolan ",
        "Text": "Brian Bolan is the aggressive growth stock strategist at Zacks Investment Research and he has two more stocks for your aggressive growth radar screen. This week he is taking a look at a couple of “A” stocks. Not only do these stocks start with the letter “A” but they both have a Zacks Style Scores for growth that are “A” as well.\nBrian explains in the video that just about all of his aggressive growth Zacks Rank Buy videos the stocks will have a growth style score of ”A”. He also looks for stocks that have a weaker value style score. The thinking here is that value investors and growth investors are inherently looking for different things.\nAmazon AMZN is first up on the list and Brian takes a look at the most recent beat the company posted as well as the earnings estimate revisions over the last 60 days. He then speaks to the rate of growth that the company is seeing noting that growth remains consistent for 2024 and 2025. Given the fact that the revenue numbers come from such a high base the consistency of growth is impressive.\nFinally Brian takes a look at the valuation metrics that most investors peak at and then looks at the chart to see if there can be any information gleaned from the trading history.\nNext up is Angi ANGI Which is a Zacks rank #1 (Strong Buy) just like Amazon AMZN. Brian notes that if interest rates start to move lower people that are trapped in their homes and want to purchase larger homes are likely to start to fix up their homes and complete small projects. Hiring contractors can be very difficult and this company is focused on reviews to help customers find the right company.\nAs he did with Amazon AMZN Brian takes a look at the earnings history, earnings estimate revisions, sales growth and other valuation metrics before taking a look at the chart.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nAngi Inc. (ANGI) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]