[
    {
        "Date": "2024-04-17T16:04:16.000Z",
        "Title": "Amazon removed Just Walk Out from many of its own stores but wants to sell the system to others",
        "Author": "  HALELUYA HADERO ",
        "Text": "NEW YORK (AP) — Amazon wants the public and - especially other businesses - to know it’s not giving up on its Just Walk Out technology.\nAlthough the company is ditching the cashier-less checkout system at its Amazon Fresh grocery stores, it plans to sell the technology to more than 120 third-party businesses by the end of the year. Reaching that goal would double the number of non-Amazon enterprises that use Just Walk Out compared to last year.\n“For us, really making sure that we can service that third-party market is the most important thing,” Jon Jenkins, the vice president of Just Walk Out at Amazon, said in an interview. “We’ve definitely been reassuring people that we are in this for the long haul.\"\nJust Walk Out uses cameras, artificial intelligence and sensor trackers to determine what’s taken off of shelves, enabling customers to grab what they want and leave if they insert a credit card or another payment method at a store’s entry gate.\nThe retailer first began offering the technology to other businesses – such as sports stadiums - in 2020, two years after it started using it at Amazon Go convenience stores. Those stores and some Amazon Fresh stores in the U.K. will continue to offer Just Walk Out. But the technology will be replaced with smart carts at Fresh stores in the U.S., Amazon announced this month.\nSmart carts, which are already available in some Amazon Fresh locations, use sensors to identify items placed inside and have screens that allow customers to see nearby deals as well as how much their groceries will cost. Customers can skip the checkout line by scanning and tallying up items on its cameras.\nThe change comes as Amazon is working to revamp its Fresh stores with a mix of technology and traditional grocery offerings that will help it attract more customers. The company's grocery store brands include Amazon Fresh and Amazon Go, as well as supermarket chain Whole Foods, which it purchased in 2017 for $13.7 billion.\nBut Amazon's efforts to become a giant in the U.S. grocery market hasn’t been easy. Early last year, CEO Andy Jassy wrote in his annual letter to shareholders that the company was working to find the formula that would allow it to make a larger impact in brick-and-mortar grocery stores.\nJenkins argued that removing Just Walk Out from U.S. Amazon Fresh stores did not reflect a miscalculation by the company. Instead, he described the decision as an outgrowth of an experimentation process to figure out what does and doesn’t work for shoppers.\n“What we found is customers in big grocery stores want a shopping assistant to travel along with them,” he said. Meanwhile, “shoppers in smaller store formats tend to be very mission driven. They want to get in and out quickly, with as little friction as possible.”\nAbandoning the technology in many of its own stores could make it challenging for Amazon to sell Just Walk Out to other businesses. But some experts think the move also could expand adoption among smaller-format stores and locations akin to Amazon Go stores.\nJohn Clear, a senior director at the professional services firm Alvarez & Marsal, says he believes cashier-less technology is going to become more common in grab-and-go shopping areas where human interaction tends to be limited, labor is hard to come by and businesses are almost always attempting to cut down on costs.\n“We’re seeing a natural evolution of the technology, kind of expanding where it’s working\" and drawing back where it's not, Clear said.\nIn its attempt to sell its technology to other businesses, Amazon is also trying to counter some recent viral social media posts that claimed the checkout system was not a technological marvel but was instead powered by contractors in India who manually added up items in carts as customers shopped.\nBusiness publication The Information and news website Vox reported in the past that Amazon used human reviewers for the technology, which the company has acknowledged. Jenkins said the company hires associates who take some video clips and label them so they can be used to train the machine learning system.\nBut the notion “people in India are watching you shop live in a store and figuring out what you bought is completely inaccurate,” he said.\nIn some cases, when the system was not able to figure out what happened in a store, a human watches a snippet of video to make sure the receipt a customer received was accurate, Jenkins added. Such reviews happen in a “small minority” of cases, he said, declining to give an estimate.\nJenkins also declined to share how many people the company has hired to review and label videos. However, he said it was less than the 1,000 figure cited in media reports.\n"
    },
    {
        "Date": "2024-04-15T12:00:17.000Z",
        "Title": "The Art of Valuation: Discovering Amazon.com Inc's Intrinsic Value",
        "Author": "  GuruFocus Research ",
        "Text": "In this article, we will take a look into Amazon.com Inc's (NASDAQ:AMZN) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 8 Warning Signs with AMZN.\nAs of 2024-04-15, Amazon.com Inc's intrinsic value as calculated by the Discounted Earnings model is $62.04. It's currently trading at a price of $186.16. Therefore, the margin of safety based on the DCF model is -200.06%. The company is significantly overvalued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Amazon.com Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$2.81\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.57%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 0.00% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n16.57\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n7.05\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n62.04\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $38.50. This valuation indicates that the Amazon.com Inc is significantly overvalued, accompanied by a margin of safety of -383.53%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-01T07:38:48.000Z",
        "Title": "Amazon.com Inc (AMZN) Q1 2024 Earnings Call Transcript Highlights: Soaring Profits and ...",
        "Author": "  GuruFocus Research ",
        "Text": "Revenue: $143.3 billion, up 13% year-over-year excluding foreign exchange impacts.\nOperating Income: $15.3 billion, a 221% increase from the previous year.\nFree Cash Flow: $48.8 billion in trailing 12-month, adjusted for equipment finance leases.\nAdvertising Sales: Grew 24% year-over-year excluding foreign exchange impacts.\nAWS Revenue: Accelerated to 17.2% growth in Q1, reaching a $100 billion annualized revenue run rate.\nThird-Party Seller Services Revenue: Increased 16% year-over-year excluding foreign exchange impacts.\nNorth America Revenue: $86.3 billion, up 12% year-over-year.\nInternational Revenue: $31.9 billion, an 11% increase year-over-year excluding foreign exchange impacts.\nNorth America Operating Income: $5 billion, up $4.1 billion year-over-year.\nInternational Operating Income: $903 million, a $2.2 billion improvement year-over-year.\nCapital Expenditures: Expected to increase significantly in 2024, primarily to support AWS growth including generative AI.\nWarning! GuruFocus has detected 8 Warning Signs with AMZN.\nRelease Date: April 30, 2024\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\nQ: Doug Anmuth from JPMorgan asked about Amazon's investment strategy, particularly in relation to gen AI, grocery, Kuiper, and healthcare, and its impact on profitability. A: Brian Olsavsky, CFO, explained that Amazon is balancing investment and profitability, with significant improvements in operating income and free cash flow driven by the stores business and AWS. He highlighted that capital expenditures, especially for AWS and gen AI, are expected to increase, impacting depreciation but ultimately leading to long-term growth.\nQ: Ross Sandler from Barclays inquired about the CapEx intensity in AWS and the costs associated with training new generative AI models. A: CEO Andrew Jassy noted that AWS is seeing strong demand, particularly in generative AI, with significant investments in training models. He emphasized the ongoing shift from cost optimization to innovation and infrastructure modernization, with AWS being a preferred platform due to its security and operational performance.\nQ: Brian Nowak from Morgan Stanley asked about Amazon's goals for cost to serve and its implications for North America retail margins and cash flow. A: CFO Brian Olsavsky addressed that while specific targets for cost to serve were not disclosed, Amazon continues to focus on reducing costs and improving efficiency. He reiterated Amazon's priority to reinvest in growth opportunities and manage cash flow, including repaying debt incurred during periods of negative free cash flow.\nQ: Youssef Squali from Truist Securities questioned the progress and potential of Amazon's logistics as a service globally. A: CEO Andrew Jassy described the growth in third-party logistics as mirroring AWS's early days, where internal capabilities developed for Amazon's use were extended to third-party sellers. He highlighted the efficiency and cost-effectiveness of these logistics services for sellers, indicating significant growth potential without substantial additional CapEx.\nQ: Justin Post from Bank of America asked about the growth drivers in grocery and Prime Video ads. A: CEO Andrew Jassy expressed optimism about the grocery sector, citing significant growth in nonperishables and organic groceries through Whole Foods. He also noted the early success of Prime Video ads, emphasizing their potential to enhance Amazon's advertising offerings.\nQ: Ronald Josey from Citi asked about the trajectory towards consistent profitability in Amazon's international segment and the impact of inbound fulfillment architecture on shipping efficiency. A: CFO Brian Olsavsky confirmed positive trends in both established and emerging markets, with efforts to improve cost structures and customer experience driving profitability. CEO Andrew Jassy added that lessons from regionalization in the U.S. are being applied internationally to enhance efficiency and reduce costs.\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-04-25T14:57:13.000Z",
        "Title": "Amazon announces $11bn data centre investment in US state of Indiana",
        "Author": "  Alice Nunwick ",
        "Text": "Amazon’s cloud subsidiary Amazon Web Services (AWS) has announced an $11bn data centre investment in the US state of Indiana.\nThe investment will provide 1,000 new jobs to the area and will see data centre facilities built in the Indiana Enterprise Centre, providing infrastructure for generative AI and cloud computing in the region.\nAWS has received support from the state's investment agency the Indiana Economic Development Corporation (IEDC) which offers tax credits, training and assistance to investors in the region.\nThe IEDC have provided AWS with data centre sales tax exemptions for any future investments that the company makes in Indiana in the next 50 years.\nIt has also provided AWS with a training grant of $5m.\nAdditionally, AWS will also provide an investment of $7m to support the construction and upkeep of local roads near any new data centre facilities.\nAWS’ investment received support from Indiana’s state Governor Eric Holcomb.\n“Amazon has long been an important economic partner in Indiana, and we are excited to welcome AWS,” said Holcomb.\n“This significant investment solidifies Indiana’s leadership position in the economy of the future and will undoubtedly have a positive ripple effect on the town of New Carlisle, the north central region and the state of Indiana for years to come,” he stated.\n\"Amazon announces $11bn data centre investment in US state of Indiana\" was originally created and published by Verdict, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    },
    {
        "Date": "2024-04-12T17:27:25.000Z",
        "Title": "Amazon CEO: ‘We’re Not Done’ Lowering Fulfillment Costs",
        "Author": "  Glenn Taylor ",
        "Text": "Amazon has engineered significant cost cuts across its delivery network over the past year, but CEO Andy Jassy still believes there’s more to come.\n“As we look toward 2024 (and beyond), we’re not done lowering our cost to serve,” said Jassy in his annual letter to shareholders. “We’ve challenged every closely held belief in our fulfillment network, and reevaluated every part of it, and found several areas where we believe we can lower costs even further while also delivering faster for customers. Our inbound fulfillment architecture and resulting inventory placement are areas of focus in 2024, and we have optimism there’s more upside for us.”\nMore from Sourcing Journal\nAmazon, Walmart Called Out for 'Excessive' Warehouse Surveillance\nAmazon Launches Low-Price Marketplace in India\nRetail Tech: Blue Yonder's $839M Acquisition, CommentSold Launches PopClips\nAmazon’s cost cutting began in early 2023 when the company restructured its U.S. fulfillment network into eight self-sufficient regional networks, so that product could travel shorter distances to the end consumer.\nThis has helped the e-commerce giant ultimately lower its “cost to serve”—which is the cost to get a product from Amazon to a customer—by more than 45 cents per unit in the U.S. compared to a year ago.\n“Decreasing cost to serve allows us both to invest in speed improvements and afford adding more selection at lower average selling prices,” Jassy said. “More selection at lower prices puts us in consideration for more purchases.”\nJassy attributes Amazon’s wider success to its focus on creating what he called “primitive services,” which are foundational building blocks like Amazon Web Services (AWS) that facilitate innovation for the company.\nOne such primitive Jassy identified was the company’s 58 same-day fulfillment facilities, which have helped the tech titan increase the number of items delivered either same-day or overnight by more than 65 percent year over year in Q4.\n“They’re located in the largest metro areas around the U.S., house our top-moving 100,000 SKUs (but also cover millions of other SKUs that can be injected from nearby fulfillment centers into these same-day facilities) and streamline the time required to go from picking a customer’s order to being ready to ship to as little as 11 minutes,” said Jassy. “These facilities also constitute our lowest cost to serve in the network. The experience has been so positive for customers that we’re planning to double the number of these facilities.”\nBut Jassy believes the same-day facilities have a lot more potential to improve areas like Amazon’s seemingly experimental grocery business, particularly for delivering organic products from Whole Foods Market or non-perishable goods such as canned goods and health and beauty products.\n“We’ve been working hard on building a mass, physical store offering (Amazon Fresh) that offers a great perishable experience; however, what if we used our same-day facilities to enable customers to easily add milk, eggs or other perishable items to any Amazon order and get same day?” Jassy questioned. “It might change how people think of splitting up their weekly grocery shopping, and make perishable shopping as convenient as non-perishable shopping already is.”\nJassy also acknowledged the recent hiccups seen in expanding its drone capabilities, with the company’s Prime Air drone division seeing setbacks due to government regulations, layoffs and top team members leaving the unit.\nBut he doesn’t appear to be backing off the commitment for the long run. Upon saying the drones were “making substantial progress,” Jassy said the service would be “a very valuable future primitive capability” for Amazon.\n“Drones will eventually allow us to deliver packages to customers in less than an hour. It won’t start off being available for all sizes of packages and in all locations, but we believe it’ll be pervasive over time,” Jassy said. “Think about how the experience of ordering perishable items changes with sub-one-hour delivery?”\nThe CEO also talked up Amazon’s robotics team, which has introduced new tests in recent months that have further cut metrics like inventory identification time or order processing time across multiple warehouses.\nSuch investments cost a pretty penny for Amazon. On the same day Jassy published his shareholder letter, the company announced it will have spent 700 million euros ($744 million) on robotics deployments in Europe alone over the past five years by the end of 2024.\nIn that time, Amazon deployed more than 1,000 robotics systems across its European fulfillment center network. The company expects to introduce 120 new pieces of automation technologies in 2024.\n“Some of the biggest opportunities require invention in domains such as storage automation, manipulation, sortation, mobility of large cages across long distances and automatic identification of items,” said Jassy in his letter. “Our robotics team has built primitives in each of the above domains that will be lynchpins in our next set of automation, which includes multi-floor storage, trailer loading and unloading, large pallet mobility and more flexible sortation across our outbound processes (including in vehicles).”\nJassy also lauded the robotics team is also building a set of foundation AI models to better identify products in complex environments, optimize the movement of its robotic fleet and better manage the bottlenecks in its facilities.\n"
    }
]