[
    {
        "Date": "2024-05-02T01:46:15.000Z",
        "Title": "Amazon CEO’s Comments Violated Labor Law, NLRB Judge Rules",
        "Author": "  Josh Eidelson ",
        "Text": "(Bloomberg) -- Amazon.com Inc. Chief Executive Officer Andy Jassy made comments to the media in 2022 that violated federal labor law, a US National Labor Relations Board judge ruled Wednesday.\nMost Read from Bloomberg\nIsrael Says a Cease-Fire Plan Backed by Hamas Falls Short\nHigh-Tech Trading Firms Race to Grab Bond Market Turf\nRussians Are Coming to Terms With Putin’s War in Ukraine\nJack Dorsey Leaves Bluesky Board, Calls X ‘Freedom Technology’\nRemarks that Jassy made to reporters about the downsides of unionization told “employees that, if they selected a union, they would become less empowered and would find it harder to get things done quickly,” NLRB administrative law judge Brian Gee wrote.\nGee cited various comments Jassy made, including telling CNBC that making workplace improvements is “much slower” with a union and saying at a New York Times conference that employees without a union are “better off” because “it’s not bureaucratic.”\nGee also cited Jassy for telling the Bloomberg Technology Summit that in a union shop, “if you see something on the line that you think could be better for your team or you or your customers, you can’t just go to your manager and say, ‘Let’s change it.’”\nWhile precedent establishes that a manager can make factually based predictions about “demonstrably probable consequences beyond his control,” Gee wrote that Jassy “offered no objective basis” for his assertions.\nThe judge said Amazon should be forced to post a notice at its US facilities informing employees of their rights and committing not to threaten them.\nAmazon said it strongly disagrees with the ruling and plans to appeal. “The decision reflects poorly on the state of free speech rights today, and we remain optimistic that we will be able to continue to engage in a reasonable discussion on these issues where all perspectives have an opportunity to be heard,” spokesperson Mary Kate Paradis said in an email.\nThe Amazon Labor Union, which brought the case to the NLRB, celebrated the ruling. “It sends a clear message that attempts to dissuade workers from exercising their right to organize and bargain collectively will not be tolerated,” the union’s attorney, Seth Goldstein, said in a text message.\nUS law allows companies to oppose and argue against unionization, but not to threaten to punish workers if they organize.\nRulings by NLRB judges can be appealed to labor board members in Washington, and from there into federal court. The agency lacks the authority to hold executives personally liable for violations or make companies pay punitive damages.\n(Updates with Amazon’s response starting in seventh paragraph.)\nMost Read from Bloomberg Businessweek\nA New Kind of Power Company Will Put a Battery in Every Home\nChris Dixon’s Campaign to Overhaul Crypto’s Grifty Reputation\nBoom Times Are Over for Food Startups, But That’s a Good Thing\nThe State of Crypto Is Anything But Strong\nWhy Banks These Days Are So Excited About Being Boring\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-05-05T11:00:00.000Z",
        "Title": "E-commerce is witnessing the Amazon-ification of Shein, as the fast-fashion behemoth woos skincare and toy brands",
        "Author": "  Sasha Rogelberg ",
        "Text": "E-commerce giant Shein is spreading its arms to envelope more than just the fashion and apparel for which it’s known—and it’s starting to look like another familiar online market platform in the process.\nShein is wooing brands such as household goods conglomerate Colgate-Palmolive, toy maker Hasbro, and skincare brands to sell their products in its marketplace, Reuters reported Tuesday. The company, known for affordable and stylish clothes—albeit made with concerns about labor practices and its environmental impact—is taking steps to create a platform that is everything to everyone.\n\"Everybody associates Shein with fashion, but we are doing all verticals,\" Christina Fontana, Shein’s senior director of brand operations for Europe, Middle East and Africa, said at a Paris conference on April 17, according to Reuters.\n\"Our consumers want brands, [so] if that's what they're looking for, that's what we're going to give them,” she added.\nShein’s outward expansion is a clear tactic to take a bigger piece of the e-commerce pie, Steve Tadelis, economic analysis and policy professor at the University of California at Berkeley, told Fortune.\nShein has the largest fast-fashion market share in the U.S, and its annual profit doubled to $2 billion in 2023 from the year before. It's eyeing an IPO and a whopping $90 billion valuation. While the size of its retail empire still pales in comparison to Amazon’s stranglehold on 38% of the U.S. e-commerce market, Tadelis said Shein will want to go after the industry leader.\n“It shouldn't be surprising that with all of the regulators around the world and talking about the Amazon monopoly that needs to be reined in, well, Shein is now taking a bite out of their apple and will probably take more of those bites,” he said.\nShein, a China-based fast-fashion platform founded by billionaire Sky Xu in 2008, has skyrocketed to success and 45 million monthly users through its massive and efficient production and distribution strategies.\nUsing AI and electronic monitoring, Shein is able to identify online trends, turn to its suppliers to manufacture small batches of products, then take initial sales data to decide to mass produce a product. The system nearly guarantees the company has its finger on the pulse of trends and can deliver goods fast, though it’s gotten into hot water over allegations of copyright infringement and data scraping, as well as the proliferation of counterfeit product listings.\nEven as regulatory bodies, like the European Union’s European Commission, have tried to put checks and balances on the company to stymie its questionable business practices, Shein may have found a way around that.\nJohn Deighton, professor emeritus at the Harvard Business School, told Fortune that Shein’s strategy of incorporating more brand names onto its platform will only help the company dodge increased attention: The site could soon be flooded with thousands of listings from familiar and trusted products, such as Colgate toothpaste and Play-Doh, essentially telling regulatory bodies there’s nothing to see here.\n“They won't get caught up by the scrutiny,” Deighton said.\nShein’s behind-the-scenes methodology makes expanding beyond fashion a natural next step, Tadelis argued. With an efficient infrastructure in place, Shein is able to be more nimble in expanding outward from apparel.\n“I really think this is a smart business decision of saying, ‘We have an amazing logistics network, let's start expanding it into other areas where we could procure cheap products,’” he added.\nRui Ma, tech analyst and COO of market research platform AlphaWatch.AI, told Fortune that Shein’s secure spot in apparel offers another advantage in its race to beat Amazon. Fashion is a notoriously finicky sector, and Amazon, despite dipping its toe into the world of apparel, hasn’t been able to see the same success as Shein, Ma said.\n“It's been very—historically—very difficult to match up demand supply,” she said. “It's not been a particularly easy category.”\nBut as Shein takes pages out of Amazon’s playbook, Amazon is simultaneously doing the same to Shein. Amazon announced last December it would slash seller fees from 17% to 5% for apparel under $15, with apparel between $15 to $20 triggering a 10% fee, starting in January. The company said on Monday its packages are getting delivered faster than ever: 60% of orders placed in 60 major U.S. cities arrived the same day or day after the order was placed. According to the company, that's part of its longstanding efforts to stay on top of the e-commerce market and tend to customer needs. Shein customers may have to wait 14 days for their orders to arrive.\nTadelis believes this is par for the course. Just as in most markets, company philosophies start to converge on each other when one finds an effective formula.\n“There's no surprise that these things are looking more alike,” he said. “Because once there's a good, winning strategy … then you're going to see imitators.”\nFor the consumer, there will certainly appear to be copycatting and similarities in promotions and perks across e-commerce platforms. But Ma said, don’t be fooled by Shein’s bid to mime its competitors. The site might start to look a lot like Amazon in its offerings, but behind the scenes, it’s very much sticking with its unique logistics network.\n“It might feel the same to us as consumers. It's going to become more of an everything store,” she told Fortune. “But how it builds that experience, I think the logic is very different from Amazon.”\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-05-23T14:55:00.000Z",
        "Title": "Amazon MGM Studios Presents I AM: CELINE DION",
        "Author": "CNW Group ",
        "Text": "Streaming Globally on Prime Video June 25\nWATCH OFFICIAL TRAILER\nDOWNLOAD POSTER\nTORONTO, May 23, 2024 /CNW/ - Directed by Academy Award nominee Irene Taylor, I AM: CELINE DION gives us a raw and honest behind-the-scenes look at the iconic superstar's struggle with a life-altering illness. Serving as a love letter to her fans, this inspirational documentary highlights the music that has guided her life while also showcasing the resilience of the human spirit.\nI AM: CELINE DION is presented by Amazon MGM Studios and is a Vermilion Films production in partnership with Sony Music Vision and Sony Music Entertainment Canada.\nDirected by Irene TaylorProduced by Stacy Lorts, Tom Mackay, Julie Begey Seureau and Irene TaylorExecutive produced by Dave Platel, Denis Savage, Shane Carter, Krista WegenerRuntime: 102 minutesRated: PG\nAmazon MGM Studios Press SiteEPK Press Kit\n@primevideoca #IAmCelineDion\nI AM: CELINE DION will be a part of the savings, convenience, and entertainment that Prime members enjoy with a single membership.\nSOURCE Amazon Canada Fulfillment Services, ULC\nView original content to download multimedia: http://www.newswire.ca/en/releases/archive/May2024/23/c0124.html\n"
    },
    {
        "Date": "2024-05-02T05:01:59.000Z",
        "Title": "Decoding Amazon.com Inc (AMZN): A Strategic SWOT Insight",
        "Author": "  GuruFocus Research ",
        "Text": "Amazon.com Inc showcases a robust increase in net income from $3,172 million in Q1 2023 to $10,431 million in Q1 2024.\nOperating income sees a significant jump, indicating improved operational efficiency and cost management.\nDespite global economic challenges, Amazon.com Inc continues to expand its market presence and enhance its service offerings.\nAmazon.com Inc's strategic investments in technology and infrastructure signal a forward-looking approach to growth and customer satisfaction.\nWarning! GuruFocus has detected 8 Warning Signs with AMZN.\nAmazon.com Inc (NASDAQ:AMZN), a global leader in e-commerce and cloud computing, has released its 10-Q filing on May 1, 2024, revealing a comprehensive financial performance for the first quarter of the year. The company has demonstrated a remarkable increase in net income, soaring from $3,172 million in Q1 2023 to $10,431 million in Q1 2024. This financial prowess is further underscored by a substantial rise in operating income, which has escalated from $4,774 million to $15,307 million in the same period. These figures reflect Amazon.com Inc's adeptness in navigating the complex market dynamics and its commitment to operational excellence. With a diversified portfolio that spans across North America, International, and AWS segments, the company continues to solidify its market position while exploring new horizons for growth and innovation.\nFinancial Performance and Market Leadership: Amazon.com Inc's financial health is a testament to its market leadership and operational efficiency. The company's net income has more than tripled from Q1 2023 to Q1 2024, indicating robust profitability and a strong return on investments. This financial strength is supported by a diverse revenue stream, with significant contributions from North America, International, and AWS segments. Amazon's ability to maintain a leading position in e-commerce, coupled with its dominance in cloud computing through AWS, provides a competitive edge that is difficult for rivals to match. The company's brand recognition and customer loyalty further reinforce its market dominance, making it a formidable force in the industry.\nInnovation and Infrastructure: Amazon.com Inc's commitment to innovation is evident in its continued investment in technology and infrastructure. The company's Q1 2024 report highlights a slight decrease in technology and infrastructure expenses, suggesting improved cost management and operational efficiencies. Amazon's forward-thinking approach to investing in new technologies, such as artificial intelligence and machine learning, positions it well for future growth. Moreover, the company's expansive fulfillment network and data centers are key to its ability to scale operations and meet the growing demand for its services, both from consumers and AWS clients.\nDependence on Economic Conditions: Despite its strong financial performance, Amazon.com Inc is not immune to the macroeconomic factors that can impact consumer spending and operational costs. The company acknowledges the influence of inflation, interest rates, and global economic developments on its operations. These external factors can lead to fluctuations in customer demand, affecting Amazon's sales and profitability. Additionally, the company's international operations expose it to currency exchange risks, which can affect its financial results, as seen in the $164 million reduction in net sales due to foreign exchange rates in Q1 2024.\nIntense Competition: Amazon.com Inc operates in highly competitive markets, facing challenges from both established players and emerging startups. The company's expansion into new products, services, and geographic regions brings additional risks, including the need to adapt to local market conditions and regulatory environments. Competitors with greater resources or more aggressive pricing strategies could potentially erode Amazon's market share. Furthermore, the rapid evolution of technology and consumer preferences requires continuous innovation and investment, which can strain the company's resources and affect its long-term sustainability.\nGlobal Expansion: Amazon.com Inc's international segment has shown a 10% increase in sales in Q1 2024, signaling opportunities for further global expansion. By leveraging its brand and operational expertise, Amazon can tap into emerging markets and broaden its customer base. The company's focus on price, selection, and convenience, along with its fast shipping offers, positions it well to capture additional market share internationally. Strategic partnerships and localized offerings could enhance Amazon's presence in key markets and drive future growth.\nService Diversification: The AWS segment's 17% sales increase in Q1 2024 highlights the potential for service diversification. Amazon.com Inc can continue to build on its cloud computing services, offering innovative solutions to start-ups, enterprises, and government agencies. The company's ability to adapt to customer needs and pricing changes, as well as its investment in technology infrastructure, supports the expansion of AWS and other service offerings. Diversifying into areas such as healthcare services, licensing and distribution of video content, and shipping services can create new revenue streams and reduce reliance on traditional retail sales.\nRegulatory and Legal Challenges: Amazon.com Inc faces a complex regulatory landscape that can pose significant threats to its operations. The company is subject to various laws and regulations related to e-commerce, data protection, consumer rights, and international trade. Changes in these regulations or unfavorable legal outcomes can lead to increased compliance costs, operational restrictions, and potential fines. Additionally, Amazon's vast third-party seller platform exposes it to risks associated with fraudulent activities and counterfeit goods, which can harm its reputation and result in legal liabilities.\nMarket Volatility and Consumer Behavior: The variability in Amazon.com Inc's retail business, driven by seasonality, promotions, and unforeseeable events, places strain on its operations. The company must navigate the challenges of stocking appropriate inventory levels, managing shipping costs, and ensuring timely delivery to meet fluctuating customer demand. Market volatility, including changes in interest rates and economic conditions,\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-24T16:00:00.000Z",
        "Title": "Amazon Opens New Robotics Fulfilment Centre in Calgary, Alberta",
        "Author": "CNW Group ",
        "Text": "New 2.8 million square foot facility offers unique career development opportunities for employees, with innovative technology that increases delivery speeds\nCALGARY, AB, May 24, 2024 /CNW/ - (NASDAQ: AMZN) - Amazon is proud to announce the grand opening of its newest robotics fulfilment centre, YYC4, in Calgary, Alberta. Measuring 2.8 million square feet with more than 1,500 employees, the new facility will offer in-demand skills training and career growth opportunities with cutting-edge technology that fulfils customer orders more quickly.\n\"Amazon is thrilled to invest in Calgary while benefitting our employees, customers, and the community,\" said Sushant Jha, General Manager at YYC4. \"Through the ingenuity of our Amazon Robotics technology, we are creating new career paths and development opportunities. At the same time, we are delivering to customers at our fastest speeds ever with our safest, most sophisticated, and most advanced operations network.\"\nWith the launch of YYC4, Amazon now operates five fulfilment centres, one sortation centre, three delivery stations, and two AMXL delivery stations in Alberta.\nAt Amazon Robotics fulfilment centres, employees work alongside automated systems and robots to pick, pack, and ship customer orders. Amazon's innovative robotics technology creates a safer, more efficient workplace while providing employees with hands-on training to develop new, in-demand career skills. Amazon Robotics technology used at YYC4 includes RWC4, a large robotic arm that sorts totes by destination and builds pallets for shipping, and Kermit, a trolley that focuses on towing empty totes throughout the facility and can adjust its speed and route as needed.\n\"I've learned a lot working with Amazon Robotics. The goal isn't just to master new technology, but to chart a whole new career path,\" said Danielle Olliviere, Learning Trainer at YYC4. \"Seeing my colleagues embrace this innovation has been really inspiring for me as a learning trainer. We're not just keeping up with the times; we're shaping the future.\"\n$1 Billion Invested in Workplace Safety The safety of Amazon's employees is—and always will be—the company's top priority. Amazon has invested over $1 billion globally in safety initiatives since 2019. In 2024 alone, the company allocated over $750 million to invest globally in technologies, resources, training, and programs to further safety efforts.\nCareer Development and Benefits at AmazonAs part of its mission to become Earth's Best Employer, Amazon provides eligible operations employees with access to educational opportunities through upskilling programs like Career Choice, a paid benefit that allows eligible employees to grow their careers by building the skills needed for today's most in-demand fields, including Transportation, Technology and Administration, and Business Services. Career Choice is offered in partnership with more than 70 educational institutions across Canada.\nTo date, more than 5,500 eligible employees across Amazon's Canadian fulfilment network have enrolled in the program. Amazon pays up to 95% of tuition and fees toward a certificate or diploma in qualified fields of study. Regular Amazon employees also receive competitive benefits, including medical, vision, and dental coverage, and a group RRSP plan. Through Amazon's step plan compensation model, eligible hourly full- and part-time employees can count on planned pay increases every six months until their 24-month anniversary, and then they receive another increase at month 36. Employees can also receive referral bonuses for candidates they get hired to eligible positions.\nCandidates interested in working at YYC4 are encouraged to visit www.amazon.ca/canadahourlyjobs.\nQuotes\"Amazon is one of many companies choosing to invest in Alberta, and it's fantastic to celebrate with the grand opening of YYC4 with them. This is what economic diversification looks like. It's also what the future looks like, and I'm so pleased that Amazon has chosen our province as the stage for its newest innovations.\" – Honourable Danielle Smith, Premier of Alberta\n\"Amazon's latest expansion in our province is proof positive that Alberta's business and investment environment remains second-to-none. This new fulfilment centre will help serve the consumer needs of our province. It will also provide employees with good jobs and important opportunities for skills development on innovative new robotics technology so that Amazon remains on the cutting edge of logistics. I want to congratulate Amazon on this exciting milestone and wish them continued success.\" – Honourable Matt Jones, Minister of Jobs, Economy and Trade\n\"Today's unveiling of Amazon's latest robotic fulfilment centre, YYC4, marks a monumental day for Calgary, cementing our city's status as a hub for innovation and technology. Amazon's investment sparks economic development and job creation, serving as a prime example of how strategic partnerships can lead to shared growth and prosperity in our community.\" – Jyoti Gondek, Mayor of Calgary\nAbout AmazonAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth's Most Customer-Centric Company, Earth's Best Employer, and Earth's Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfilment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nFor more information: amazon-pr@amazon.com\nSOURCE Amazon Canada Fulfillment Services, ULC\nView original content: http://www.newswire.ca/en/releases/archive/May2024/24/c9057.html\n"
    }
]