[
    {
        "Date": "2024-06-23T11:09:22.000Z",
        "Title": "Formula 1 and Amazon Aim for AI-Powered ‘Personalized’ Race Viewing",
        "Author": "  Mark Mann ",
        "Text": "(Bloomberg) -- At the Spanish Grand Prix on Sunday, Formula 1 plans to debut a new artificial intelligence “Statbot” with Amazon.com Inc., whose executives described plans for AI-powered personalized broadcasts to keep viewers hooked.\nMost Read from Bloomberg\nSupreme Court Poised to Allow Emergency Abortions in Idaho\nYouTuber Dr Disrespect Was Allegedly Kicked Off Twitch for Messaging Minor\nFedEx Stokes Investors With Hint of a Freight Deal\nVolkswagen Invests $5 Billion in EV Startup Rivian to Form Joint Venture\nBolivia’s President Arce Swears in New Army Chief After Coup Bid\nThe statbot will trawl race archives and parse torrents of real-time racing data to feed context and trivia to broadcast presenters live during the Barcelona race, using technology from the Seattle-based company’s Amazon Web Services cloud computing division, said Neil Ralph, the tech company’s lead on technical collaboration with F1.\nIt’s a sign of how AI is creeping into media, and of how F1’s owner, Liberty Media Corp., is hunting for ways to keep fans glued to screens.\nSteered by billionaire cable magnate John C. Malone, Liberty bought F1 from CVC Capital Partners in a deal announced in 2016. Since then, it has focused on increasing the sport’s global appeal, growing its audience with marketing gambits like behind-the-scenes Netflix Inc. documentary series Formula 1: Drive to Survive.\nBut in a sport heavy on engineering, whose human protagonists are hidden behind helmets, executives want ways to jazz up the live race broadcast too. The companies say they’re also using AI to offer in-race predictions on matters like pit-stop timing or when a driver might try to overtake a rival, based on real-time details such as car performance and tire degradation.\n“With this data and the intimacy with the fan, you can contemplate hyper-personalized experiences,” AWS Canada Managing Director Eric Gales said in an interview at the Canadian Grand Prix in Montreal earlier in June.\nRalph said: “That’s where we want it to go, so you as a fan can choose how much data to see and what stories you want to be told.”\nVying against other sports, streaming shows, TikTok and video games, the battle for attention has never been so intense. While F1 has broadened its reach in the US with the Netflix series and new races such as the Las Vegas Grand Prix, the sport is still sometimes panned as too predictable. Last year, F1’s top driver, Red Bull Racing’s Max Verstappen, won 19 of the 22 races; this year he has won six of nine.\n“We can’t just rely on giving them a passive experience,” said Dean Locke, F1’s director of broadcast and media, speaking to reporters in Montreal remotely from the group’s media and technology center in Biggin Hill, UK.\nMost Read from Bloomberg Businessweek\nHow Jeff Yass Became One of the Most Influential Billionaires in the 2024 Election\nMusk’s Population Obsession Comes With a Dark History\nWhy BYD’s Wang Chuanfu Could Be China’s Version of Henry Ford\nThe FBI’s Star Cooperator May Have Been Running New Scams All Along\nHow Glossier Turned a Viral Moment for ‘You’ Perfume Into a Lasting Business\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-06-06T10:26:11.000Z",
        "Title": "Teamsters tie up with Staten Island Amazon union, win other elections",
        "Author": "  John Kingston ",
        "Text": "The Teamsters union has recorded several organizing or contract-signing victories in the past few weeks, but a step it has taken toward representing at least one group of Amazon workers has garnered the biggest headlines.\nAn independent labor union that won representation at a Staten Island, New York, warehouse in 2022, a victory that Amazon (NASDAQ: AMZN) is fighting, has agreed to come under the umbrella of the Teamsters, according to media reports. The Teamsters posted an announcement about the agreement on the company’s X (formerly Twitter) feed.\nThe Amazon Labor Union (ALU) is the grassroots organization that won a 2022 vote to unionize more than 8,000 workers at a giant Amazon facility in Staten Island. Efforts by national labor unions at other Amazon facilities have failed; the Retail Wholesale and Department Store Union is seeking a third election at an Amazon warehouse in Bessemer, Alabama.\n\nThe tie-up between the Teamsters and the ALU, announced Tuesday, needs to be ratified by the more than 8,000 rank-and-file members before becoming official.\nThe ALU has not been able to sign a contract with Amazon, which is fighting a legal battle against the union on several fronts.\nThere also have been multiple reports of strife within the union, which failed in an organizing vote at another Amazon warehouse on Staten Island soon after its victory. The ALU win in its first Staten Island vote remains the only time a union has won a representation election at an Amazon facility.\nHarry Katz, a professor at Cornell University and the president of the International Labor and Employment Relations Association, told FreightWaves that the ALU had preliminary discussions with the Teamsters about some sort of affiliation soon after it was elected but that the talks fell short.\n\nThe advice and guidance the ALU is getting as an independent union “doesn’t compare to the know-how and resources that the Teamsters has,” Katz said.\nGiven the extensive use of outside transportation companies Amazon uses, some of them with companies whose drivers have Teamsters representation, “what the Teamsters potentially provides is leverage against Amazon,” Katz said.\nWhile mounting some sort of secondary boycott is illegal, Katz said, the Teamsters may be able to find a way to “hassle” the online retailer.\nBut it still will be a challenging battle. Although the ALU was voted in by the rank and file, that only mandates that Amazon bargain in “good faith.” “It’s very hard to ever reach a first contract because the law merely requires Amazon to bargain in good faith,” Katz said. “It doesn’t require that the parties reach agreement.”\nBut with the Teamsters-ALU tie-up, Katz said it will need to be determined “whether the union at Amazon, affiliated with the Teamsters, can generate enough bargaining leverage to convince Amazon to sign its first agreement.”\nKate Bronfenbrenner, director of Labor Education Research and a senior lecturer at Cornell University’s School of Industrial and Labor Relations, described Amazon as “aggressive as an employer opposed to unions as you can get.” She added that fact “doesn’t mean the union can’t win, but it takes something much more than a one-local site can do.”\nRatification by the members of the ALU, she said, is “not a slam dunk.”\nWhile the affiliation with the ALU may be the Teamsters story that has gotten the most attention, the more mundane work of organizing workers and signing contracts was positive in May for the union.\n\nA list of contract representation votes from the National Labor Relations Board records three successful Teamsters organization elections certified by the NLRB in recent weeks.\nOne of them is at 10 Roads Express, where the Teamsters last year successfully organized workers in Iowa and Nebraska. The company is primarily a contract carrier for the U.S. Postal Service.\nIn the latest election at the Greensboro, North Carolina, facility of 10 Roads, according to NLRB data, 42 votes were cast in favor of representation while 13 were cast in opposition. The election covers all full-time and regular part-time route drivers employed at the site, according to the NLRB.\nIn a statement celebrating the victory, the Teamsters said the vote was the latest step in a broader effort to unionize drivers at the company.\nThe Teamsters said the North Carolina victory brings its record to having unionized more than 300 workers at 10 Roads facilities in Colorado and New Jersey, as well as the North Carolina and Midwest successes.\n“The Teamsters’ victory in Greensboro will give us an even stronger foundation for more organizing at 10 Roads,” John A. Murphy, Teamsters national freight director, said in the prepared statement. “Our message to 10 Roads drivers everywhere is that the Teamsters are here to help you win what’s yours. This latest win further solidifies the Teamsters’ presence at 10 Roads and expands the growing movement among drivers to demand their rights and secure a better workplace.”\nOther victories recently certified by the NLRB were for smaller groups of workers.\nAt Performance Team Logistics, a subsidiary of Maersk (DKK: MAERSK-B.CO), a vote in May saw 14 votes in favor of unionization with Teamsters Local 179. Three votes were cast in opposition.\nNLRB described the pool of voters as all full-time and part-time drivers at Performance’s Elwood, Illinois facility.\nA spokeswoman for Maersk said Performance Team “owns and operates trucks and electric vehicles in various locations across the United States.” She added that there is unionization at other Performance Team facilities.\nThere are 19 workers impacted by the vote, she said. “While we prefer to work directly with our employees without the presence of a third party, we respect each employee’s right to make their own decision about whether to vote for a union,” the spokeswoman said.\nThe NLRB also recently certified a victory for Teamsters Local 481 at Penske Truck Leasing in El Centro, California. The good news for the Teamsters was that the vote was unanimous. But the grand total of votes was three. It covers maintenance technicians.\nThe Teamsters does not always announce local victories. But it does frequently highlight contract signings and has done so recently.\nThe union’s workers at several Ryder Truck Rental (NYSE: R) facilities in Minnesota, represented by Local 974, have ratified a three-year contract that calls for a 14.5% increase in pay over the life of the deal. There are also benefit improvements for the 43 workers covered by the contract. They include more vacation time and strike protections.\nUnionization is widespread at Ryder. In the company’s 10-K filing with the Securities and Exchange Commission for this year, Ryder said the company has 98 separate labor agreements. Its workers are primarily represented by the International Association of Machinists and Aerospace Workers, the United Auto Workers and the Teamsters.\nA Ryder spokeswoman confirmed the new deal and the size of the wage increase.\nRepresentatives from 10 Roads and the Teamsters had not responded to FreightWaves’ queries by publication time.\nMore articles by John Kingston\nTeamsters rack up late-2023 wins, stage significant strike in ’24\nTeamsters out at Southern California trucking company; other votes mixed\nWhy Teamsters is willing to sacrifice 22,000 union trucking jobs\nThe post Teamsters tie up with Staten Island Amazon union, win other elections appeared first on FreightWaves.\n"
    },
    {
        "Date": "2024-06-18T07:32:18.000Z",
        "Title": "Amazon Union Allies With Teamsters in Big Labor Advance",
        "Author": "  Edwin Chan ",
        "Text": "(Bloomberg) -- Union members at Amazon.com Inc. have voted to hook up with one of the largest US labor groups, a partnership that could help pressure the e-commerce leader in staff contract negotiations.\nMost Read from Bloomberg\nAt Blackstone's $339 Billion Property Arm, the Honeymoon Is Over\nCDK Tells Car Dealers Their Systems Will Likely Be Down for Days\nCar Dealerships Across US Halt Services After Cyberattack\nUnited Airlines Jet Turns Back After Engine Piece Falls Off\nPutin’s Hybrid War Opens a Second Front on NATO’s Eastern Border\nAbout 98% of the Amazon Labor Union voted in favor of linking with the International Brotherhood of Teamsters, the groups said in a joint statement. They pledged to cooperate to help secure jobs and decent working conditions for Amazon workers.\nThe ALU won a landmark victory in 2022, organizing thousands of workers at an Amazon facility in Staten Island. But the union lost two subsequent elections and descended into conflict between leader Chris Smalls and other officials. In the meantime, attempts to bring Amazon to the bargaining table faltered.\nSmalls said previously that he and 15 other ALU officials hammered out an agreement in Washington with Teamsters President Sean O’Brien and his colleagues. O’Brien’s group represents some 1.3 million people, according to their statement.\nAmazon wasn’t immediately available for comment outside normal business hours.\nMost Read from Bloomberg Businessweek\nIlya Sutskever Has a New Plan for Safe Superintelligence\nJPMorgan Ignites $40 Billion Rush Into Indian Bonds\nMore Disabled Americans Are Employed, Thanks to Remote Work\nDocuments Show How Musk’s X Plans to Become the Next Venmo\nHow to Do a Four-Day Workweek That Actually Works\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-06-07T21:45:11.000Z",
        "Title": "Amazon (AMZN) Sees a More Significant Dip Than Broader Market: Some Facts to Know",
        "Author": "  Zacks Equity Research ",
        "Text": "In the latest trading session, Amazon (AMZN) closed at $184.30, marking a -0.38% move from the previous day. This change lagged the S&P 500's 0.11% loss on the day. Meanwhile, the Dow experienced a drop of 0.22%, and the technology-dominated Nasdaq saw a decrease of 0.23%.\nShares of the online retailer have depreciated by 2.37% over the course of the past month, underperforming the Retail-Wholesale sector's gain of 0.18% and the S&P 500's gain of 3.51%.\nThe upcoming earnings release of Amazon will be of great interest to investors. The company is expected to report EPS of $1.02, up 61.9% from the prior-year quarter. In the meantime, our current consensus estimate forecasts the revenue to be $148.54 billion, indicating a 10.54% growth compared to the corresponding quarter of the prior year.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $4.58 per share and revenue of $638.24 billion. These totals would mark changes of +57.93% and +11.04%, respectively, from last year.\nInvestors should also pay attention to any latest changes in analyst estimates for Amazon. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.96% upward. Currently, Amazon is carrying a Zacks Rank of #3 (Hold).\nLooking at its valuation, Amazon is holding a Forward P/E ratio of 40.38. This denotes a premium relative to the industry's average Forward P/E of 21.34.\nAlso, we should mention that AMZN has a PEG ratio of 1.36. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. As the market closed yesterday, the Internet - Commerce industry was having an average PEG ratio of 0.95.\nThe Internet - Commerce industry is part of the Retail-Wholesale sector. With its current Zacks Industry Rank of 71, this industry ranks in the top 29% of all industries, numbering over 250.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-26T20:15:08.000Z",
        "Title": "Amazon hits $2 trillion in valuation on AI fervor, rate cut bets",
        "Author": "Reuters ",
        "Text": "(Reuters) -Amazon.com Inc hit $2 trillion in market value for the first time on Wednesday, becoming the fifth U.S. company to surpass that level as optimism around artificial intelligence and potential interest rate cuts this year drove demand for technology-related stocks.\nThe stock rose 3.9% to $193.61, giving the e-commerce giant a market value of over $2 trillion and putting it in the same club as technology heavyweights Microsoft Corp, Apple Inc, Nvidia Corp and Alphabet.\nU.S. stock indexes have recorded robust gains this year on relentless enthusiasm around AI, optimism around resilience in the U.S. economy and potential easing of interest rates from the Federal Reserve.\nWall Street was trading near record levels, largely powered by megacap stocks such as Nvidia and Amazon, whose future cash flows stand to benefit from lower interest rates.\nShares of Amazon, which were added to the blue-chip Dow Jones Industrial Average index in February, have climbed over 26% this year. The company became the fifth biggest U.S. company by market value in February after Nvidia went up a spot.\nAmazon Web Services is the largest cloud services provider in the world, and growth at the Amazon unit has returned after a dip in the past year, thanks to surging adoption of AI technologies.\nThe company has also invested in AI startup Anthropic and robotics firm Figure as it looks to capitalize on the AI boom.\nLate last year, Amazon unveiled a new generation of custom-designed chips used in data centers, targeting applications for machine-learning training and generative artificial intelligence.\n(Reporting by Shristi Achar A in Bengaluru, Additonal reporting by Akash Sriram; Editing by Shinjini Ganguli)\n"
    }
]