[
    {
        "Date": "2024-07-25T07:00:30.000Z",
        "Title": "Amazon Stock Jumps As NBA Signs Prime Video Broadcasting Deal",
        "Author": "  Adam Eckert ",
        "Text": "Amazon.com Inc (NASDAQ:AMZN) shares were rising in Wednesday’s after-hours session after the National Basketball Association (NBA) announced a deal in which Prime Video will telecast NBA games over the next decade.\nThe NBA announced a renewal of its partnership with Walt Disney Co (NYSE:DIS), as well as new agreements with NBCUniversal and Amazon under which ABC/ESPN, NBC/Peacock and Prime Video will telecast NBA games beginning with the 2025-26 season. The deal is set to remain in place through the 2035-36 season.\nDon’t Miss: \nThis platform is offering 8.1% APY on idle cash and up to 15 FREE Stocks with qualified deposits for a limited time.\nIf you invested $100K in Nivida during COVID, you would’ve been a millionaire today. Get it as your free stock on this platform today.\n“Our new global media agreements with Disney, NBCUniversal and Amazon will maximize the reach and accessibility of NBA games for fans in the United States and around the world,\" said NBA Commissioner Adam Silver.\n\"These partners will distribute our content across a wide range of platforms and help transform the fan experience over the next decade.\"\nTrending:\nEnjoy freedom to trade from market hours with this revolutionary platform allowing 24-hour trading access.\nTauted as being one of the most budget-friendly premium options tradings, it now offers zero contract fees on equity options and a bonus of 5 free stocks\nUnder the new deal, Amazon will distribute 66 NBA regular-season games on Prime Video each season.  In addition, Prime Video is now set to stream the Championship Game of the Emirates NBA Cup.\nAmazon’s Prime Video will also distribute all six NBA Play-In Tournament games and stream approximately one-third of the first and second rounds of the playoffs each year. Prime Video will also stream one of the two Conference Finals series in six of the 11 years on a rotating basis with NBCUniversal.\nAmazon plans to distribute NBA games globally as part of Prime Video and offer an expanded package of games in select territories. The expanded package includes a minimum of 20 additional primetime regular season games each year, a Conference Finals series each year and the NBA Finals in six of the 11 years.\nThe NBA also announced that Amazon’s Prime Video will become a strategic partner of the NBA, making it the third-party global destination of NBA League Pass.\nAmazon shares were up 0.42% after hours at $181.59 at the time of publication Wednesday, according to Benzinga Pro.\nRead Next: \nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Amazon Stock Jumps As NBA Signs Prime Video Broadcasting Deal originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-07-12T15:57:11.000Z",
        "Title": "Amazon AI chatbot Rufus is now live for all US customers",
        "Author": "  Sarah Perez ",
        "Text": "Amazon's AI-powered shopping assistant, named \"Rufus,\" is now live for all U.S. customers in the Amazon mobile app, the retailer announced on Friday. The assistant, which lives on the bottom right of the app's main navigation bar, is designed to offer customers help with finding products, performing product comparisons and getting recommendations on what to buy.\nRufus was initially available in beta only to select customers in the U.S. within the Amazon mobile app ahead of Friday's launch. Now, Amazon says all shoppers in the U.S. can try it after testing the chatbot across \"tens of millions of questions.\"\nFirst announced in February, the AI chatbot has been trained on Amazon's product catalog, customer reviews, community Q&As and other public information found around the web — though Amazon isn't disclosing specifically which websites' data was used to help its assistant make better recommendations, or whether that included other retail websites.\nRufus itself is powered by an internal large language model (LLM) specialized for shopping, allowing customers to ask questions about products, including things like factors to consider when buying, how items are different from other products, or how well the product holds up, as described by customer reviews and other expert analysis pulled from around the web.\nFor example, customers could ask things like “What to consider when buying headphones?” “What to consider when detailing my car at home?” “What are clean beauty products?” “What do I need for cold weather golf?” and more. Plus, customers can chat with Rufus, by telling the AI something they want to do, like: “I want to start an indoor garden.” The chatbot will then provide suggestions on what to buy to accomplish that task.\nDuring tests, Amazon found that customers asked the AI questions and were also clicking on the related questions that appear in the chat window to help guide customer queries. For instance, customers might ask Rufus, \"What's the material of the backpack?,\" and then tap on another question, \"What do customers say?\" to learn more.\nBecause Rufus understands more than just products, when a customer asked about a pool umbrella for Florida, Rufus shared facts about Florida's weather, humidity and more, Amazon says.\nIn addition to product comparisons, Rufus was also helpful in keeping customers up to date with things like fashion trends or the latest tech, as customers could ask what the latest model of a product was, or what sort of styles were popular.\nRufus also served beta customers as an assistant to help them find their past orders or learn more about when current orders are arriving.\nTo access Rufus, U.S. customers will need to be on the latest version of the Amazon Shopping app. The assistant will be available in the bottom navigation bar, designated by an icon with chat bubbles with a sparkle.\nIn tests, TechCrunch found that Rufus served as a decent shopping companion, and largely steered clear of problematic answers to questions outside of shopping. However, it didn't always get its facts right, and its limitations to only Amazon's catalog — vast as it is — could compromise the quality of its recommendations, at times.\nAmazon says it will continue to improve Rufus over time.\nhttps://techcrunch.com/2024/03/05/amazons-new-rufus-chatbot-isnt-bad-but-it-isnt-great-eitherThis article originally appeared on TechCrunch at https://techcrunch.com/2024/07/12/amazon-ai-chatbot-rufus-is-now-live-for-all-u-s-customers/\n"
    },
    {
        "Date": "2024-07-24T13:30:10.000Z",
        "Title": "Amazon (AMZN) Is Considered a Good Investment by Brokers: Is That True?",
        "Author": "  Zacks Equity Research ",
        "Text": "When deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nBefore we discuss the reliability of brokerage recommendations and how to use them to your advantage, let's see what these Wall Street heavyweights think about Amazon (AMZN).\nAmazon currently has an average brokerage recommendation (ABR) of 1.07, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 46 brokerage firms. An ABR of 1.07 approximates between Strong Buy and Buy.\nOf the 46 recommendations that derive the current ABR, 43 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 93.5% and 6.5% of all recommendations.\nBrokerage Recommendation Trends for AMZN\nCheck price target & stock forecast for Amazon here>>>While the ABR calls for buying Amazon, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\nZacks Rank Should Not Be Confused With ABR\nAlthough both Zacks Rank and ABR are displayed in a range of 1-5, they are different measures altogether.\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nIt has been and continues to be the case that analysts employed by brokerage firms are overly optimistic with their recommendations. Because of their employers' vested interests, these analysts issue more favorable ratings than their research would support, misguiding investors far more often than helping them.\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\nIs AMZN a Good Investment?\nIn terms of earnings estimate revisions for Amazon, the Zacks Consensus Estimate for the current year has increased 0.2% over the past month to $4.59.\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #1 (Strong Buy) for Amazon. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, the Buy-equivalent ABR for Amazon may serve as a useful guide for investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-11T08:38:42.000Z",
        "Title": "Talen-Amazon interconnection agreement needs extended FERC review: PJM market monitor",
        "Author": "  Ethan Howland ",
        "Text": "This story was originally published on Utility Dive. To receive daily news and insights, subscribe to our free daily Utility Dive newsletter.\nThe Federal Energy Regulatory Commission should reject or hold a hearing process on proposed changes to an interconnection service agreement, or ISA, that would provide power directly from a majority-owned Talen Energy nuclear power plant to an Amazon data center, the PJM Interconnection’s market monitor said Wednesday.\nThe proposed ISA raises market issues, and the agreement could set precedent for co-located load at other nuclear and non-nuclear power plants in PJM, according to Monitoring Analytics, the market monitor.\n“PJM needs to provide a comprehensive analysis of the impact of removing significant levels of generation from the market,” Monitoring Analytics said. “PJM has made a series of critical policy decisions that are embedded in this ISA involving, among other things, how backup power is handled, that are very different from positions that PJM has previously taken on related matters in the stakeholder process.”\nThe market monitor said key questions include: How will load be met in PJM if multiple baseload power plants are effectively removed from the market? How would it affect power flows? How would it affect energy and capacity prices?\nPJM had 32.2 GW of nuclear capacity, making up 18% of its installed capacity as of March 31, according to Monitoring Analytics’ most recent market report.\nTalen said in March that it had agreed to sell a planned data center campus in Pennsylvania to Amazon’s cloud computing unit, Amazon Web Services, for $650 million. Talen intends to sell power to AWS from its 2,228-MW stake in the Susquehanna nuclear power plant, according to the company.\nAWS has agreed to buy power from Talen in 120-MW increments for the data center, which could grow to 960 MW, according to Talen. AWS also has an option to cap its commitment at 480 MW.\nTo facilitate the sale of power to the co-located data center, PJM in June asked FERC to approve an amended ISA among the grid operator, Susquehanna Nuclear and PPL Electric Utilities. The amended ISA would increase the behind-the-meter connection between the power plant and the co-located data center to 480 MW from 300 MW in the existing ISA.\nAmerican Electric Power and Exelon — on behalf of their utilities — challenged the ISA, in part because they claim it could cause an annual shift of up to $140 million in transmission costs onto PJM ratepayers. AEP and Exelon said FERC should start a hearing process to consider the issue, or reject the amended ISA outright.\nThe idea that Amazon’s co-located data center would be completely separate from the grid is an “illusion,” according to Monitoring Analytics.\n“The co-located load will continue to rely on the grid for a range of ancillary services including frequency control, reactive, spinning reserves, reserves in general, black start, and PJM administrative functions,” the market monitor said. “While the proposed amendment to the ISA is creative, its benefits to the co-located load come at the expense of other customers in the PJM markets.”\nIf Talen’s model for supplying co-located data centers is widely adopted in PJM, energy prices would rise significantly as supply is removed from the market, according to the market monitor.\n“The commission’s decision in this matter, while framed as a narrow issue by Talen, has extremely large significance for the future of PJM markets,” Monitoring Analytics said.\nUnder Talen’s proposed ISA, the co-located load would avoid paying distribution charges and transmission charges and would not be directly regulated by a state utility commission or FERC, according to the market monitor.\nThe Pennsylvania Public Utility Commission told FERC that “questions of fact and law remain unresolved” related to the proposed ISA amendment and that the agency should hold a hearing to consider them.\nMeanwhile, Constellation Energy Generation and Vistra told FERC on Wednesday that the agency should dismiss the concerns raised by AEP and Exelon, saying the proceeding only deals with the interconnection service that PJM provides to the Susquehanna power plant and the ISA amendment.\nThe protest by the utility companies aims to complicate the proceeding by “throwing spaghetti at the wall in the hope that something, anything, might stick,” the independent power producers said.\n“It is yet another attempt by AEP and Exelon to deter or outright prevent the development of new data centers, particularly co-located, behind the meter data centers,” they said, citing AEP Ohio’s proposed rates for data center interconnections.\nAEP and Exelon are trying to stop non-utility power plant owners in PJM from serving co-located load so the companies’ utilities would be the only option for meeting the demand for data center infrastructure, Constellation and Vistra said.\nAn adverse ruling by FERC on the ISA will “introduce regulatory uncertainty about the pace and feasibility of powering these [data center] projects that could jeopardize that economic engine and the national interest,” the companies said.\nNearly all the concern about the ISA is driven by a false assumption that Amazon’s data center will receive services from the grid and shift costs onto other customers, according to Constellation and Vistra.\n“Behind-the-meter configurations like this one likely save the cost of transmission upgrades often required for front-of-the-meter interconnections of loads this large, which could be passed on in some instances to all transmission customers,” they said.\nIf FERC finds there are issues about co-located load that need to be explored, it should direct PJM to conduct a 90-day stakeholder process to do that, according to Constellation and Vistra.\nConstellation owns eight nuclear power plants in PJM totaling nearly 16 GW — or about half the nuclear capacity in the grid operator’s footprint, which covers all or part of 13 Mid-Atlantic and Midwest states and the District of Columbia. Vistra owns the Beaver Valley, Davis-Besse and Perry nuclear plants in PJM totaling about 4 GW.\nPJM on Monday urged FERC to approve the ISA, saying in part that any review of broad policy issues should be handled outside the proceeding.\nIf FERC approves the amended ISA, the agency will likely take additional action, such as launching a proceeding to consider broader issues around co-located load, ClearView Energy Partners said in a client note Thursday. The research firm said it is “skeptical” FERC will reject the amended ISA. It expects FERC to take action on the issue by an Aug. 3 deadline.\nThere is a “meaningful” — but less than 50% chance — that FERC will launch a hearing process to consider the issues raised by the proposed ISA, which would delay a final decision, Morgan Stanley analysts said in a client note on Tuesday.\n“We continue to believe 1) the ISA between Talen and Amazon is valid and FERC is unlikely to impose major changes or transmission charges on the companies, 2) future data center deals with nuclear plants can continue to move forward, and 3) future data center contracts can be structured and electrical configurations can be set to avoid these regulatory pushbacks in subsequent filings,” the Morgan Stanley analysts said.\nA Goldman Sachs research newsletter issued late last month raises questions about the future of generative AI and whether utilities and other power suppliers would be able to supply the vast amounts of power it requires.\n“AI technology is exceptionally expensive, and to justify those costs, the technology must be able to solve complex problems, which it isn’t designed to do,” Jim Covello, Goldman Sachs head of global equity research, said in “Gen AI: Too Much Spend, Too Little Benefit?.”\nGoldman Sachs estimates that about 47 GW of new generating capacity is needed to serve U.S. data center-related load growth through 2030. It would cost about $50 billion, or $7 billion a year, to build the new generation, with transmission and other related infrastructure costing more, according to Carly Davenport, a senior U.S. utilities equity research analyst at the investment firm.\n“Between generation, transmission, and distribution needs, we expect the utility companies in our coverage universe [will] spend nearly 40% more from 2024-2027 relative to the prior four-year period, amounting to roughly $140 [billion] on average annually,” Davenport said.\n"
    },
    {
        "Date": "2024-07-30T11:00:00.000Z",
        "Title": "Plug Power Names Amazon Executive as its New COO",
        "Author": "  Plug Power, Inc. ",
        "Text": "14-Year Amazon Veteran Was Responsible for Global Engineering Services\nSLINGERLANDS, N.Y., July 30, 2024 (GLOBE NEWSWIRE) -- Plug Power Inc. (NASDAQ: PLUG), a global leader in comprehensive hydrogen solutions for the green hydrogen economy, hired Dean Fullerton as its new Chief Operating Officer (COO). Fullerton joins from Amazon, where he was responsible for engineering services for North America, Europe and emerging countries.\nAs COO for Plug, Fullerton will collaborate with the executive team to develop and implement strategic plans, identifying growth opportunities and operational improvements. In his position he will have global responsibility for project execution, manufacturing, supply chain and hydrogen generation. Fullerton’s role will be integral in steering the organization towards its strategic objectives while maintaining operational efficiency and fostering a culture of innovation and high performance.\n“Hiring Dean as COO is a landmark hire for our organization,” said Plug CEO Andy Marsh. “As a long-time client of ours, we have a strong working relationship with Dean and look forward to his contributions to the expansion of our logistics operations as we pioneer and scale up a vertically integrated green hydrogen ecosystem.”\nWith increasing responsibilities over a 14-year tenure at Amazon, Fullerton was most recently Vice President of Global Engineering and Security Services at Amazon. In this role, he oversaw Operations Engineering, Planning and Analytics, Reliability and Maintenance Engineering, Global Security, Real Estate Transactions and Global Procurement.\nA proven leader in the supply chain and logistics engineering industry, Fullerton built the largest, most complex automated ecommerce network in the world, including an approximately $1.5 billion airport and automated parcel facility. His other key achievements include building Amazon’s hydrogen economy team, including projects to support powered industrial trucks, airport ground support equipment, delivery vans, and backup generators previously powered by electricity, fuel, and lead acid batteries, resulting in the reduction of Amazon’s carbon footprint and tens of millions of dollars in savings.\nHe holds a Master of Business Administration and a Bachelor of Science in Business Management. He began his career with United Parcel Service working for 13 years in Industrial Engineering, then spent eight years as a Principal/Director at a supply chain and logistics engineering consulting firm. Prior to joining Amazon, he worked for Gap Inc. as Senior Director of Engineering and Maintenance for North America.\nPlug and Amazon have a long-standing business relationship, marked by strategic investments and successful collaborations. In April 2017, Amazon entered into a significant agreement to purchase Plug’s hydrogen fuel cell solutions to power its material-handling equipment. Over the last seven years, the partnership has grown and expanded to more sites and more applications of Plug’s hydrogen fuel cells. Through the partnership with Plug, Amazon has been able to achieve many of its corporate sustainability goals and improve the efficiency of its logistics operations.\nAbout Plug\nPlug is building an end-to-end green hydrogen ecosystem, from production, storage, and delivery to energy generation, to help its customers meet their business goals and decarbonize the economy. In creating the first commercially viable market for hydrogen fuel cell technology, the company has deployed more than 69,000 fuel cell systems and over 250 fueling stations, more than anyone else in the world, and is the largest buyer of liquid hydrogen.\nWith plans to operate a green hydrogen highway across North America and Europe, Plug built a state-of-the-art Gigafactory to produce electrolyzers and fuel cells and is developing multiple green hydrogen production plants for commercial operation. Plug delivers its green hydrogen solutions directly to its customers and through joint venture partners into multiple environments, including material handling, e-mobility, power generation, and industrial applications.\nFor more information, visit www.plugpower.com.\nMEDIA CONTACT\nFatimah Nouilati AllisonplugPR@allisonpr.com\n\n"
    }
]