[
    {
        "Date": "2024-08-23T02:59:35.000Z",
        "Title": "Exclusive-Chinese entities turn to Amazon cloud and its rivals to access high-end US chips, AI",
        "Author": "  Eduardo Baptista, Fanny Potkin and Karen Freifeld ",
        "Text": "By Eduardo Baptista, Fanny Potkin and Karen Freifeld\nBEIJING/SINGAPORE/NEW YORK (Reuters) - State-linked Chinese entities are using cloud services provided by Amazon or its rivals to access advanced U.S. chips and artificial intelligence capabilities that they cannot acquire otherwise, recent public tender documents showed.\nThe U.S. government has restricted the export of high-end AI chips to China over the past two years, citing the need to limit the Chinese military's capabilities.\nProviding access to such chips or advanced AI models through the cloud, however, is not a violation of U.S. regulations since only exports or transfers of a commodity, software or technology are regulated.\nA Reuters review of more than 50 tender documents posted over the past year on publicly available Chinese databases showed that at least 11 Chinese entities have sought access to restricted U.S. technologies or cloud services.\nAmong those, four explicitly named Amazon Web Services (AWS) as a cloud service provider, though they accessed the services through Chinese intermediary companies rather than from AWS directly.\nThe tender documents, which Reuters is the first to report on, show the breadth of strategies Chinese entities are employing to secure advanced computing power and access generative AI models. They also underscore how U.S. companies are capitalising on China's growing demand for computing power.\n\"AWS complies with all applicable U.S. laws, including trade laws, regarding the provision of AWS services inside and outside of China,\" a spokesperson for Amazon's cloud business said.\nAWS controls nearly a third of the global cloud infrastructure market, according to research firm Canalys. In China, AWS is the sixth-largest cloud service provider, according to research firm IDC.\nShenzhen University spent 200,000 yuan ($27,996) on an AWS account to gain access to cloud servers powered by Nvidia A100 and H100 chips for an unspecified project, according to a March tender document. It got this service via an intermediary, Yunda Technology Ltd Co, the document showed.\nExports to China of the two Nvidia chips, which are used to power large-language models (LLM) such as OpenAI's ChatGPT, are banned by the U.S.\nShenzhen University and Yunda Technology did not respond to requests for comment. Nvidia declined to comment on Shenzhen University's spending or on any of the other Chinese entities' deals.\nZhejiang Lab, a research institute developing its own LLM, GeoGPT, said in a tender document in April that it intended to spend 184,000 yuan to purchase AWS cloud computing services as its AI model could not get enough computing power from homegrown Alibaba.\nA spokesperson for Zhejiang Lab said that it did not follow through with the purchase but did not respond to questions about the reasoning behind this decision or how it met its LLM's computing power requirements. Alibaba's cloud unit, Alicloud, did not respond to a request for comment.\nReuters could not establish whether or not the purchase went ahead.\nThe U.S. government is now trying to tighten regulations to restrict access through the cloud.\n\"This loophole has been a concern of mine for years, and we are long overdue to address it,\" Michael McCaul, chair of the U.S. House of Representatives Foreign Affairs Committee, told Reuters in a statement, referring to the remote access of advanced U.S. computing through the cloud by foreign entities.\nLegislation was introduced in Congress in April to empower the commerce department to regulate remote access of U.S. technology, but it is not clear if and when it will be passed.\nA department spokesperson said it was working closely with Congress and \"seeking additional resources to strengthen our existing controls that restrict PRC companies from accessing advanced AI chips through remote access to cloud computing capability.\"\nThe commerce department also proposed a rule in January that would require U.S. cloud computing services to verify large AI model users and report to regulators when they use U.S. cloud computing services to train large AI models capable of \"malicious cyber-enabled activity\".\nThe rule, which has not been finalized, would also enable the commerce secretary to impose prohibitions on customers.\n\"We are aware the commerce department is considering new regulations, and we comply with all applicable laws in the countries in which we operate,\" the AWS spokesperson said.\nCLOUD DEMAND IN CHINA\nThe Chinese entities are also seeking access to Microsoft's cloud services.\nIn April, Sichuan University said in a tender document it was building a generative AI platform and purchasing 40 million Microsoft Azure OpenAI tokens to support the delivery of this project. The university's procurement document in May showed that Sichuan Province Xuedong Technology Co Ltd supplied the tokens.\nMicrosoft did not respond to requests for comment. Sichuan University and Sichuan Province Xuedong Technology did not respond to requests for comment on the purchase.\nOpenAI said in a statement its own services are not supported in China and that Azure OpenAI operates under Microsoft's policies. It did not comment on the tenders.\nThe University of Science and Technology of China's (USTC) Suzhou Institute of Advanced Research said in a tender document in March that it wanted to rent 500 cloud servers, each powered by eight Nvidia A100 chips, for an unspecified purpose.\nThe tender was fulfilled by Hefei Advanced Computing Center Operation Management Co Ltd, a procurement document showed in April, but the document did not name the cloud service provider and Reuters could not determine its identity.\nUSTC was added to a U.S. export control list known as the 'Entity List' in May for acquiring U.S. technology for quantum computing that could help China's military, and involvement in its nuclear program development.\nUSTC and Hefei Advanced Computing Center did not respond to requests for comment.\nBEYOND RESTRICTED AI CHIPS\nAmazon has offered Chinese organisations access not only to advanced AI chips but also to advanced AI models such as Anthropic's Claude which they cannot otherwise access, according to public posts, tenders and marketing materials reviewed by Reuters.\n\"Bedrock provides a selection of leading LLMs including prominent closed-source models such as Anthropic's Claude 3,\" Chu Ruisong, President of AWS Greater China, told a generative AI-themed conference in Shanghai in May, referring to its cloud platform.\nIn various Chinese-language posts for AWS developers and clients, Amazon highlighted the opportunity to try out \"world-class AI models\" and mentioned Chinese gaming firm Source Technology as one of its clients using Claude.\nAmazon has dedicated sales teams serving Chinese clients domestically and overseas, according to two former company executives.\nAfter Reuters contacted Amazon for comment, it updated dozens of posts on its Chinese-language channels with a note to say some of its services were not available in its China cloud regions. It also removed several promotional posts, including the one about Source Technology. Amazon did not give a reason for removing the posts and did not answer a Reuters query on that.\n\"Amazon Bedrock customers are subject to Anthropic's end user license agreement, which prohibits access to Claude in China both via Amazon's Bedrock API (application programming interface) and via Anthropic's own API,\" the AWS spokesperson said.\nAnthropic said it does not support or allow customers or end-users within China to access Claude.\n\"However, subsidiaries or product divisions of Chinese-headquartered companies may use Claude if the subsidiary itself is located in a supported region outside of China,\" an Anthropic spokesperson said.\nSource Technology did not respond to a request for comment.\n($1 = 7.1440 Chinese yuan renminbi)\n(Reporting by Eduardo Baptista, Fanny Potkin and Karen Freifeld; Additional reporting by Krystal Hu, Alexandra Alper and Beijing newsroom; Editing by Miyoung Kim and Muralikumar Anantharaman)\n"
    },
    {
        "Date": "2024-08-29T11:54:07.000Z",
        "Title": "Amazon Moves Forward With Satellite Internet Ambitions, Secures New Zealand Land for Project Kuiper",
        "Author": "  Anusuya Lahiri ",
        "Text": "Amazon.com Inc (NASDAQ:AMZN) bagged regulatory permission in July to buy a 500-square-meter site in New Zealand for Project Kuiper.\nAmazon proposes to install and operate telecommunications equipment on the land to cater to its New Zealand customers, Bloomberg cites the Overseas Investment Office in Wellington.\nProject Kuiper is Amazon’s initiative to develop a large-scale satellite broadband constellation that will provide reliable, affordable Internet service to underserved communities worldwide.\nThis project is part of a broader movement involving several companies planning to launch satellite constellations to offer global broadband internet coverage.\nAmazon’s Project Kuiper aims to offer broadband internet from a constellation of more than 3,000 satellites in low Earth orbit, mirroring Elon Musk’s Starlink.\nThe financial terms of the land acquisition were not disclosed.\nIt aims to launch its satellites before the end of 2024 and start the first customer tests in 2025, with a commercial service to follow later in the year. However, challenges loom in balancing affordability and service quality.\nIn June, Amazon’s Project Kuiper collaborated with DIRECTV Latin America parent Vrio Corp to offer satellite broadband in seven South American countries.\nIn August, Amazon reported 10% second-quarter topline growth, reaching $148 billion but trailing the analyst consensus estimate of $148.56 billion.\nAmazon stock gained 27% in the last 12 months.\nWhen buying a stock for a longer time horizon, it is important for investors to assess where they think the stock is headed in the future.\nWhen mapping a stock's future trajectory, investors should consider factors including the future earnings expectations and expected performance against a benchmark.\nAmazon.com's revenue has grown at an average rate of 17.61% annually over the past 5 years. The average 1-year price target from analysts is $223.06, representing an expected 30.6% upside in 2025.\nWhile past performance is not a guarantee of future results, investors should also look at a stock's historical performance when compared to both a benchmark index and the company's peers. Shares of Amazon.com have seen an annualized return of -0.05%, underperforming the S&P500 index by 7.33%. This compares to 0.99% growth in the overall Consumer Discretionary sector. Amazon.com has a beta of 1.55.\nPrice Action: AMZN stock traded higher by 0.74% at $172.06 premarket at last check Thursday.\nImage by mundissima via Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAMAZON.COM (AMZN): Free Stock Analysis Report\nThis article Amazon Moves Forward With Satellite Internet Ambitions, Secures New Zealand Land for Project Kuiper originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-08-07T03:59:00.000Z",
        "Title": "Amazon opens 'last mile' distribution center 2 years after completion",
        "Author": "  JOHN COX, The Bakersfield Californian ",
        "Text": "A $20 million \"last mile\" distribution center that sat empty on Wilson Road for two years after it was built finally opened last week, creating about 250 jobs and improving delivery service for local Amazon customers.\nThe 128,000-square-foot facility just west of Highway 99 is not expected to operate at full capacity until close to the holiday season, but it is officially running with dozens of Amazon and Budget rental delivery vans ready to go.\nAmazon now has three working distribution centers in Kern, including a 2.6 million-square-foot \"fulfillment\" center in Oildale across Merle Haggard Drive from Meadows Field Airport and a facility less than half that size designed for soft goods in Shafter. A fourth measuring 653,442 square feet was approved in late June by the county Board of Supervisors for construction just south of Bakersfield near Houghton and Wible roads.\nThe one on Wilson, at a former Kmart and Big Lots shopping center, is the smallest of the four, designed to take in six truckloads of consumer goods per day then sort and home-deliver them.\n“We are thrilled to continue investing in Bakersfield with the opening of our newest delivery station, bringing more great jobs with comprehensive benefits that start on day one to the region,\" Amazon spokesperson Natalie Banke said in an email statement Tuesday.\nAmazon put the brakes on the facility in summer 2022 just as construction finished. A subsequent report said the delay was part of a move by the company to cancel, delay or close 49 last-mile processing centers nationwide, for a total of 50.2 million square feet of warehouse space. The decision to do so was made just months after Amazon reported its slowest sales growth in decades.\nBanke reported Tuesday the new center will create more than 100 direct jobs with Amazon and more than 150 additional positions through what it called a delivery service provider. The program invites local entrepreneurs to build their own logistics business delivering packages for Amazon.\n\"We look forward to better serving our customers across Kern County with faster, more efficient deliveries as the station continues to ramp up,” she stated.\n"
    },
    {
        "Date": "2024-08-16T11:00:43.000Z",
        "Title": "Institutional investors control 63% of Amazon.com, Inc. (NASDAQ:AMZN) and were rewarded last week after stock increased 7.1%",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Institutions' substantial holdings in Amazon.com implies that they have significant influence over the company's share price\n47% of the business is held by the top 25 shareholders\n 11% of Amazon.com is held by insiders\nA look at the shareholders of Amazon.com, Inc. (NASDAQ:AMZN) can tell us which group is most powerful. The group holding the most number of shares in the company, around 63% to be precise, is institutions. Put another way, the group faces the maximum upside potential (or downside risk).\nAnd last week, institutional investors ended up benefitting the most after the company hit US$1.8t in market cap. The gains from last week would have further boosted the one-year return to shareholders which currently stand at 33%.\nLet's delve deeper into each type of owner of Amazon.com, beginning with the chart below.\n View our latest analysis for Amazon.com \nInstitutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\nAs you can see, institutional investors have a fair amount of stake in Amazon.com. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see Amazon.com's historic earnings and revenue below, but keep in mind there's always more to the story.\nInstitutional investors own over 50% of the company, so together than can probably strongly influence board decisions. Hedge funds don't have many shares in Amazon.com. Our data suggests that Jeffrey Bezos, who is also the company's Top Key Executive, holds the most number of shares at 8.8%. When an insider holds a sizeable amount of a company's stock, investors consider it as a positive sign because it suggests that insiders are willing to have their wealth tied up in the future of the company. For context, the second largest shareholder holds about 7.3% of the shares outstanding, followed by an ownership of 6.1% by the third-largest shareholder.\nOn studying our ownership data, we found that 25 of the top shareholders collectively own less than 50% of the share register, implying that no single individual has a majority interest.\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\nWhile the precise definition of an insider can be subjective, almost everyone considers board members to be insiders. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.\nMost consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group.\nOur information suggests that insiders maintain a significant holding in Amazon.com, Inc.. It has a market capitalization of just US$1.8t, and insiders have US$190b worth of shares in their own names. That's quite significant. Most would be pleased to see the board is investing alongside them. You may wish to access this free chart showing recent trading by insiders.\nThe general public-- including retail investors -- own 27% stake in the company, and hence can't easily be ignored. While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run.\nI find it very interesting to look at who exactly owns a company. But to truly gain insight, we need to consider other information, too.\nI like to dive deeper into how a company has performed in the past. You can access this interactive graph of past earnings, revenue and cash flow, for free.\nBut ultimately  it is the future, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at this free report showing whether analysts are predicting a brighter future.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-08-31T15:54:21.000Z",
        "Title": "Amazon.com, Inc. (AMZN): This AI Stock Is Trending Right Now",
        "Author": "  Usman Kabir ",
        "Text": "We recently compiled a list of the 18 Trending AI Stocks on Latest Analyst Ratings and News. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against the other trending AI stocks.\nGrowth investors have been piling into artificial intelligence (AI) stocks over the past few months as a variety of factors, including rapid technological advancements, soaring investment, and widespread adoption across sectors drive interest towards the AI business. Some important metrics illustrate this phenomenon. The global AI market was valued at approximately $142.3 billion in 2023 and is projected to grow at a compound annual growth rate of over 36%, reaching nearly $2 trillion by 2030. In 2024 alone, the AI market is expected to expand by around 40%, a pace that far outstrips the broader technology sector and the overall global economy, which is predicted to grow at a more modest 2.7%.\nRead more about these developments by accessing 33 Most Important AI Companies You Should Pay Attention To and 20 Industrial Stocks Already Riding the AI Wave.\nThis explosive growth is driven by the increasing integration of AI technologies across various industries, including healthcare, finance, retail, and manufacturing. Investment in AI is surging, with companies recognizing its potential to revolutionize business operations and deliver significant returns. According to PwC, AI could contribute up to $15.7 trillion to the global economy by 2030, with North America and China accounting for nearly 70% of this value. In 2024, corporate investment in AI is expected to surpass $500 billion, driven by companies seeking to enhance efficiency, reduce costs, and innovate their product offerings.\nIndustry experts are increasingly bullish on the long-term prospects for AI stocks. According to a survey by Gartner, 80% of executives believe that AI will be a critical business driver by 2025, with 75% already piloting or implementing AI solutions. McKinsey estimates that AI could deliver up to $6.1 trillion in annual value across industries, primarily through automation and optimization. This growing confidence in AI capabilities is reflected in the stock market, where AI-focused companies have consistently outperformed their peers. For instance, AI-driven companies have seen their stock prices surge by over 50% in 2023 alone, a trend expected to continue as demand for AI solutions grows.\nRead more about these developments by accessing Billionaire Stan Druckenmiller Is Betting On AI Infrastructure, Tobacco and Industrial Stocks and 10 Tech Stocks to Monitor Amid Market Volatility According to Bernstein Analyst.\nThese AI-focused firms are also investing in AI startups as they seek to diversify their businesses. NVIDIA, Apple, and Microsoft are all reportedly considering a huge investment in OpenAI, a California-based AI firms whose claim to fame is the launch of ChatGPT back in late 2022. If the rumors are true, the latest round of funding would take the valuation of the startup to $100 billion. For some additional context, this value is higher than the combined GDPs of 110 nations, the highest for any venture capital backed firm in the US since Facebook's IPO, and the most valuable private firm in the US after Musk-owned SpaceX.\nThis high valuation also follows an emerging trend in the startup universe. Research into the domain by Coatue Management reveals that up until June 2024 year-to-date, there were a total of 200 AI-related deals in the venture capital world, compared to just 7,000 for non-AI firms. The average valuation in these deals for AI startups was around $1 billion. On the non-AI side, this value was only $200 million. The average funding round for AI firms fetched over $120 million, while this figure for non-AI companies was around $20 million. The numbers highlight that AI firms, on average, are valued at five times more than their non-AI peers and raise six times more in funding.\nOur Methodology\nFor this article, we selected AI stocks based on the latest news and analyst ratings. These stocks are also popular among hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA customer entering an internet retail store, illustrating the convenience of online shopping.\nNumber of Hedge Fund Holders: 308    \nAmazon.com, Inc. (NASDAQ:AMZN) engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. Latest reports reveal that the US government has signed a deal with Anthropic, a US-based AI startup backed by Amazon, for research, testing and evaluation of their artificial intelligence model. Under the terms of the deal, an institute associated with the government would receive access to the AI model before and after the public release. Anthropic is one of the leading developers of a large language model (LLM), the cutting edge tech that forms the basis for the popularity of ChatGPT by OpenAI.\nAmazon.com, Inc. (NASDAQ:AMZN) is one of the most followed stocks on Wall Street. Wells Fargo has an Overweight rating on the shares with a price target of $225. In a recent investor note, the advisory underlined that heavy upfront costs related to satellite launches, commencing in the second half of 2024, would reduce operating income forecasts for Amazon from 2025 through 2027, even as the launches present an attractive longer term opportunity.\nOverall AMZN ranks 3rd on our list of the trending AI stocks. While we acknowledge the potential of AMZN as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AMZN but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    }
]