[
    {
        "Date": "2024-09-25T10:52:26.000Z",
        "Title": "Amazon Fresh breaks the 50-store mark",
        "Author": "  Sam Silverstein ",
        "Text": "This story was originally published on Grocery Dive. To receive daily news and insights, subscribe to our free daily Grocery Dive newsletter. \nRecommended Reading \nAmazon Fresh debuts four new stores\nAmazon Fresh plans to debut a store in Oxford Valley, Pennsylvania, on Thursday and opened new locations in Fontana and Elk Grove, California, on Sept. 12, according to a spokesperson.\nThe new locations bring Amazon Fresh’s fleet to 52 stores in eight states.\nAmazon recently accelerated development of the supermarket chain after pausing its efforts to expand the concept early last year.\nAmazon’s decision to add more Amazon Fresh locations suggests that the company believes it has hit on a scalable approach for the young supermarket chain after spending months rethinking its approach to running traditional grocery stores.\nIn addition to the latest openings, Amazon debuted four new stores on Aug. 22 and one in Gaithersburg, Maryland, on Aug. 8.\nThe company has also been renovating stores in the Amazon Fresh fleet, and is showing off updates to four existing locations — two in California, one in Virginia and another in Maryland — this week, the spokesperson wrote in an email. Amazon also completed upgrades to three Los Angeles-area stores and two Illinois locations this month, and updated a location in Bloomingdale, Illinois, in August, according to the spokesperson.\nAmazon plans to continue to refine its approach to running supermarkets, the spokesperson said, adding that Amazon’s ongoing efforts to spiff up Amazon Fresh locations have been paying off in terms of positive results, higher customer satisfaction scores and increased sales.\nThe chain has recently increased its presence in several states\nAmazon Fresh opened its first store in mid-2020, but paused store openings less than three years later due to an underwhelming reception from shoppers. The company brought in new executives and spent months adjusting its approach. Amazon unveiled a refreshed store model for the chain late last year that features new signage, stronger price messaging and an expanded assortment of products aimed at fulfilling a full shopping trip.\nAmazon also decided to pull its Just Walk Out checkout-free technology from its Fresh stores and focus instead on its proprietary smart cart, known as the Dash Cart, for high-tech shopping. Amazon Fresh has also added a discount private label brand and amped up its price messaging through expanded Prime discounts.\nBeyond the openings it has announced, Amazon has posted job listings that suggest the company has more Amazon Fresh stores in the works. As of Sept. 25, Amazon is recruiting for roles at locations in Torrance and Poway, California; Glen Burnie, Maryland; Woodland Park, New Jersey; Willow Grove, Pennsylvania; and East Setauket and Plainview, New York.\n"
    },
    {
        "Date": "2024-09-09T12:49:32.000Z",
        "Title": "What Makes Amazon.com (AMZN) a Growth Company?",
        "Author": "  Soumya Eswaran ",
        "Text": "Hayden Capital, an investment management firm, released its second-quarter 2024 investment letter. A copy of the letter can be downloaded here. Driven by the core positions, the portfolio rose in the past few months. The firm is currently seeing signs of market stabilization following the erratic macroeconomic environment of the past few years. In the second quarter, the portfolio generated a 7.0% return compared to a 4.3% return for the S&P 500 and a 2.9% return for the MSCI World Index. The firm’s assets are invested in Asia at approximately 57%, in North America at approximately 41%, and the remainder in cash. In addition, you can check the fund's top 5 holdings to determine its best picks for 2024.\nHayden Capital highlighted stocks like Amazon.com, Inc. (NASDAQ:AMZN) in its Q2 2024 investor letter. Amazon.com, Inc. (NASDAQ:AMZN) provides consumer products, advertising, and subscription services through online and physical stores that operates through North America, International, and Amazon Web Services (AWS) segments. The one-month return of Amazon.com, Inc. (NASDAQ:AMZN) was 2.75%, and its shares gained 19.77% of their value over the last 52 weeks. On September 6, 2024, Amazon.com, Inc. (NASDAQ:AMZN) stock closed at $171.39 per share with a market capitalization of $1.799 trillion.\nHayden Capital stated the following regarding Amazon.com, Inc. (NASDAQ:AMZN) in its Q2 2024 investor letter:\n\"Our portfolio is still recovering from the 2022 downturn, although we’ve made meaningful progress in the last two years. While that experience has taught us many lessons, that dislocation also provided a rich vein of opportunities that we continue to mine today\nA customer entering an internet retail store, illustrating the convenience of online shopping.\nAmazon.com, Inc. (NASDAQ:AMZN) is in first position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 308 hedge fund portfolios held Amazon.com, Inc. (NASDAQ:AMZN) at the end of the second quarter which was 302 in the previous quarter. In the second quarter, Amazon.com, Inc. (NASDAQ:AMZN) delivered $148 billion in revenue, up 11% year-over-year. While we acknowledge the potential of Amazon.com, Inc. (NASDAQ:AMZN) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Amazon.com, Inc. (NASDAQ:AMZN) and shared the list of best magic formula stocks for the rest of 2024. In addition, please check out our hedge fund investor letters Q2 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-09-17T12:05:23.000Z",
        "Title": "Amazon’s Five-Day Office Mandate Isn’t as Strict as it Sounds",
        "Author": "  Jo Constantz ",
        "Text": "(Bloomberg) -- Amazon.com Inc. Chief Executive Officer Andy Jassy is ordering his employees to return to the office five days a week beginning in January. But the policy isn’t airtight.\nMost Read from Bloomberg\nAOC Proposes $30 Billion Social Housing Authority\nThe Moonshot Plan to Eliminate Deaths on America’s Roads\nCalifornia’s Anti-Speeding Bill Can Be a Traffic Safety Breakthrough\nNew York City’s Transit System Plans $65.4 Billion of Upgrades for Grand Central, Subways\nTo Build a Happier City, Design for Density\nThe company, which previously required employees to badge in three days a week, will make exceptions for managers already approved for fully remote positions, Jassy said in a Monday note to employees. Flexibility for health concerns and other special situations would also continue.\n“Before the pandemic, it was not a given that folks could work remotely two days a week, and that will also be true moving forward — our expectation is that people will be in the office outside of extenuating circumstances,” he wrote, referencing workers with sick children, house emergencies or those needing a “day or two to finish coding in a more isolated environment.”\nMandated policies, however, don’t always translate into full-scale adherence.\n“The issue with RTO is compliance,” said Prithwiraj Choudhury, an associate professor at Harvard Business School who studies remote work. “You might have a memo, but how do you ensure people follow your memo?”\nAmazon joins a number of other high-profile companies, like Citigroup Inc., Walmart Inc., and carmaker Stellantis NV, in tightening return-to-office requirements in the last several months. At some of the companies, those who didn’t agree to come back to an office were let go.\nEven so, the amount of time workers spend working in offices hasn’t ticked up all that much since the beginning of last year. Offices across the US are still only about half as full as they were before the pandemic, according to badge swipe data from security firm Kastle Systems.\nThat’s partly because work norms and practices have changed so substantially since the pandemic. In the US, people worked remotely about one or two days a month before 2020, according to data from the US Bureau of Labor Statistics. Four years on, people “are now used to working in a different way,” Choudhury said. “Exceptions might become the norm.”\nChoudhury said he expects some of Amazon’s top performers to quit as a result of Jassy’s newest mandate. He also said a shift back to stricter in-office rules could impact the company’s ability to attract women and people of color. Researchers at the Wharton School of the University of Pennsylvania found that job postings that advertise remote work attract a substantially more diverse pool of applicants.\nStill, many CEOs around the world are digging in.\nChris Ellison, CEO of Australian mining company Mineral Resources Ltd. said he has a “no work-from-home” policy and a headquarters office with a cafe, restaurant, gym, daycare, and wellness center. “I don’t want them leaving the building,” he said on an earnings call last month. “I want to hold them captive all day long.”\nMost Read from Bloomberg Businessweek\nThe Man Who Made Nike Uncool\nTrump’s Pet-Eating Rant Was an Effective Act of Misdirection\nThe Host of Hot Ones Spills the Secrets of His Success\nHow a Former IRS Agent Got Locked Up in a Nigerian Prison\nThe Fed Risks a Political Backlash by Spurring Economy Close to Election\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-09-04T21:36:58.000Z",
        "Title": "Amazon.com, Inc. (AMZN): An AI Stock That Broke The Internet This Week",
        "Author": "  Usman Kabir ",
        "Text": "We recently compiled a list of the AI News That Broke The Internet This Week. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against the other AI stocks that broke the Internet this week.\nArtificial Intelligence is increasingly becoming indispensable for large businesses, providing them with tools to drive efficiency, innovation, and competitive advantage. As AI technology continues to evolve, the importance it has to large enterprises is underscored by significant investments and impressive returns. For example, the ability of AI to automate and optimize business processes is one of the most significant advantages for large companies. AI-driven automation can streamline supply chain management, optimize logistics, and improve customer service through chatbots and personalized recommendations. According to a report by McKinsey, companies that fully leverage AI could see a 20-25% increase in cash flow​.\nRead more about these developments by accessing 33 Most Important AI Companies You Should Pay Attention To and 10 AI Stocks That Could Go Parabolic.\nIn financial services, AI is transforming risk management, fraud detection, and customer insights. JPMorgan Chase, for instance, uses AI to review legal documents, a task that used to take thousands of hours of manual work, now accomplished in mere seconds. In the pharmaceutical industry, AI is accelerating drug discovery processes. For instance, companies like Pfizer have used AI to analyze vast datasets to identify potential drug candidates much faster than traditional methods. This not only speeds up the time-to-market for new drugs but also significantly reduces research and development costs, which are estimated to average around $2.6 billion per drug​.\nMoreover, AI is enabling companies to offer more personalized experiences to customers. Retail giants like Amazon and Walmart use AI algorithms to analyze customer behavior and preferences, tailoring recommendations that enhance the shopping experience and increase sales. Amazon’s recommendation engine, powered by AI, is responsible for 35% of the company’s total sales​. NVIDIA, a leader in AI hardware, exemplifies how AI can drive business success. In the second quarter of fiscal 2025, the company reported $30 billion in revenue, with AI contributing significantly to this figure​. The company’s GPUs are the backbone of AI models used across industries, from autonomous vehicles to large-scale data analysis, demonstrating the critical role AI plays in both revenue generation and technological advancement.\nRead more about these developments by accessing Billionaire Stan Druckenmiller Is Betting On AI Infrastructure, Tobacco and Industrial Stocks and 10 Tech Stocks to Monitor Amid Market Volatility According to Bernstein Analyst..\nOur Methodology\nFor this article, we selected AI stocks that have been in the news this week. These stocks are also popular among hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA customer entering an internet retail store, illustrating the convenience of online shopping.\nNumber of Hedge Fund Holders: 308    \nAmazon.com, Inc. (NASDAQ:AMZN) engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. Recent reports indicate that Amazon will use Anthropic's AI model, developed by a California-based startup, to power the latest updates to its virtual assistant, Alexa. This decision hints at shortcomings in Amazon's in-house AI models, with some sources telling Reuters that these internal models suffer from lag times of six to seven seconds and issues with consistency and accuracy. The tech giant plans to charge $5 or $10 per month for Alexa's advanced AI features.\nAmazon.com, Inc. (NASDAQ:AMZN) is also in the news after recent reports in the media claimed that Chinese companies are bypassing US export bans on AI-related products, software, and technology by leveraging American cloud service providers. These providers, including Amazon's AWS, have integrated AI features into their platforms over the past few months to meet the rapidly growing demand for advanced technology. A report initially published by Reuters alleges that Amazon has granted Chinese entities access to high-end AI chips and advanced models such as Claude.\nOverall AMZN ranks 3rd on our list of the AI stocks that broke the Internet this week. While we acknowledge the potential of AMZN as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AMZN but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-09-06T17:30:03.000Z",
        "Title": "Would a gen AI-powered Alexa return real profits for Amazon?",
        "Author": "  Jason Del Rey ",
        "Text": "Ten years ago this November, Amazon released a breakthrough device with an understated tweet.\n“Introducing Amazon Echo,” it read. “Always ready, connected, and fast. Just ask.”\nBuried within the subsequent announcement was the introduction of Alexa, too, which quickly captured the minds of consumers young and old on its way to becoming a cultural phenomenon. Coming on the heels of Amazon’s Fire phone flop, the release felt even more astonishing.\nFor a period of time in my household, Alexa felt like magic. Sure, we queried it for weather updates and asked it to serve as a timer during cooking. But it was the ability for our young kids to start a post-meal dance party by uttering just a few words that, looking back, my wife and I remember the most fondly. No, the speaker didn’t have the greatest sound. But it was more than passable and the moments it helped create for our family were delightful.\nThe problem for Amazon, eventually, was that our usage of Alexa never translated into real incremental revenue or profit for the company once the Echo was in our house. We didn’t shop from the company any more than we did before and slowly stopped engaging overall as much as we once did. Over time, Alexa started to sound more desperate, too, offering us suggestions we had no interest in after an answer to our actual query was given. Along the way, Amazon was still spending billions with no real return in sight.\nThen, ChatGPT and the generative AI boom happened, and Alexa was caught flat-footed as my colleague Sharon Goldman reported in depth. Now, a gen AI-powered version of Alexa could be announced as early as this month, but it is expected to come with a monthly fee. Yes, Amazon has half a billion Alexa-powered devices out in the world, but it may be an uphill battle to convert enough existing users to a paid version years after the popularity of the original Alexa peaked.\nIf unsuccessful, it’s fair to wonder how Amazon CEO Andy Jassy would react. He hasn’t been afraid to course-correct and cost-cut aggressively in his three years as chief executive. He could decide that Amazon’s AWS cloud business, with its multiple positions in the AI land grab, is enough.\nThen again, a 500-million device footprint is massive and Amazon has pleasantly surprised the masses and the media before, as the early years of Alexa proved. Can they do it again?\nMore news below.\nJason Del Rey\nWant to send thoughts or suggestions to Data Sheet? Drop a line here.\nThe rest of today's Data Sheet was written by David Meyer.\nThis story was originally featured on Fortune.com\n"
    }
]